{
    "published_book": "{\"content\":[{\"chapter\":\"\",\"pages\":[\"Page 701 1 Peter\\nThe First Epistle General of Peter\\n   \\n{1:1} Peter, an apostle of Jesus Christ, to the strangers\\nscattered throughout Pontus, Galatia, Cappadocia, Asia, and\\nBithynia, {1:2} Elect according to the foreknowledge of\\nGod the Father, through sanctification of the Spirit, unto\\nobedience and sprinkling of the blood of Jesus Christ: Grace\\nunto you, and peace, be multiplied.\\n{1:3} Blessed [be] the God and Father of our Lord Jesus\\nChrist, which according to his abundant mercy hath\\nbegotten us again unto a lively hope by the resurrection of\\nJesus Christ from the dead, {1:4} To an inheritance\\nincorruptible, and undefiled, and that fadeth not away,\\nreserved in heaven for you, {1:5} Who are kept by the\\npower of God through faith unto salvation ready to be\\nrevealed in the last time. {1:6} Wherein ye greatly rejoice,\\nthough now for a season, if need be, ye are in heaviness\\nthrough manifold temptations: {1:7} That the trial of your\\nfaith, being much more precious than of gold that perisheth,\\nthough it be tried with fire, might be found unto praise and\\nhonour and glory at the appearing of Jesus Christ: {1:8}\\nWhom having not seen, ye love; in whom, though now ye\\nsee [him] not, yet believing, ye rejoice with joy unspeakable\\nand full of glory: {1:9} Receiving the end of your faith,\\n[even] the salvation of [your] souls. {1:10} Of which\\nsalvation the prophets have enquired and searched\\ndiligently, who prophesied of the grace [that should come]\\nunto you: {1:11} Searching what, or what manner of time\\nthe Spirit of Christ which was in them did signify, when it\\ntestified beforehand the sufferings of Christ, and the glory\\nthat should follow. {1:12} Unto whom it was revealed, that\\nnot unto themselves, but unto us they did minister the\\nthings, which are now reported unto you by them that have\\npreached the gospel unto you with the Holy Ghost sent\\ndown from heaven; which things the angels desire to look\\ninto. {1:13} Wherefore gird up the loins of your mind, be\\nsober, and hope to the end for the grace that is to be brought\\nunto you at the revelation of Jesus Christ; {1:14} As\\nobedient children, not fashioning yourselves according to\\nthe former lusts in your ignorance: {1:15} But as he which\\nhath called you is holy, so be ye holy in all manner of\\nconversation; {1:16} Because it is written, Be ye holy; for I\\nam holy. {1:17} And if ye call on the Father, who without\\nrespect of persons judgeth according to every man's work,\\npass the time of your sojourning [here] in fear: {1:18}\\nForasmuch as ye know that ye were not redeemed with\\ncorruptible things, [as] silver and gold, from your vain\\nconversation [received] by tradition from your fathers;\\n{1:19} But with the precious blood of Christ, as of a lamb\\nwithout blemish and without spot: {1:20} Who verily was\\nforeordained before the foundation of the world, but was\\nmanifest in these last times for you, {1:21} Who by him do\\nbelieve in God, that raised him up from the dead, and gave\\nhim glory; that your faith and hope might be in God. {1:22}\\nSeeing ye have purified your souls in obeying the truth\\nthrough the Spirit unto unfeigned love of the brethren, [see\\nthat ye] love one another with a pure heart fervently: {1:23}\\nBeing born again, not of corruptible seed, but of\\nincorruptible, by the word of God, which liveth and abideth\\nfor ever. {1:24} For all flesh [is] as grass, and all the glory\\nof man as the flower of grass. The grass withereth, and the\\nflower thereof falleth away: {1:25} But the word of the\\nLord endureth for ever. And this is the word which by the\\ngospel is preached unto you.\\n{2:1} Wherefore laying aside all malice, and all guile, andhypocrisies, and envies, and all evil speakings, {2:2} As\\nnewborn babes, desire the sincere milk of the word, that ye\\nmay grow thereby: {2:3} If so be ye have tasted that the\\nLord [is] gracious. {2:4} To whom coming, [as unto] a\\nliving stone, disallowed indeed of men, but chosen of God,\\n[and] precious, {2:5} Ye also, as lively stones, are built up a\\nspiritual house, an holy priesthood, to offer up spiritual\\nsacrifices, acceptable to God by Jesus Christ. {2:6}\\nWherefore also it is contained in the scripture, Behold, I lay\\nin Sion a chief corner stone, elect, precious: and he that\\nbelieveth on him shall not be confounded. {2:7} Unto you\\ntherefore which believe [he is] precious: but unto them\\nwhich be disobedient, the stone which the builders\\ndisallowed, the same is made the head of the corner, {2:8}\\nAnd a stone of stumbling, and a rock of offence, [even to\\nthem] which stumble at the word, being disobedient:\\nwhereunto also they were appointed. {2:9} But ye [are] a\\nchosen generation, a royal priesthood, an holy nation, a\\npeculiar people; that ye should shew forth the praises of him\\nwho hath called you out of darkness into his marvellous\\nlight: {2:10} Which in time past [were] not a people, but\\n[are] now the people of God: which had not obtained mercy,\\nbut now have obtained mercy.\\n{2:11} Dearly beloved, I beseech [you] as strangers and\\npilgrims, abstain from fleshly lusts, which war against the\\nsoul; {2:12} Having your conversation honest among the\\nGentiles: that, whereas they speak against you as evildoers,\\nthey may by [your] good works, which they shall behold,\\nglorify God in the day of visitation.\\n{2:13} Submit yourselves to every ordinance of man for\\nthe Lord's sake: whether it be to the king, as supreme;\\n{2:14} Or unto governors, as unto them that are sent by him\\nfor the punishment of evildoers, and for the praise of them\\nthat do well. {2:15} For so is the will of God, that with well\\ndoing ye may put to silence the ignorance of foolish men:\\n{2:16} As free, and not using [your] liberty for a cloke of\\nmaliciousness, but as the servants of God. {2:17} Honour\\nall [men.] Love the brotherhood. Fear God. Honour the\\nking. {2:18} Servants, [be] subject to [your] masters with\\nall fear; not only to the good and gentle, but also to the\\nfroward. {2:19} For this [is] thankworthy, if a man for\\nconscience toward God endure grief, suffering wrongfully.\\n{2:20} For what glory [is it,] if, when ye be buffeted for\\nyour faults, ye shall take it patiently? but if, when ye do\\nwell, and suffer [for it,] ye take it patiently, this [is]\\nacceptable with God. {2:21} For even hereunto were ye\\ncalled: because Christ also suffered for us, leaving us an\\nexample, that ye should follow his steps: {2:22} Who did\\nno sin, neither was guile found in his mouth: {2:23} Who,\\nwhen he was reviled, reviled not again; when he suffered,\\nhe threatened not; but committed [himself] to him that\\njudgeth righteously: {2:24} Who his own self bare our sins\\nin his own body on the tree, that we, being dead to sins,\\nshould live unto righteousness: by whose stripes ye were\\nhealed. {2:25} For ye were as sheep going astray; but are\\nnow returned unto the Shepherd and Bishop of your souls.\\n{3:1} Likewise, ye wives, [be] in subjection to your own\\nhusbands; that, if any obey not the word, they also may\\nwithout the word be won by the conversation of the wives;\\n{3:2} While they behold your chaste conversation [coupled]\\nwith fear. {3:3} Whose adorning let it not be that outward\\n[adorning] of plaiting the hair, and of wearing of gold, or of\\nputting on of apparel; {3:4} But [let it be] the hidden man\\nof the heart, in that which is not corruptible, [even the\\nornament] of a meek and quiet spirit, which is in the sight of\\nGod of great price. {3:5} For after this manner in the old\\nwww.holybooks.com\"],\"start\":0,\"end\":1,\"length\":2},{\"chapter\":\"\",\"pages\":[\"1 Peter Page 702\\ntime the holy women also, who trusted in God, adorned\\nthemselves, being in subjection unto their own husbands:\\n{3:6} Even as Sarah obeyed Abraham, calling him lord:\\nwhose daughters ye are, as long as ye do well, and are not\\nafraid with any amazement. {3:7} Likewise, ye husbands,\\ndwell with [them] according to knowledge, giving honour\\nunto the wife, as unto the weaker vessel, and as being heirs\\ntogether of the grace of life; that your prayers be not\\nhindered. {3:8} Finally, [be ye] all of one mind, having\\ncompassion one of another, love as brethren, [be] pitiful,\\n[be] courteous: {3:9} Not rendering evil for evil, or railing\\nfor railing: but contrariwise blessing; knowing that ye are\\nthereunto called, that ye should inherit a blessing. {3:10}\\nFor he that will love life, and see good days, let him refrain\\nhis tongue from evil, and his lips that they speak no guile:\\n{3:11} Let him eschew evil, and do good; let him seek\\npeace, and ensue it. {3:12} For the eyes of the Lord [are]\\nover the righteous, and his ears [are open] unto their\\nprayers: but the face of the Lord [is] against them that do\\nevil.\\n{3:13} And who [is] he that will harm you, if ye be\\nfollowers of that which is good? {3:14} But and if ye suffer\\nfor righteousness' sake, happy [are ye:] and be not afraid of\\ntheir terror, neither be troubled; {3:15} But sanctify the\\nLord God in your hearts: and [be] ready always to [give] an\\nanswer to every man that asketh you a reason of the hope\\nthat is in you with meekness and fear: {3:16} Having a\\ngood conscience; that, whereas they speak evil of you, as of\\nevildoers, they may be ashamed that falsely accuse your\\ngood conversation in Christ. {3:17} For [it is] better, if the\\nwill of God be so, that ye suffer for well doing, than for evil\\ndoing. {3:18} For Christ also hath once suffered for sins,\\nthe just for the unjust, that he might bring us to God, being\\nput to death in the flesh, but quickened by the Spirit: {3:19}\\nBy which also he went and preached unto the spirits in\\nprison; {3:20} Which sometime were disobedient, when\\nonce the longsuffering of God waited in the days of Noah,\\nwhile the ark was a preparing, wherein few, that is, eight\\nsouls were saved by water. {3:21} The like figure\\nwhereunto [even] baptism doth also now save us (not the\\nputting away of the filth of the flesh, but the answer of a\\ngood conscience toward God,) by the resurrection of Jesus\\nChrist: {3:22} Who is gone into heaven, and is on the right\\nhand of God; angels and authorities and powers being made\\nsubject unto him.\\n{4:1} Forasmuch then as Christ hath suffered for us in the\\nflesh, arm yourselves likewise with the same mind: for he\\nthat hath suffered in the flesh hath ceased from sin; {4:2}\\nThat he no longer should live the rest of [his] time in the\\nflesh to the lusts of men, but to the will of God. {4:3} For\\nthe time past of [our] life may suffice us to have wrought\\nthe will of the Gentiles, when we walked in lasciviousness,\\nlusts, excess of wine, revellings, banquetings, and\\nabominable idolatries: {4:4} Wherein they think it strange\\nthat ye run not with [them] to the same excess of riot,\\nspeaking evil of [you: ]{4:5} Who shall give account to him\\nthat is ready to judge the quick and the dead. {4:6} For for\\nthis cause was the gospel preached also to them that are\\ndead, that they might be judged according to men in the\\nflesh, but live according to God in the spirit.\\n{4:7} But the end of all things is at hand: be ye therefore\\nsober, and watch unto prayer. {4:8} And above all things\\nhave fervent charity among yourselves: for charity shall\\ncover the multitude of sins. {4:9} Use hospitality one to\\nanother without grudging. {4:10} As every man hath\\nreceived the gift, [even so] minister the same one to another,as good stewards of the manifold grace of God. {4:11} If\\nany man speak, [let him speak] as the oracles of God; if any\\nman minister, [let him do it] as of the ability which God\\ngiveth: that God in all things may be glorified through Jesus\\nChrist, to whom be praise and dominion for ever and ever.\\nAmen.\\n{4:12} Beloved, think it not strange concerning the fiery\\ntrial which is to try you, as though some strange thing\\nhappened unto you: {4:13} But rejoice, inasmuch as ye are\\npartakers of Christ's sufferings; that, when his glory shall be\\nrevealed, ye may be glad also with exceeding joy. {4:14} If\\nye be reproached for the name of Christ, happy [are ye;] for\\nthe spirit of glory and of God resteth upon you: on their part\\nhe is evil spoken of, but on your part he is glorified. {4:15}\\nBut let none of you suffer as a murderer, or [as] a thief, or\\n[as] an evildoer, or as a busybody in other men's matters.\\n{4:16} Yet if [any man suffer] as a Christian, let him not be\\nashamed; but let him glorify God on this behalf. {4:17} For\\nthe time [is come] that judgment must begin at the house of\\nGod: and if [it] first [begin] at us, what shall the end [be] of\\nthem that obey not the gospel of God? {4:18} And if the\\nrighteous scarcely be saved, where shall the ungodly and the\\nsinner appear? {4:19} Wherefore let them that suffer\\naccording to the will of God commit the keeping of their\\nsouls [to him] in well doing, as unto a faithful Creator.\\n{5:1} The elders which are among you I exhort, who am\\nalso an elder, and a witness of the sufferings of Christ, and\\nalso a partaker of the glory that shall be revealed: {5:2}\\nFeed the flock of God which is among you, taking the\\noversight [thereof,] not by constraint, but willingly; not for\\nfilthy lucre, but of a ready mind; {5:3} Neither as being\\nlords over [God's] heritage, but being ensamples to the\\nflock. {5:4} And when the chief Shepherd shall appear, ye\\nshall receive a crown of glory that fadeth not away. {5:5}\\nLikewise, ye younger, submit yourselves unto the elder.\\nYea, all [of you] be subject one to another, and be clothed\\nwith humility: for God resisteth the proud, and giveth grace\\nto the humble.\\n{5:6} Humble yourselves therefore under the mighty hand\\nof God, that he may exalt you in due time: {5:7} Casting all\\nyour care upon him; for he careth for you. {5:8} Be sober,\\nbe vigilant; because your adversary the devil, as a roaring\\nlion, walketh about, seeking whom he may devour: {5:9}\\nWhom resist stedfast in the faith, knowing that the same\\nafflictions are accomplished in your brethren that are in the\\nworld. {5:10} But the God of all grace, who hath called us\\nunto his eternal glory by Christ Jesus, after that ye have\\nsuffered a while, make you perfect, stablish, strengthen,\\nsettle [you. ]{5:11} To him [be] glory and dominion for\\never and ever. Amen.\\n{5:12} By Silvanus, a faithful brother unto you, as I\\nsuppose, I have written briefly, exhorting, and testifying\\nthat this is the true grace of God wherein ye stand. {5:13}\\nThe [church that is] at Babylon, elected together with [you,]\\nsaluteth you; and [so doth] Marcus my son. {5:14} Greet ye\\none another with a kiss of charity. Peace [be] with you all\\nthat are in Christ Jesus. Amen.\\nwww.holybooks.com\"],\"start\":0,\"end\":1,\"length\":2}]}",
    "book_index": "[]"
}