{
    "published_book": "[\"0\",\"THE DESERTED WIFE OU came—a simple lad In dark blue cotton clad, To barter serge for silken wear ; But not for silk you dallied there. Ah! was it not for me Who led you through the K’e, Who guided you To far Tun-K’ew ? ‘‘It is not I who would put off the day ; But you have none your cause to plead,” I said,—‘‘ O love, take heed, When the leaves fall do with me what you may.’ I saw the red leaves fall, And climbed the ruined wall, Towards the city of Fuh-kwan I did the dim horizon scan. ‘*He cometh not,” I said, And burning tears were shed: You came—I smiled, Love-reconciled, You said, ‘‘ By taper reed and tortoise-shell, I have divined, and all, O love, is well.” / 18 B0\",\"‘‘ Then haste the car,” I cried, ‘‘Gather my goods and take me to thy side.” Before the mulberry tree With leaves hath strewn the fea, How glossy-green are they! how rare! Ah! thou young thoughtless dove beware! Avoid the dark fruit rife | With sorrow to thy hife. And thou, whose fence Is innocence, Seek no sweet pleasuring with any youth! For when a man‘hath sinned, but little shame Is fastened to his name, Yet erring woman wears the garb of ruth. When the lone mulberry tree With leaves bestrews the lea, They yellow slowly, slowly down From green to gold, from gold to brown. Three sombre years ago I fled with you, and lo, The floods of K’e Now silently Creep to the curtains of my little car. Through cloud and gloom I was your constant star ; Now you have gone from sight, And love’s white star roams aimless through the night. 160\",\"For three long years your wife, Toil was my part in life, Early from sleep I rose and went About my labour, calm, content ; Nor any morn serene Lightened the dull routine. Early and late, I was your mate, Bearing the burdens that were yours to share. Fain of the little love that was my lot, Ah, kinsmen scorn me not! How should ye know when silence chills despair? Old we should grow in accord, Old—and grief is my lord. Between her banks the K’e doth steer, And pine-woods ring the lonely mere. In pleasant times I bound My dark hair to the sound Of whispered vows \\\"Neath lilac boughs, And little recked o’er broken faith to weep. Now the grey shadows o’er the marshland creep : The willows stir and fret: Low in the west the dull dun sun hath set. 470\",\"KING'S MESSENGER ALLOPING, galloping, gallant steed ; Six reins slackened and dull with sweat, Galloping, galloping still we speed, Seeking, counselling, onward set. Galloping, galloping, piebald steed ; Six reins, silken reins, start and strain, Galloping, galloping, still we speed, News—what news—from the King’s domain. Galloping, galloping, white and black ; Six reins glossy and flaked with foam, Galloping, galloping, look not back ! On for the King—for the King we roam. Galloping, galloping, dappled grey ; Six reins true to the hand alone, Galloping, galloping, night and day, Seeking, questioning, galloping, gone! 180\",\"FLIGHT OLD and keen the north wind blows, Silent falls the shroud of snows. You who gave me your heart Let us join hands and depart! Is this a time for delay ? Now, while we may, Let us away. Wailingly the north wind goes, Wailing through a whirl of snows. You who gave me your heart Let us join hands and depart ! Is this a time for delay ? Now, while we may, Let us away. Only the lonely fox is red, Black but the crow-flight overhead. You who gave me your heart, The chariot creaks to depart, Is this a time for delay ? Now, while we may, Let us away. i90\",\"THE TOWER OF WAN AN drew a tower of bold ascent, A tower of lofty size. In crowds the zealous builders went, The walls began to rise. ‘* Haste not,” said he, when first the work began ; But all the people were as sons of W4n. The King was in the wondrous park, The does so sleek and brown Lay couched in fern; from dawn to dark White birds came glistening down; The King was by the pond whose waters hold A thousand carp with ruddy scales of gold. Upon his posts the fretted board Is hung with drums and bells ; What music chimes from their accord, What sound of laughter swells From the pavilion of the circling pool Where joy and W4n, the brother monarchs, rule. What harmony of bells and drums! What call of drums and bells! Beyond the flaming water comes What sound of happy Spells. The blind musicians blind us with delight ; While the deep lizard drums roll on till night. 200\",\"DRIFTING WO youths into their boats descend, Whose shadows on the waters sway ; Ah! light hearts bravely sped away, My heavy heart forbodes the end. Two youths into their boats descend, Two lives go drifting far from me; Between the willow glooms I see Death lurking at the river’s bend. 210\",\"THE SLANDERERS HE blue flies buzz upon the wing, From fence to fence they wander 3 O happy King! O courteous King! Give heed to no man’s slander, The noisy blue flies rumble round, Upon the gum-trees lighting ; A tongue of evil hath no bound, And sets the realm a-fighting. The clumsy blue flies buzzing round Upon the hazels blunder ; O cursed tongue that knows no bound, And sets us two asunder. a20\",\"LOVE AND THE MAGISTRATE HEN the great carriage rumbles by, I see him in his robes of state, Calm, pitiless, sedate, Man of the cold far-piercing eye. O but I long for you, Right for you, wrong for you, Naught could keep us apart, But the cold eye reading my heart. When the great carriage rumbles on, In robes of state carnation red I see the man of dread, Bright gleaming robes and glance of stone. O then I long for you, Right for you, wrong for you, Naught could keep us apart But the cold eye reading my heart. Together we may never bide, Nor you and me one roof contain, But death shall not divide ; The same close grave shall wed the twain. Say! am I cold to you? Nay! I will hold to you, By the bright sun I swear, O my life, my love, my despair. 230\",\"CITY OF CHOW OLD from the spring the waters pass Over the waving pampas grass. All night long in dream I lie, Ah me! ah me! to awake and sigh— Sigh for the City of Chow. Cold from the spring the rising flood Covers the tangled southernwood. All night long in dream I lie, Ah me! ah me! to awake and sigh— Sigh for the City of Chow. Cold from its source the stream meanders, Darkly down through the oleanders. All night long in dream I lie, Ah me ! ah me! to awake and sigh— Sigh for the City of Chow. 240\",\"THE PRAYER OF THE EMPEROR CHING _ ET me be reverent, be reverent, Even as the way of Heaven is evident, And its appointment easy is to mar. Let me not say, ‘‘It is too high above,” Above us and below us doth it move, And daily watches wheresoe’er we are. It is but as a little child I ask, Without intelligence to do my task, Yet learning, month by month, and day by day, I will hold fast some gleams of knowledge bright. Help me to bear my heavy burden right, And show me how to walk in wisdom’s way. a50\",\"li THE PRAYER OF THE EMPEROR CHING VEN as a little helpless child am I, On whom hath fallen the perplexed affairs Of this unsettled state. High loneliness And sorrow are my portion. Thou great Father, Thou kingly pattern of parental awe, Whose mind for ever in the courts beheld, Roaming, the royal image of thy sire, Night long and day long, I—the little child— Will so be reverent. O ye great kings! Your crowned successor crowns you in his heart. Live unforgotten. Here, upon the verge Of the momentous years, I pause and trace The shining footsteps of my forefathers, And the far-distant goal that drew them on— Too distant for my range. Howe’er resolved I may go forward, lo! a thousand tracks Cause me to swerve aside. A little child— Only a little child—I am too frail To cope with the anxieties of state And cares of king-craft. Yet I will ascend 260\",\"Into my Father’s room, and through the courts Below, for ever seeking, I will pass, To brush the skirts of inspiration And touch the sleeves of memory. O great And gracious Father, hear and condescend To guard, to cherish, to enlighten me, 270\",\"MAYTIME EEP in the grass there lies a dead gazelle, The tall white grass enwraps her where she fell. With sweet thoughts natural to spring, A pretty girl goes wandering With lover that would lead astray. The little dwarf oaks hide a leafy dell, Far in the wilds there lies a dead gazelle ; The tall white grass enwraps her where she fell, And beauty, like a gem, doth fling Bright radiance through the blinds of spring. ‘Ah, gently! do not disarray My kerchief! gently, pray! Nor make the watch-dog bark Under my lattice dark.” 280\",\"LADY OF THE LAGOON Y the shores of that lagoon, Where the water-lily lies, Where the tall valerians rise, Slender as the crescent moon Goes Héa Nan... Ah, Héa Nan, Sleep brings me no relief: My heart is full of grief. By the shores of that lagoon, Where the drowsy lotus lies, Where the tall valerians rise, Brighter than the orbed moon Shines Héa Nan... Ah, Héa Nan, I turn and turn all night, And dawn brings no respite. 290\",\"THROUGH EASTERN GATES HROUGH eastern gates I wandered far, A. Where cloud-like beauties thronged the way ; Although like clouds their faces are, My thoughts among them would not stay. She in rough silk and kerchief blue Gave me the only joy I knew. I wandered by the curtain tower, Like flowering rushes were the maids; Although they match the rushes’ flower, Soon from my mind their beauty fades. In humble silk and madder dye, She fills my heart with ecstasy.0\",\"THE STRAGGLER HERE is that little oriole At rest where the mound doth rise; Oh, but the way is long, Long that before me lies. There is no rest for me, None for my tired feet ; Give me to drink and eat, Do what is best for me. Order an ambulance car, And carry me, carry me on. There is that little oriole At rest where the mound doth bend; Oh, but I know no fear Save if the march will end. There is no rest for me, None for my tired feet ; Give me to drink and eat, Do what is best for me, Order an ambulance car, And carry me, carry me on, There is that little oriole At rest on the hillock grey ; Oh, but I know no fear Save that I fall by the way. 31 c0\",\"There is no rest for me, None for my tired feet ; Give me to drink and eat, Do what is best for me. Order an ambulance car, And carry me, carry me on. 320\",\"THE HAPPY MAN E has perched in the valley with pines over grown, , This fellow so stout and so merry and free; He sleeps and he talks and he wanders alone, And none are so true to their pleasures as he. He has builded his hut in the bend of the mound, - This fellow so fine with his satisfied air ; 3 He wakes and he sings with no neighbour around, And whatever betide him his home will be there. He dwells on a height amid cloudland and rain, This fellow so grand whom the world blunders by ; He slumbers alone, wakes, and slumbers again, And his secrets are safe in that valley of Wei. 330\",\"THE PEAR-TREE HIS shade-bestowing pear-tree, thou Hurt not, nor lay its leafage low ; Beneath it slept the Duke of Shaou. This shade-bestowing pear-tree, thou Hurt not, nor break one leafy bough ; Beneath it stayed the Duke of Shaou. This shade-bestowing pear-tree, thou Hurt not, nor bend one leafy bough ; Beneath it paused the Duke of Shaou. 340\",\"PRINCELY VISITORS HITE birds went over the West— Young egrets, over the marshlands flying, My Lords came visiting, ermine-dressed, With the birds in their elegant beauty vieing. In their States they have high renown, Of the city of Chow they are never tiring, And the rivers of night wind darkly down Past the towers of their fame still aspiring. 350\",\"THE NIGHTLONG TRYST TT \\\\ OWN by the eastern gate : The willow wood’s astir ; From dusk to dawn I wait Through the soundless hours for her, Till the morning star is shining. Down by the eastern gate The willow-thicket pales ; From dusk to dawn I wait, Till the last red lantern fails, And the morning star is shining, 360\",\"A WIFE’S MEMORIES ITH taper rod of tall bamboo You angle in the K’e, Do I not go by dream to you Who cannot come to me ? To left the Ts’euen waters roam, The K’e flows on to right, Ah! never gleams the newer home Like that lost home to sight. Leftward the Ts’euen stream beguiles, ‘And rightward calls the K’e, Return, O light of happy smiles ‘And girdle-gems, to me! . The oars of cedar rise and fall From boats of yellow pine, Would I might roam the banks where all The ghosts of girlhood shine ! 370\",\"THE PRINCES HEY gather the beans, gather the beans, In their baskets square and round: The princes all are coming to court, And where shall their gifts be found ? The coaches of state and their teams go by, What more for my lords have I? Dark coloured robes with a dragon fine, And silken skirts with the hatchet sign. Clear bubbles the spring, bubbles the spring, Around they gather the cress: The princes all are coming to court, Their banners the winds caress. The dragon flag in the breezes swells, To the Awuy-hwuy sound of the bells. With two outside, the teams go past, These are the princes come at last. Red covers the knee, covers the knee: Their buskins are red below. | Lofty bearing and stately mien, Yonder my princes go. In such the Son of Heaven delights, The king shall renew their rights. May the pleasure and power for my lords increase, May the land yield corn and the years bring peace. 380\",\"BLUE COLLAR YOU with the collar of blue, My heart is longing for you. Though to call you I am not free, Wherefore not send to me ? O you with the girdle of blue, Long, long do I think of you. Though to seek you I am not free, Wherefore not come to me? Ah, random and pleasure-drawn, To the View Tower you are gone ; And a day without your sight Is like three months in its flight. 390\",\"A FRIEND FORGOTTEN HE winds blow soft from the East, But the storm welters by. In the day of disaster and fear, It was all you and I. In the hour of your pride You have cast me aside. The bland winds blown Hom the 2M Tornadoes pursue. In the hour of disaster and fear “More than brother were you. In the hour of delight Iam cast from your sight. The winds come fair from the East: On the hills overhead There is never a blade that is green, Not a leaf but is dead. My worth you forget, But my faults linger yet. 400\",\"THE EPHEMERAE N black and yellow are clad The wings of the ephemerae ; But my heart is sad, is sad, Because they will not stay with me. Many colours adorn The robes of the ephemerae ; But my heart’s forlorn, forlorn, Because they will not rest with me. In robes of hempen snow Rise the ephemerae ; But my heart is full of woe Because they will not bide with me, 410\",\"HAPPY IN HAQU os are there, by the score, I trow, Their large heads sleepily showing ; The hing is here, in the city of Haou, At ease while the wine-cup’s flowing. Fishes are there in the weeds enow, Their long tails lazily swaying ; The King is here, in the city of Haou, Drinking, dreaming, delaying. The fish lie under the willow bough That leans and shadows the rushes ; The King is here, in the city of Haou, At peace, and the wine-cup blushes.0\",\"THREE GIFTS royal gourd was given me, And in exchange an emerald I gave, No mere return for courtesy, But that our friendship might outlast the grave. A princely peach was given me, And in exchange a ruby gem I gave, No mere exchange for courtesy, But that our friendship might outlast the grave. A yellow plum was given me, And in exchange a sardonyx I gave, No mere return for courtesy, But that our friendship might outlast the grave. 430\",\"BRAVE THOUGATS REEN is the upper robe, Green with a yellow lining ; My sorrow none may probe, Nor can I cease repining. Green is the upper robe, The lower garb is yellow ; My sorrow none may probe, Nor any season mellow. The silk was of emerald dye, Ah! this was all your doing ; But I dream of an age gone by To keep my heart from rueing. Fine linen or coarse, ’tis cold, But all I have to dress me; So I think of the men of old, And find brave thoughts possess me. 440\",\"ON THE BANKS OF HO HE little boat of cypress rocks, Rocks in the midst of Ho; He was my lord, whose long dark locks Divided in their downward flow. Till death betide, His bride, Pll wed no other. O Heaven! O mother! Will you not understand your child? The little boat of cypress rocks There by the side of Ho; He was my only one, whose locks Divided in their downward flow. Till death betide, His bride, I’ll wed no other. O Heaven! O mother! Far from me be the thing defiled ! Will you not understand your child? 450\",\"SORROW GQ\\\" sought her native land again. ~J The swallow takes its ragged flight. We went together day and night, Till parting drew her from my sight And the tears fell down like rain. She went her native land to seek. Now up, now down the swallow flies. And oh !—the last of tender ties, The form that fades from aching eyes And the tears coursing down my cheek, Around, about the swallows dart She fared into a far countree, And when I vainly sought to see The empty landscape mocked at me, And great grief settled on my heart. 460\",\"BULWARRES OF EMPIRE OOD men are bulwarks; while the multitudes Are walls that ring the land; great states are Screens ; Each family a buttress ; the pursuit Of righteousness secures repose ; like towers Of strong defence the royal kinsmen stand Immune from peril, May they still remain Nor leave the king, a lonely citadel Abandoned to his enemies. Give heed Unto the wrath of Heaven ! nor presume To idle ; but revere the Heavenly moods, Ephemeral though they seem. Be not of those That roam atrandom. Heaven understands And doth companion all the ways we go, And seeth all things clearly, ... 470\",\"THE BRIDE COMETH 7 ‘HE turtle-dove dwells in the magpie’s nest. One cometh asa bride to be caressed; — A hundred carriages have gone in quest. The magpie’s home the young dove hath possessed. This lady cometh as a life-long guest ; A hundred chariots on the road have pressed, The turtle-dove shall fill the magpie’s nest. She travels far from home to love and rest ; A hundred carriages her rank attest, 480\",\"7 BEFORE THE FORD F your heart be kind and true, I will ford the stream with you, If your fickle thoughts go straying, Come with me no more a-maying,. Oh, you silly, silly swain! Better men than you remain. If you love me, dear my lord, Bid me and Ill cross the ford. Should your roving thoughts forsake me, Thoughts more kind will captive make me. Oh, you silly, silly swain ! Better men than you remain, 490\",\"GOOD KING WU N the city of Haou he built his hall, With circling waters round the wall: From north to south, from east to west There was never a tongue but called him blest. Great King Wu was a monarch true. With divination deep, I trow, Afar he sought the sight of Haou. With tortoise-shell the site he chose, And tier by tier the city rose. Great King Wu was a monarch true. By the waters of Fung white millet grew. Statesmen wise were the choice of Wu, The future reaped whate’er he planned ; His son was lord of a grateful land. Good King Wu was a monarch true,0\",\"eo FAINT HEART PRAY you, dear, My little hamlet leave, Nor break my willow-boughs ; *Tis not that I should grieve, But I fear my sire to rouse. Love pleads with passion disarrayed,— ‘‘ A sire’s commands must be obeyed.” I pray you, dear, Leap not across my wall, Nor break my mulberry-boughs ; Not that I fear their fall, But, lest my brother’s wrath should rouse, Love pleads with passion disarrayed,— “ A brother’s words must be obeyed.” — I pray you, dear, Steal not my garden down, Nor break my sandal-trees ; Not that I care for these, But, oh! I dread the talk of town. Should lovers have their wilful way, Whatever would the neighbours say ? 510\",\"WITHOUT HER HE moon comes forth in her brightness ; ‘Fair as the moon was she, That bright and beautiful lady Who lit the night for me. Would that I saw her now, With the stars around her brow. The moon comes forth in her splendour ; Fair through the void she burns, That pale and beautiful lady, My moon, no more returns; But under the alien skies She shines in a stranger’s eyes. The moon comes forth in her glory; Kind to the world is she. That kind and beautiful lady, Doth charm no night for me. Oh, when the dawn-star wanes For the sun to rend my chains! 530\",\"THE FOREST LOVER EEN-KWAN the axles cried, _ As I drove to claim my bride. Hunger for her beauty presses, I am parched for her caresses ; Though we lack good company, We shall revel—I and she. Dense the forest in the plain, Where the long-tailed pheasants reign ; Happy is the house that owns her, Where a lover’s choice enthrones her, Pledge me while I praise you, dear! Love shall ever need you near, Though I have but little wine, Love makes little cups divine. Though but one poor meal await us, Simple fare shall amply sate us ; Though small worth is mine to bring, Gaily we will dance and sing. Yon tall ridges I ascend And the stubborn firewood rend. When the riven oaks are ringing All my thoughts fly homeward winging; Though their green abysses hide, My whole heart is satisfied. 930\",\"Yon dim mountains disappear, On the road the course is clear. Gathering hooves go loudly drumming, Reins like lute-strings join their thrumming; Till beside the open door, . She is in my arms once more. 40\",\"THE HOUSEHOLDERS LAMENI HE marshland holds the carambola tree ; Soft and pliant its branches be. With its careless beauty and tender sheen, The life of a tree is the life for me. The marshland rears the carambola tree ; All purple and red its blossoms be. In careless beauty and tender sheen, Would I were childless and bland like thee. The marshland loves the carambola tree ; Soft and sweet are the fruits I see. Clothed with beauty and sunlit sheen, The rateless and roofless life for me, 550\",\"UNAVAILING E stabs me with a scornful smile. I Winds are wailing at the door. Scornful words and whispers vile, Ye have thrust me to the core. Whirling dust the northwind blows. Surely he will seek his mate! But he neither comes nor goes, Through the long dumb hours that wait, Blew the wind and veiled the sky ; One hour’s gleam, then clouds again, Sleep went trailing softly by, Left me to the old dull pain. Clouds across the darkness sweep, Thunder rolls its monotone. Who shall put my heart to sleep? Heart that aches, and aches alone, 560\",\"GREY DAWNS AND RED OLD is the rain and cold the wind, G: The cock gives dawn shrill greeting ; But a shadow steals across the blind, And oh! my heart is beating. The rain drives down, the wind tears past, The cock shrills through the gloaming ; But love is in the house at last, And sorrow flies his homing. Though the world look dark through wind and rain, ; And the dismal cock’s a-crowing ; I’ll sigh no more for the nights to wane, And its oh! for the red dawns glowing, Printed by Hasell, Watson & Viney, Ld., London and Aylesbury, England,0\",\"0\",\"THE WISDOM OF THE EAST SERIES Edited by L,. CRANMER-BYNG and Dr. S. A. KAPADIA - Sg eee 0\",\"THE BUDDHA’S “WAY OF VIRTUE.” A Translation of the Dhammapada. By W. C. D. Waciswara and K. J. SAUNDERS, Members of the Royal Asiatic Society, Ceylon branch. 3/6 net. THE PATH OF LIGHT. Rendered for the first time into English from the Bodhi-charyavatara of Santi-Deva. A Manual of Maha-Yana Buddhism. By L. D. Barnett, M.A., Litt.D. 3/6 net. LEGENDS OF INDIAN BUDDHISM. Translated from ‘ L’Introduction a Histoire du Buddhisme Indien” of Eugéne Burnouf, with an Introduction by WINIFRED STEPHENS. 3/6 net. THE WAY OF THE BUDDHA. Selections from the Buddhist texts, together with the original Pali, with Introduction by HERBERT Baynes, M.R.A.S, 3/6 net. ? IRANIAN (Persian, Pehlvi, Zend, etc. ) THE DIWAN OF ZEB-UN-NISSA. The First Fifty Ghazals Rendered from the Persian by MAcAn Lat and JEss1z DUNCAN WEsTBROOK. With an Introduction and Notes. 3/6 net. THE RUBA’IYAT OF HAFIZ. Translated with Introduction by Syep AspuL Mayjip, LL.D, Rendered into English Verse by L, CRANMER-BynG. 2/6 net. THE SPLENDOUR OF GOD. Being Extracts from the Sacred Writings of the Bahais, With Introduction by Er1c HAMMoND. 3/6 net. THE TEACHINGS OF ZOROASTER, and the Philosophy of the Parsi Religion. Translated with Introduction by Dr S. A. Kapapia, Lecturer, University College, London. end Edition: 3/6 net. THE PERSIAN MYSTICS. I. Jalalu’d-din Rumi. By F. Haptanp Davis. 3/6 net. II. Jami. By F. HApLanp Davis, 3/6 net. THE BUSTAN OF SA’DI. From the Persian. Translated with Introduction by A. Hart Epwarps, 3/6 net. SA’DI’S SCROLL OF WISDOM. By SHAIKH Sa’pI. With Introduction by Sir ARTHUR N. Wo vastTon, K.C.I.E, 2/6 net. With Persian Script added, 3/6 net. THE ROSE GARDEN OF SA’DI. Selected and Rendered from the Persian with Introduction by L, CRANMER-BYNG, 2/6 net. ARABIC THE POEMS OF MU‘TAMID, KING OF SEVILLE, Rendered into English Verse by Dutcir LAWRENCE SMITH. With an Introduction. 2/6 net. ABU’L ALA, THE SYRIAN. By HENRY BAERLEIN. 3/6 net.0\",\"THE ALCHEMY OF HAPPINESS. By At GuHazzatt. Rendered into English by CLaup FIELp. 3/6 net. THE AWAKENING OF THE SOUL. From the Arabic of Isn lTurait. Translated with Introduction by PAuL BRONNLE, Ph.D. 2/6 net. THE RELIGION OF THE KORAN. With Introduction by Sir ARTHUR N. Wo taston, K.C.I.E, 2/6 net. ARABIAN WISDOM. | Selections and Translations from the Arabic by JoHN WorTABET, M.D. 2/6 net. THE SINGING CARAVAN. Some Echoes of Arabian Poetry By HENRY BAERLEIN. 3/6 net. THE DIWAN OF ABU’L-ALA._ By Henry. BAERLEIN. 2/6 net, HEBREW ANCIENT JEWISH PROVERBS. Compiled and Classified by A. CoHEN, late Scholar of Emmanuel College, Cambridge. 3/6 net. THE WISDOM OF THE APOCRYPHA. With an Introduction by C, E. Lawrence, Author of ‘‘ Pilgrimage,” etc, 3/6 net. CHINESE A FEAST OF LANTERNS. Rendered with an Introduction by L. CranmeR-Byne, Author of ‘‘A Lute of Jade,” ‘‘ The Odes of Confucius,” etc. 3/6 net. YANG CHU’S GARDEN OF PLEASURE. Translated from the Chinese by Professor ANTON ForkKE, With an Introduction by H. CRANMER-BynG. 2/6 net. TAOIST TEACHINGS. From the Mystical Philosophy of Lieh Tzu. Translated by LionEL Gites, M.A. 3/6 net. A LUTE OF JADE. Being Selections from the Classical Poets of China. Rendered with an Introduction by L. CRANMER-ByNG. 2nd Edition. 3/6 net._ THE CLASSICS OF CONFUCIUS. I. The Book of Odes (Shi-King). By L. CranmER-BynG. 2/6 net, II. The Book of History (Shu-King), By W. Gorn OLD. 2/6 net. THE SAYINGS OF CONFUCIUS. A new Translation of the greater part of the Confucian Analects, with Introduction and Notes by LionEL Gi1Les, M.A. (Oxon.), Assistant in the Department of Oriental Books and Manuscripts of the British Museum, 3/6 net,0\",\"THE CONDUCT OF LIFE; or, The Universal Order of Confucius. A translation of one of the four Confucian Books, hitherto known as the Doctrine of the Mean. By Ku Hune Mine, M.A, (Edin.). 2/6 net. THE BOOK OF FILIAL DUTY. Translated from the Chinese of the Hsiao Ching by Ivan CuEnN, First Secretary to the Chinese Legation, 2/6 net. THE SAYINGS OF LAO TZU. Fromthe Chinese. Translated with Introduction by LioNEL GILEs, of the British Museum, 2/6 net. MUSINGS OF A CHINESE MYSTIC. Selections from the Philosophy of Chuang Tzi, With Introduction by Lione. Gizs, M.A, (Oxon.), Assistant at the British Museum. 3/6 net. THE FLIGHT OF THE DRAGON. An Essay on the Theory and Practice of Art in China and Japan, based on Original Sources. By. LAURENCE BINyYON. 3/6 net, JAPANESE THE SPIRIT OF JAPANESE ART. By Yonz Nocucui. 3/6 net. THE SPIRIT OF JAPANESE POETRY. By Yonge Nocucui. 3/6 net, ; THE WAY OF CONTENTMENT. Translated from the Japanese of Kaibara Ekken by Ken Hosuino. 3/6 net. THE MASTER-SINGERS OF JAPAN. Being Verse Translations from the Japanese Poets. By CLara A. WALSH. 3/6 net. WOMEN AND WISDOM OF JAPAN. With Introduction by S. TAKAISHI. 2/6 net. EGYPTIAN ANCIENT EGYPTIAN LEGENDS. By Marcarer A, MurrRAy. 3/6 net. THE BURDEN OF ISIS. Being the Laments of Isis and Nephthys. Translated from the Egyptian with an Introduction by JAMES TEACKLE DENNIS. 2/6 net. THE INSTRUCTION OF PTAH-HOTEP AND THE INSTRUCTION OF KE’GEMNI. The Oldest Books in the World. Translated from the Egyptian with Introduction and Appendix by BATTISCOMBE GUNN, 2/6 net. Editorial Communications should be addressed to Tue EpiTors oF THE WISDOM OF THE East SERIES, 50A, ALBEMARLE STREET, LONDON, W.r1 LONDON: JOHN MURRAY, ALBEMARLE STREET, W.0\",\"Bh PA A ob ee ey ke io eth eo tomate Py es aa Me eee 0\",\"BOT mM AP, at i wae ks = ae a Fait. -.0\",\" LS= Shannen Hi TTR 7 int ae vn ae i | aE a Ae ce A i HATA Wl FAH a : : | / | ' | i cy i a 7 ee a Hl 7 ea ae ne : iy su nti th Hi es HSH ea a i at i ae a a , a ) a : a ee ue ae Me eT ay AV; AUNT HHT iby Sy i a aahanera aetna i AA CH HG AMAA TA hit i AGN AE Se a a i a iM oe a i ae a a ‘ii Gare ae a i i i 7 Ae nla et i ae t : Hil ah Hi Ha i ae ‘ aul i i He / 1 1 a nui el . i | i HE (i oo | AA Pee ! : mn i . aN i: i | i 1 i el a Th La it i a en eh Se a a a ae 7 a a / a an ce Wi oe a au nD a on, a ee TE ie a CT a 1 a eo ae Ve A ne : a ai Ga a Beas \\\" a ne at ane a Cnn Ce Ne uaa a a ae . a | HE ct vy i Hi ht a na a iil , ae ill i UGH if THAT aU ee ii | a a a a a lal is | a ue i a oe | a | ae aN Ge 7) UU a ao a ae a che un a a a ce Pi Pen tT ail i A Fae nt i a Hy aa Hil ui a i nu a i eee Ty ed LabtG ttl iit ii 7 7 Ha i i HH Hl | a AAA HHACHIL HG ni Sa LM i Hi a ae a a ae a a a ae | ne i a i i i a a | a iH i) wit | an et cu ee a a a 0 a a i. a ve a a a a a Ai TWUTteteI IR UA PRE ! ye The eee ame Me ic ' . a A : aa ec a MO a it / Hitt} | a i \\\\ i HA a Ht i HH ni rat Wi Hn if ve va ae He a Pals a eT i 4 <= a APH HA AM a nll HG aly | aA A in H il Hii iit Hi 4 Fea at HHT0\",\"0\",\"0\"]"
}