{
    "published_book": "{\"content\":[{\"chapter\":\"Menu/Table of Contents\",\"pages\":[\"Sebeos' History\\nTranslated from Classical Armenian\\n by Robert Bedrosian\\nTo the memory of my uncle Andranik T origian\\nDownload in various formats from Internet Archive: Sebeos' History\\nThis translation is in the public domain. It may be copied and distributed freely .\\nTranslator's Preface  \\n A Note on Pagination  \\n Additional Resources\\nPrologue.\\nChapter 1.\\nVahan's rebellion from Peroz, the seizure of authority and triumph in battle. Peroz' death, the\\nenthronement of Kawad, and the honoring of V ahan with the marzpan ate. Kawad's death and the\\nenthronement of Xosrov called Anush Eruan (Anushirvan). The rebellion of V ardan and service to\\nthe Byzantines. The war and defeat of Xosrov .\\nChapter 2.\\nAnushirvan's belief in Christ and his baptism by the bishop, and his death; the enthronement of\\nOrmizd; V ahram's striking the troops of the T'etalats'ik', the war with the king of the Mazkut's and\\nhis death there; the rebellion and flight of the V ahramakan troops from Xosrov; the coming of\\nVahram; how Xosrov sought aid from the emperor Maurice.\\nChapter 3.\\nVahram's attack on Xosrov , and the two letters to Mushegh; Mushegh's loyalty to Xosrov; the great\\nbattle; the defeat of the rebels; Xosrov's lack of gratitude toward Mushegh which resulted in\\nMushegh's plans to kill him; the writing of an accusation to the emperor by means of the Byzantine\\nprinces; the emperor's dissatisfaction with that and the letter to [the princes] and to Xosrov; the\\ndispatch of Byzantine troops; the summoning of Mushegh to the palace by the emperor .\\nChapter 4.\\nThe piety of queen Shirin, who was king Xosrov's Christian wife; Xosrov's hrovartak .\\nChapter 5.\",\"Emperor Maurice requests the body of Daniel from king Xosrov .\\nChapter 6.\\nMaurice writes Xosrov a letter of condemnation about the princes and troops of Armenia, suggesting\\nthat he send those [princes and troops] in his section to Thrace while [Xosrov] send those in the\\nIranian section to the East; the flight of princes in the Byzantine section to Iran; Xosrov dispatched\\nthe Hazarakar with much treasure to the Byzantine section to attract many [princes] to his side; the\\nprinces ravish the treasure; preparation for war; the message; disunity of the princes, some of whom\\nwent to the Byzantines, others to the Iranians.\\nChapter 7.\\nThe Armenian princes in the Byzantine sector rebel; the war; the deaths of some in battle and the\\ndecapitation of two [rebels].\\nChapter 8.\\nThe emperor's order to assemble his Eastern forces and those of Armenia to cross the sea and mass\\nin Thrace, against the enemy . The selection of Mushegh as their commander . The victory ,\\nvanquishment, seizure, and killing of Mushegh.\\nChapter 9.\\nEmperor Maurice's order to preach the [acceptance of the] Council of Chalcedon in Armenia; the\\ndivision of the patriarchal throne.\\nChapter 10.\\nAgain the emperor's command to assemble the Armenian cavalry . The troops of Sahak Mamikonean\\nand Smbat Bagratuni are taken. Smbat returns to Armenia. The Armenian naxarar s' plan. Smbat\\ngoes to the emperor with seven men. [Smbat] falls into arena [combat]. Smbat's bravery there. His\\nliberation, and exile to Africa.\\nChapter 1 1.\\nThe summoning by king Xosrov to Asorestan of those naxarar s whom the Hamarakar  had left. The\\nstationing of their troops at Spahan.\\nChapter 12.\\nXosrov judges his uncle Vndo. The killing of Vndo. Vstam flees to war with Xosrov , and he rules in\\nthe Parthian areas.\\nChapter 13.\\nDeath of the Armenian princes; rebellion of their troops at Spahan; the destruction of the country ,\\nseizure of the treasure and going to Vstam.\\nChapter 14.\",\"Xosrov gives Smbat Bagratuni the marzpan ate of V rkan [Hyrcania] and greatly exalted him. Smbat\\nimproves the land of Hyrcania through spiritual and political education.\\nChapter 15.\\nVstam comes to Asorestan to kill Xosrov and take the kingdom. His death from the treachery of\\nPariovk, king of the Kushans. The small battle in the land of Hyrcania.\\nChapter 16.\\nDiscovery of a fragment of the Cross.\\nChapter 17.\\nSmbat fights with the enemy and triumphs. He is more honored with estimable gifts and honors than\\nall the other marzpan s. Smbat's son, named V araztirots', is appointed to the of fice of the king's\\ncupbearer . Construction of the church of saint Gregory . Enthronement of the kat'oghikos .\\nChapter 18.\\nSmbat is summoned to the Iranian court and receives the honor of the lordship ( tanuterut'iwn ) [and\\nof being] called Xosrov Shum. He persecutes the Kushans. The killing of Datoyean. Once more\\nSmbat and the Armenian naxarars go against the Kushans and Hepthalites. A certain wrestling\\nmatch. Smbat triumphs and goes to the court with great glory .\\nChapter 19.\\nSmbat dies peacefully . The Armenian naxarar s rebel from the Iranians and go to serve the king of\\nthe north, the Khaqan/Qaqan (Xak'an).\\nChapter 20.\\nThe rebellion of the great patrician Atat Xotxorhuni, and his death. The Iranian and Byzantine\\nborderlords.\\nChapter 21.\\nThe killing of emperor Maurice and the reign of Phocas. The rebellion of general Erakghes\\n(Heraclius) of Alexandria and general Nerses of Syrian Mesopotamia. Urha (Edessa) is besieged by\\nthe Byzantines and the city of Dara [is besieged] by Xosrov . Troops are mustered from [the Iranian\\nsector of] Armenia and prince Juan V eh is made their commander . He comes to Edessa and takes\\nT'eodos. The destruction of Dara. The Byzantines take Edessa; general Nerses is killed.\\nChapter 22.\\nThe Iranians and Byzantines battle in the plain of Shirak, and the Byzantines are defeated. Another\\nbattle takes place in T saghkotn. The Byzantines are defeated, T'eodos Xorxorhuni surrenders, giving\\nthe fortress to the Iranians. [T'eodos Xorxorhuni's] death.\\nChapter 23.\",\"Xosrov sends a lar ge force to Asorestan under the command of Erhazman Xorheam, and [another\\narmy] to Armenia under Ashtat Y eztayar accompanied by the emperor Theodosius. Erhazman\\nXorheam subdues all of Mesopotamia. Ashtat wars with the Byzantines and subjugates the district of\\nKarin. Shahen battles with the Byzantines and is victorious. The inhabitants of Karin are deported to\\nAhmatan Shahastan. Death(s) of the Kat'oghikoi . Shahen takes Caesarea, and V asak Artsruni is\\nkilled.\\nChapter 24.\\nHeraclius goes to Asorestan to fight against the Iranians. The great battle near the city of Antioch in\\nwhich the Byzantines were defeated. The country of Palestine submits to the Iranians. An Iranian\\nostikan  takes up residence in Jerusalem. His murder . The great destruction of Jerusalem by the\\nIranians by sword and fire. The holy Cross is captured.\\nChapter 25.\\nThe Construction of the Church of Hrhip'sime.\\nChapter 26.\\nXorheam comes to Chalcedon with a lar ge army to take Constantinople. The emperor's exhortation\\nand gift. [The Iranians] consent to turn back. The Iranians again return to Byzantium ( i Biwzandia ).\\nThe great naval battle and the Iranian defeat. Xosrov's hrovartak  to Heraclius. Heraclius goes against\\nthe Iranians. The battle near T igranakert and Heraclius' arrival at Cappadocian Caesarea in triumph\\nand with booty . He goes against Xosrov again and battles in the plain of Nineveh where the Iranians\\nare defeated.\\nChapter 27.\\nThe flight of Xosrov . Heraclius takes and burns Ctesiphon and returns to Atrpatakan. The killing of\\nXosrov and his forty sons. Kawad rules and makes peace with Byzantium and leaves the [Byzantine]\\nborders.\\nChapter 28.\\nSmbat's son V araztirots' becomes a marzpan . The selection and deposition of kat'oghikos  K'ristap'or\\nand his succession by Ezr . The death of Kawad and the enthronement of his son Artashir . Heraclius\\nwrites to Xorheam requesting the holy Cross from him. The killing of Artashir and the reign of\\nXorheam. The killing of Xorheam, and the reign of Bbor , Xosrov's daughter . She was succeeded by\\na certain Xosrov , who was followed by Xosrov's daughter , Azarmiduxt. She was followed by\\nOrmizd. Finally , the reign of Y azkert.\\nChapter 29.\\nThe return of the Cross to holy Jerusalem. The determination of the boundary between the two\\nkings. Forced by Mzhezh Gnuni, Ezr accepts the Council of Chalcedon. The plot of Mezhezh with\\nRhatovm against aspet  Varaztirots' and the latter's flight. The king swears to him and he goes to the\\npalace and is exalted. The evil plot of At'alarikos with the princes against his father . The exposure of\\nthe plot and the plotters' deaths. The exile of V araztirots'. The bravery of Dawit' Saharhuni, who\\nbecomes Curopalate. The deeds of T'eodoros, lord of Rshtunik'.\\nChapter 30.\",\"The elimination of the Sasanian [dynasty] which held sway for 542 years. The birth of Muhammad\\nand the entrance of the sons of Ishmael into the land of Armenia. The death of Heraclius and the\\nreign of Constantine.\\nChapter 31.\\nRegarding the Jews and their wicked plans.\\nChapter 32.\\nConstantine dies as a result of his mother's plot, and Heraclius (son of Heraclius by his second wife)\\nis enthroned. General V aghentin (V alentinian) comes to Constantinople and enthrones Constantine's\\nson, Kostas. The Iranians war with the Ishmaelites and are defeated. Aspet  Varaztirots' returns from\\ncourt, and dies. The Ishmaelites come to Atrpatakan, and divide into three wings They take Artsap'u\\nfortress, campaigning against the sep'hakan gund.\\nChapter 33.\\nThe Lord frees the captives and destroys the Ishmaelites. Those [Arabs] who had spread out raiding\\nat Ayrarat strike T ayk', Iberia, and Aghbania/Aghuania. The naval battle between the Ishmaelites and\\nthe Byzantines. Procopius [Prhokop] goes to Mu'awiya [Muawiya], prince of the Ishmaelites, [143]\\nand the peace between [the Arabs] and Byzantines. The deeds of kat'oghikos  Nerses. The dispute\\nover faith with the Armenians. The Armenians' reply to emperor Constans.\\nChapter 34.\\nThe attack of the Hagarenes, and events in Rome.\\nChapter 35.\\nThe Ishmaelites war with the Iranians and destroy their lordship. The death of Y azkert. The Medes\\nand the Armenians enter the service of the Hagarenes. Constans comes to Armenia. The Ishmaelites\\nprepare [to fight] with the Byzantines. Regarding Nerses, kat'oghikos  of Armenia.\\nChapter 36.\\nThe letter of the Ishmaelite king to the Byzantine emperor Constans. The Ishmaelite prince\\nMu'awiya comes to Chalcedon and is vanquished by the Lord.\\nChapter 37.\\nThe Medes rebell from the Ishmaelites.\\nChapter 38.\\nMushegh rebells from the Byzantines and enters the Ishmaelites' service. The battle of the\\nIshmaelites with the Byzantines at Naxchawan, the destruction of the Byzantines and the destruction\\nof Armenia. Once more the Armenians quit Ishmaelite service and submit to the Byzantines.\\nHamazasp, lord of the Mamikonean, becomes Curopalate, as a result of which the Ishmaelites kill\\nthe hostages. Discord breaks out among the Ishmaelite army and they separate from each other .\\nTheir prince Mu'awiya conquers all of them, becomes king, and makes peace among them.\"],\"start\":0,\"end\":5,\"length\":5},{\"chapter\":\"Translator's Preface\",\"pages\":[\"Translator's Pr eface\\nSebeos' History  is a seventh century document of special importance for the study of Armenia and the Middle\\nEast in the sixth-seventh centuries. It was during this period, when Iran and Byzantium were wrestling for\\ncontrol of the Armenian highlands, that Armenian culture became more individual, independent, and\\ndistinctively national. While Sebeos focuses his attention primarily on Armenia's lay and clerical naxarar s\\n(lords), he also provides extensive and valuable information on events taking place in the neighboring\\nsocieties of Byzantium, Iran, and among the Arabs.\\nByzantinists will find factual and anecdotal information on the reigns of emperors Maurice (582-602),\\nTheodosius (co-emperor , 590-602), Phocas (602-610), Heraclius I (610-41) and his successors to Constans II\\n(641-68), including their wars against Iran in the east and the Goths in the west. Iranists will find information\\non of ficials such as the hamaharz , pustipan , marzpan , ostikan , Asparapet , patgospan , and hamarakar ; and a\\nwealth of information on the reigns of shah s Peroz (459-84), V alas (484-88), Kawad I (488-96; 498-531),\\nXosrov I Anushirvan (531-79), Hormizd IV (579-90), Xosrov II Aparvez (590; 591-628), Kawad II Sheroe\\n(628), Artashir (628-29), queen Boran (630-31), and Y azdigerd III (632-51). Sebeos' account of the rebellion\\nof Vahram Choben and his description of the last days of the Sasanian dynasty have the authenticity of a\\ncontemporary . In addition, Sebeos narrates the birth and rise of Islam and provides unusual information on\\nJewish nationalism, the Khazars of the north Caucasus, and the Kushans on Iran's northeastern border .\\nRegrettably , aside from canonical and hagiographical literature and a few inscriptions, there are no other\\nArmenian historical sources for the period of the sixth-seventh centuries. As such, Sebeos' information on\\nArmenia and the Armenians has particular importance. His account begins where the fifth century Ghazar\\nP'arpets'i's History  left of f—with the rebellion of V ahan Mamikonean in the 480s. Unfortunately , the account\\nthen skips the early and middle parts of the sixth century , picking up again with the rebellion of V ardan II\\nMamikonean (572) against Iran. Sebeos describes the separatist activities of the district of Siwnik' in eastern\\nhistorical Armenia; V ahram Choben's ef forts to enlist the aid of Mushegh Mamikonean, and Mushegh's role\\nin Vahram's defeat; the alleged plan of the emperor Maurice and shah  Xosrov to depopulate Armenia, and the\\nrebellions this engendered. He especially concentrates on the reign of Maurice (582-602), who was perhaps of\\nArmenian descent and had a peculiar antipathy toward the Armenians. The late sixth and early seventh\\ncenturies were a period when the Armenian naxarar s were strong and independent and prone to switching\\nallegiance from Byzantium to Iran, or vice versa . Sebeos describes the careers of several such prominent\\nlords as Smbat Bagratuni, his son V araztirots', T'eodos Xorxoruni and others, some of whom became\\nimportant of ficials in the two rival empires. As a cleric, Sebeos was particularly interested in religious\\nmatters. He describes the activity of Armenian kat' oghikoi ; Byzantine attempts to force Chalcedonianism on\\nthe Armenians; Iranian attempts to force Zoroastrianism on the Armenians; Chrlstianity in Iran; and the\\nspread of Islam.\\n \\nThe present translation, which was completed in 1979, was made from the classical Armenian edition of K.\\nPatkanean [ Patmut'iwn Sebeosi episkoposi i Herakln  (St. Petersbur g, 1879)]. Patkanean based his text on the\\nearlier edition of T . Mihrdatian (Constantinople, 1851) and a manuscript at the Imperial Academy in St.\\nPetersbur g. Mihrdatian in turn had based his edition on an anonymous manuscript found in the library of\\nEjmiatsin in 1842 by bishop Y ovhannes Shahxat'unian. There is extensive controversy about many aspects of\\nthe manuscript tradition. None of the full extant manuscripts of Sebeos predates the seventeenth century .\\nApparently , the now-lost text of Shahxat'unian bore neither an author nor a title. Shahxat'unian himself\\ndetermined that the work must be the history alluded to by later medieval historians as Sebeos' history .\\nConsequently , with no positive identification, the work was published as Bishop Sebeos' History of Heraclius\"],\"start\":5,\"end\":6,\"length\":1},{\"chapter\":\"A Note on Pagination\",\"pages\":[\"despite the fact that it is much more than the history of Heraclius. Apparently , Shahxat'unian and/or\\nMihrdatian divided the text into sections and chapters and prefaced them with summaries (which were not in\\nthe original manuscript).\\nAnother controversy surrounds an earlier work appended to all extant manuscripts of this seventh century\\nhistory , which has come to be known as the Primary History of Armenia  [for an English translation and\\ndiscussion see R. Thomson, Moses Khor enats'i's History of the Armenians  (Cambridge, Mass., 1978)\\nAppendix pp. 357-68; our translation of the Primary History  is available elsewhere on this site]. Few\\nArmenists today regard the Primary History  and \\\"Sebeos\\\" as the work of the same author . Who Sebeos was,\\nand if he really was the author of this history are presently unanswerable questions [see G. Bournoutian, \\\"\\nSebeos: A Historical Controversy \\\", Armenian Review  (Summer , 1975) pp. 138-46 ] There is nothing\\nparticularly distinctive about Sebeos' style—the Armenian is direct and (usually) straightforward. All that is\\nclear from the author's biases is that he was a patriotic historian, not unswervingly loyal to any one House,\\nand a fervent defender of the independence of the Armenian Church.\\nIn 1979, G.V . Abgaryan published a critical edition of Sebeos  (Erevan, 1979), which includes the Primary\\nHistory , and is based on numerous manuscripts and fragments. While Abgaryan's text may be more readable\\nthan Patkanean's, the editor's freedom in rearranging passages and completely renumbering the chapters\\nmakes it dif ficult to use as a companion to the scholarly writings on Sebeos by more than a century of\\nprominent Armenists. Nonetheless, the Abgaryan edition has extensive annotation, some of which is\\nreferenced in the notes to the present translation. An extensive bibliography for the era of Sebeos and\\nsubsequent periods in Caucasian history is available in C. T oumanof f's article, \\\"Armenia and Geor gia,\\\"\\n[Chapter XIV in The Cambridge Medieval History , vol. IV , The Byzantine Empire, part I, (Cambridge, 1966),\\npp. 593-637].\\nThe transliteration used here is a modification of the Library of Congress system for online Armenian,\\nsubstituting x for the LOC's kh, for the thirteenth character of the Armenian alphabet ( խ ). Otherwise we\\nfollow the LOC transliteration, which eliminates diacritical marks above or below a character , and substitutes\\nsingle or double quotation marks to the character's right. In the LOC romanization, the seventh character of\\nthe alphabet ( է ) appears as e', the eighth ( ը ) as e\\\", the twenty-eighth ( ռ ) as r', and the thirty-eighth (o), as o'.\\nRobert Bedrosian \\n(New Y ork, 1985)\\nA Note on Pagination\\nThe printed editions of these online texts show the page number at the top of the page. In the right mar gin the\\npagination of the Classical Armenian ( grabar ) text also is provided. We have made the following alterations\\nfor the online texts: the page number of the printed English editions (Sources of the Armenian T radition\\nseries) appears in square brackets, in the text. For example [101] this text would be located on page 101, and\\n[102] this text would be on page 102. The grabar  pagination is as follows. This sentence corresponds to the\\ninformation found on page 91 of the Classical Armenian text [g91] and what follows is on page 92. In other\\nwords, the Classical Armenian text delimiters [gnn] indicate bottom  of page.\"],\"start\":6,\"end\":7,\"length\":1},{\"chapter\":\"Additional Resources\",\"pages\":[\"Additional Resour ces\\nInternet Ar chive:\\nTexts and Studies of Sebeos\\nSasanians/Sasanids\\nThe 4th through 6th Centuries , from the Chronicle  of Michael Rabo [Michael the Syrian]. \\n The 7th through mid-9th Centuries , from the Chronicle  of Michael Rabo [Michael the Syrian].\\nSyriac Sources  (various periods and topics), including historical material.\\nSyriac Chronicles and Historiography  (various periods and topics), at syri.ac\\nTrade and T rade Centres in Armenia in the Roman-Parthian and the Byzantine-Sasanid Periods , by Hagop\\nManandian.\\nFordham University:\\nByzantine Sources  (various periods and topics), prepared by Paul Halsall.\\nWikipedia:\\nSebeos  \\n Sebeos , Google search of W ikipedia.\\n6th Century  \\n 7th Century\\nEncyclopaedia Iranica Online:\\nSebeos , by James Howard-Johnston. \\n Sebeos , Google search of Iranica .\\nSasanian Dynasty , by A. Shapur Shahbazi. \\n Articles on Armenia . Numerous articles by multiple authors.\\nArsacids/Parthians and Sasanian entries , from Selected T opics in Ancient and Medieval Iranian History ,\\ncompiled by Robert Bedrosian.\\nMaps, at Internet Archive:\\nMost browsers permit decreasing (Ctrl and minus sign -) and increasing (Ctrl and plus sign +) image sizes.\\nin English:\",\"from The Cambridge Medieval History , vol. IV  The Byzantine Empir e part I (Cambridge, 1966), facing page\\n598\\nCaucasia in the 5-8th Centuries , Cyril T oumanof f, cartographer .\\nfrom Armenia: A Historical Atlas  (Chicago, 2001), by Robert H. Hewsen.\\nByzantine expansion into Armenia (387-591)\\nSecond Byzantine expansion into Armenia (591-654)\\n5-7th Centuries , maps and texts. Armenia in the 4th century , the lordly (naxarar)  system, the\\norganization of the Armenian Church, the first Byzantine expansion into Armenia (387-591), the\\nwars for religious freedom, and the second Byzantine expansion (591-654).\\nin Russian:\\nArmenia in the 5-7th Centuries , S. T . Eremyan, cartographer .\\nin Armenian:\\nMarzpan Armenia and Neighboring Countries (387-628)  Eastern Section. \\nMarzpan Armenia and Neighboring Countries (387-628)  Western Section and map legend (B. H.\\nHarut'yunyan, cartographer).\\nGreater Armenia according to the \\nAshxar hats'oyts' , a 7th-century Armenian geographical work by\\nAnania Shirakets'i (S. T . Eremyan, cartographer).\\nChronological Tables\\nThe following modern chronological tables are attached to the pdf version as attachments.\\nRulers of Armenia and of Eastern and W estern Empires \\n Kat'oghikoi  and Corresponding Secular Rulers of the Armenians \\n Rulers of Armenia and Iberia/Geor gia\\nSources for these chronologies are:\\nArmenian and Iberian/Geor gian: C. T oumanof f, Studies in Christian Caucasian History  (Geor getown, 1963),\\n\\\"Chronology of the Early Kings of Iberia\\\", in Traditio , vol. 25 (1969), pp. 1-33; T oumanof f's tables in The\\nCambridge Medieval History IV  (Cambridge, 1966); The Armenian People fr om Ancient to Modern T imes\\nvol. 1 (New Y ork, 1997). \\nKat'oghikoi : Haykakan sovetakan hanragitaran [Armenian Soviet Encyclopedia]\\n(Yerevan, 1979), vol. 5, pp. 166-167.\\nWestern Empires: The Cambridge History of Iran  3(1) (Cambridge, 1983); The Cambridge Ancient History\\nIX (Cambridge, 1962); W . G. Hardy , The Gr eek and Roman W orld (Cambridge, Mass. 1960); Steven\\nRunciman, Byzantine Civilization  (New Y ork, 1961).\\nEastern Empires: The Cambridge History of Iran  3(1) (Cambridge, 1983); The Cambridge Medieval History\\nIV (Cambridge, 1966); The Cambridge History of Iran  vol. 5 (Cambridge, 1968).\"],\"start\":7,\"end\":9,\"length\":2},{\"chapter\":\"Sebeos' Prologue.\",\"pages\":[\"Chronological T ables , prepared by Robert Bedrosian, at Internet Archive:\\nArmenia and Neighbors .\\nSebeos' History\\nPrologue\\n[1] At the time of the waning of the rule of the Arsacids in the land of Armenia [when] the rule of king\\nVramshapuh was done away with, there ruled over Armenia the people of the Kark'edovmayets'i principality .\\n[The latter], with the unity of the venemous, grandee mages and all the principal naxarar s (lords) of [the\\nruler's] kingdom adopted an awesome and frightful plan: to eliminate the fruits of piety (Christianity) in the\\nland of Armenia. But nothing availed [the Iranian king in his plan], rather , he was damaged. And [Christian]\\npiety more than ever blossomed and sparkled.\\nNow others have written about [all of the following events], as that very same History  points out: regarding\\n[2] the days of wicked [king] Y azkert's reign, how he wanted to destroy the divine orders (the cler gy); how\\nthe brave naxarar s of Armenia and the zealot of God, the nahapet Vardan called \\\"Karmir\\\" (\\\"the Red\\\") of the\\nMamikonean House with a brigade of armed comrades, their friends and troops organized and armed for war .\\n[They] took in hand the shield of Faith and zeal for the divine W ord clothed them like armor of security and\\ntruly before their very eyes you might say that they saw their halos descend to them [ end of grabar  (Classical\\nArmenian) text page 22; henceforth shown as, for example, g22]. Thus did they scorn death, considering it\\nbetter to die on the Divine Path. [The History  alluded to above also tells] how the Iranian troops came against\\nthem with severe violence and how , when they clashed [the V ardaneank'] received martyrdom and how the\\nblessed witnesses of Christ who had been captured by the pagans underwent martyrdom at Apr Shahr , close\\nto the city of Niwshapuh, at a place called T'eark'uni.\\nBut I wished to concisely write down and narrate to you [information] about all the following [events]: all the\\nevil which transpired in Peroz' time; V ardan's rebellion against Xosrov; the rebellion of the Iranian troops\\nfrom Ormizd; Ormizd's death and the enthronement of Xosrov; Maurice's death and the reign of Phocas; the\\ntaking of Egypt; [3] the destruction of Alexandria; the appeal of Heraclius to the king of the T'eatalats'ik' in\\nthe Northern parts and the sending of countless multitudes of peoples [in response to Heraclius' appeal]; the\\nByzantines' raiding in Atrpatakan, the loot and booty; the return via P'aytakaran; the coming of Iranian troops\\nfrom the east to strike at him; the war which occurred in the land of [Caucasian] Aghbania; the emperor's turn\\nto the city of Naxchewan and the fight at Archish; the emperor's departure thence to his own borders; the\\nother attack on Xosrov; the warfare which occurred at Ninue; the raid upon the city of Ctesiphon (T isbon);\\nthe return to Atrpatakan; Xosrov's death; the enthronement of Kawad; the reconciliation which occurred\\nbetween the two kingdoms [Byzantium and Iran]; then the ceding of borders to the Byzantines; the return of\\nthe divine Cross to the Holy City . [Then I shall describe] the arousal of fathomless [divine] anger and the final\\ndisasters [brought on] by the marauders from the Southern parts [the Arabs]; how the armies of the\\nIshmaelites unexpectedly moved forth and, in a moment's time, overthrowing the might of both kings [g23],\\nseized [territories extending] from Egypt to this side of the great Euphrates river and to the border of the\\nArmenians [ ts' sahman  Hayastaneayts' ], from the shores of the great sea in the W est [the Atlantic] to the\"],\"start\":9,\"end\":10,\"length\":1},{\"chapter\":\"CHAPTERS:\",\"pages\":[],\"start\":10,\"end\":10,\"length\":0},{\"chapter\":\"1\",\"pages\":[\"gate/court of the Iranian kingdom, [taking] all the [4] cities of Mesopotamia of the Syrians, and Ctesiphon,\\nVeh Artashir , Marand, Hamatan as far as the city of Gandzak, and the great Hrat which is located in the\\ndistrict of Atrpatakan.\\nChapter 1\\nVahan's r ebellion fr om Per oz, the seizur e of authority and triumph in battle. Per oz' death, the enthr onement of\\nKawad, and the honoring of V ahan with the marzpan ate. Kawad's death and the enthr onement of Xosr ov\\ncalled Anush Eruan (Anushirvan). The r ebellion of V ardan and service to the Byzantines. The war and defeat\\nof Xosr ov.\\nDuring the years of Peroz, king of Iran [A.D. 459-84], the suppression [ bardzumn ] of all principalities, and\\norders and laws of Christianity and such danger of persecutions and contempt were visited upon the princes\\nthat they threw of f the yoke of service. V ahan Mamikonean rebelled, persecuted the Iranians, and seized\\nauthority by force.\\nThen king Peroz released upon him many Hun troops, commanding that the rebels be killed with great\\nseverity and that all males be put to the sword. Sparapet  Vahan hastened against this [army] with 30,000\\nselect armed men. They massed in order , brigade against brigade, front against [5] front, and with all possible\\nspeed they attacked each other , to the sound of trumpets, in the plain of Geran.\\nThe W ord of God came to aid [the Armenians], stirring up the wind and pouring upon the Iranian troops a\\ndust storm which in midday enveloped them like a dark eclipse. There was enormous destruction on both\\nsides and it was impossible to distinguish Iranian from Armenian among the [g24] corpses. However ,\\neventually the army of the Armenians drove back the army of Iranians, making fugitives of the remainder and\\npursuing them. They turned back from this with great triumph.\\nVahan both collected the taxes of the land of Armenia and also [re]built the very great churches which the\\nIranians had ruined in the city of V agharshapat, in Dwin, in Mzur [ i Mzrays ], and in many places in the land\\nof Armenia. Building the country up, he again renewed it.\\nNow despite the fact that the Iranian king Peroz wanted to mass troops against Armenia again, he had no\\nopportunity since news of [the coming of] enemies forced him to go to the Kushan area because it was from\\nthat very border that the [6] king of the Kushans himself was coming against [Peroz] with a lar ge army .\\nAssembling his troops, [Peroz] went against [the Kushan king] with great haste, saying: \\\"First I shall expel\\nhim, then, having nothing further to do, I shall go to Armenia once more and shall spare neither man nor\\nwoman from my sword.\\\"\\nWhen [Peroz] arrived, he quickly went to face the enemy in the East. An intense battle took place and [the\\nKushans] struck at and destroyed the multitude of Iranian troops, so much so that none was left alive to flee.\\nKing Peroz and seven of his sons died in the battle.\\nThen [Peroz'] son Kawad ruled the land of Iran [488-96, 498-531]. Because the strength of the multitude of\\nhis troops had been shattered, he did not want to make war with anyone; rather , he made peace on all sides\",\"[including] reconciliation with the Armenians. He summoned V ahan to court and exalted him with great\\nhonor . He gave him the marzpan ate of the land [of Armenia] and the lordship of the Mamikonean [House].\\nHe promised much in service and benevolently sent [V ahan] back to his country .\\nAfter V ahan, authority was wielded by his brother V ard Patrik [who ruled] for a short time [505-509, or 510-\\n514], and died. After him came Iranian marzpan s. The Armenians were [g25] unable to rebel, and remained\\nin obedience until [the time of] the marzpan  Suren and V ardan, lord of the Mamikoneans.\\nIn the 41st year of the reign of Kawad's son Xosrov , Vardan rebelled with all Armenia united behind him and\\nstopped serving the Iranian king. [They] killed the marzpan Suren unexpectedly in the city of Dwin, took\\nmuch loot, and went in service to the Byzantines.\\nPrior to this rebellion the prince of the land of Siwnik', named V ahan, broke away from the Armenians. He\\nrequested of the Iranian king Xosrov that they take the diwan  of the land of Siwnik' from Dwin to the city of\\nP'aytakaran, and that the city be ranked in the Atrpatakan Shahrmar , so that the name \\\"Armenia/Armenian\\\"\\nno longer be applied to them. [Xosrov] so ordered.\\nNow the emperor of the Byzantines made an oath with the Armenians, confirming the same oath which had\\nexisted between those two venerable kings, T rdat and Constantine, and he gave them imperial troops in aid.\\nTaking the troops, [8] [the Armenian rebels] turned upon the city of Dwin, besieged and destroyed it and\\npursued the Iranian force which was there.\\nBut suddenly great agitation came upon them, for it was learned that the Iranians had set fire to and burned\\ndown the church of saint Gregory which had been built near the city , and which the Iranians had turned into a\\ngranary .\\nThen Mihrewandak the Mihran came against them with 20,000 troops and numerous elephants. There was a\\nbig battle in the Xaghamaxik' plain. [The Armenians] struck unbelievable blows at the Iranian forces, dulling\\ntheir swords, and they captured all the elephants. The Mihran escaped with a few men, and they went to their\\ncountry .\\nThis is that very V ardan against whom the Iranian king himself, called Xosrov Anushirvan, came with a\\nmultitude [9] of armed men and many elephants. T ravelling through the [g26] district of Artaz, [Xosrov] went\\nthrough Bagrewand, passing the city of Karin, took the road to a certain spot and encamped opposite\\n[Vardan].\\nEarly next morning, with great haste they ranged themselves brigade opposite brigade, front opposite front,\\nand then clashed in battle. And the war was fought with increasing intensity and they fought very hard. And\\nthe Lord visited defeat upon the king of the Iranians and all his troops. They were crushed before the swords\\nof their enemies and fled from them in frantic panic. Not knowing their path of flight, [the lranians] went and\\ntook refuge in the great river called Euphrates. But the water rose and swept away that multitude of fugitives\\nas though they were a host of locusts; and many were unable to save themselves on that day . The king,\\nhowever , was able to escape by a hairsbreadth, together with a few men thanks to the elephants and horses.\\nHe fled through Aghdznik' and on to his abode.\\n[10] [The Armenians] took the entire camp, together with the royal treasures. They captured the Bambish\\n(\\\"queen\\\") and the camp and they seized the Mashaper chan , the entire palankeen of very heavy gold which\\nwas worked with precious stones and pearls, which they called the palankeen of glory [ despak  p'arats' ]. They\\nalso took the Fire which the king always used to take around with him to bring him aid, and which was\"],\"start\":10,\"end\":12,\"length\":2},{\"chapter\":\"2\",\"pages\":[\"regarded as greater than all the fires and which they called [the] At'ash  [fire]. A multitude of the senior\\ngrandees had drowned in the river , as had the Movpetan Movpet . Blessed is God, always [g27]. \\nChapter 2\\nAnushirvan's belief in Christ and his baptism by the bishop, and his death; the enthr onement of Ormizd;\\nVahram's striking the tr oops of the T'etalats'ik', the war with the king of the Mazkut's and his death ther e; the\\nrebellion and flight of the V ahramakan tr oops fr om Xosr ov; the coming of V ahram; how Xosr ov sought aid\\nfrom the emper or Maurice.\\nPrior to the rebellion [c.572], this Xosrov , who was called Anushirvan, during his reign [531-79] had made\\nthe country strong, for he was a peace-lover and a builder of the land. But when the rebellion occurred\\n[Xosrov] thereafter [1 1] was roused to anger , regarding himself innocent [and saying]: \\\"I was the father , not\\nthe lord, of the land and I nourished all like sons and dear ones. And now ,\\\" he said, \\\"may God seek this blood\\nfrom them.\\\" This Xosrov during his reign closed the Gate of Chor and of Aghbania/Aghuania. He seized and\\nhandcuf fed the Egerats'ik' king. Through warfare he took Pisidian Antioch and he settled the captives by the\\nroyal abode.\\nHe built a city and named it V eh Anjatok' Xosrov , which is called Shahastanin Oknoy . And he took Dara and\\nCallinicos through raiding, enslaving the Cilician parts.\\n[Xosrov] ruled the kingdom for 48 years. Now as he was dying, the radiant light of the divine W ord was born\\nin him, for he believed in Christ, saying: \\\"I believe in one God Who made Heaven and Earth Whom\\nChristians worship, confessing Father and Son and Holy Spirit, for He alone is God; and there is no other than\\nHe Whom the Christians revere.\\\"\\nHe ordered his attendants to send the mogpet  far from [12] court to a place of work, that others be ejected\\nfrom the [g28] royal abodes, and he summoned the head bishop ( Episkoposapet ), who is called the Eran\\nkat'oghikos . [Xosrov] was baptised by the latter and commanded that divine services be held in the chamber .\\nHe read the message in the Lord's Gospel, and he communed in the envivifying Body and Blood of the Lord.\\nBidding farewell to the kat'oghikos  and the Lord's Gospel, [Xosrov] sent him to his place.\\nAfter a few days he departed this life in good old age. Christians took his body and placed it in the tomb of\\nkings [ i shirims t'agaworats'n ]. Ormizd, [Xosrov's son], ruled after him [Hormizd IV , c. 579-590].\\nNow here is [a list of the] generals of the Iranian king who came one after the other to the country of Armenia\\nfrom [the time of] the rebellion of V ardan, lord of the Mamikoneans, the son of V asak, up to the present.\\nSome of them died in battle, some battled, some triumphed and then departed. When [13] they killed Suren\\nthe marzpan , that same year a certain V ardan Vshnasp came, accomplished nothing, remained for a year and\\nthen departed. After him came Goghon Mihran with 20,000 armed troops and many elephants, and many to\\nhelp him from among the countless peoples who inhabit the Caucasus mountains, the Hun people. [He also\\nhad] an order from the king to eliminate [all] men in the land of Armenia, to seize, dig up, to raze to the\\nground, to mercilessly destroy the country .\",\"Thus did [Mihran] come. Some people were able to save themselves by going into impregnable fortresses;\\nothers fled to a more distant land. Nonetheless, many were unable to save themselves because whomever they\\nchanced upon they put to the sword. [Mihran] battled once in Iberia/Geor gia, but was defeated. He came to\\nArmenia and took Ankgh by a false oath.\\nP'ilippos, lord of Siwnik', fought a battle between the city and Xaghamaxik', as well as a battle at Ut'mus\\nvillage in V anand, but was defeated in both. He remained seven years, and then departed [g29].\\nThen came Ormazd, son of Anushirvan Xosrov , the king himself. He had bound Vndo and left him in\\nGruangakan, [14] though Vstam had escaped and gone as a fugitive and not a few were the wars he stirred up\\nin those days.\\nIn this period there lived a certain V ahram Merhewandak, prince of the eastern parts of the land of Iran, who\\nin his bravery had beaten the troops of the T'etalats'ik' and held through force Bahl and the entire country of\\nthe Kushans from the far side of the great river called V ehrot as far as the place called Kazbion. [Indeed], on\\nthe far side [of the river] he had left behind the spear of the brave Spandiat about whom the barbarians say\\n\\\"Having reached this far in battle, he cast his spear into the river .\\\"\\nIt was then that this V ahram made war on the king of the Mazk'ut' who was in those parts on the far side of\\nthe great river . [Vahram] struck at the multitude of his troops, killed the king in battle, and ravished all of the\\ntreasures of that kingdom.\\nThen [V ahram] sent to the Iranian king by means of his messengers documents announcing the glad tidings\\n[but] only an insignificant part of the loot from the very great treasures—the insignia of the [fallen] kingdom\\namong the honored goods—[while] he dispensed all the [rest of the] [15] treasure among his troops according\\nto each one's merit.\\nNow when king Ormazd saw the envoys who had come with the good news, when he read the letter of\\ngreeting from the troops and received from the worthy royal treasures the gifts of war -portion while\\noutwardly he humored the men, inwardly he was blazing with wrath and saying: \\\"I recognize the insignia of\\nhonor , [and that] the meal was more than great, but from the treasures amassed it is not proper that such [a\\nsmall amount] should be forwarded to the court.\\\"\\nSo, in return for the message of good news, he ordered [g30] written a hrovartak  filled with rage, and he sent\\n[troops] from the brigade of hamazar s and royal p'ushtipans  to go to [V ahram's] troops and take all the loot\\nfrom them. The troops went and began demanding [the loot].\\nAt that point the entire force became excited and killed the king's men. They left the king's service, seated\\n[16] V ahram as their king, swore an oath according to their custom, united and left the East. They headed for\\nAsorestan, to kill their king, Ormazd, do away with the House of Sasan, and establish V ahram on the throne\\nof the kingdom. \\n[He] quickly assembled and took along the multitude of brave and warlike peoples of the East. While there\\nwas such chaos occurring in the land of Iran, [in Armenia] Y ovhan Patrik  and Byzantine troops were holding\\nthe city of Dwin under siege. They were fighting using [siege] machinery and were close to destroying the\\nwall.\\nWhen news of this [i.e., events in Iran] reached them, they left of f [the siege] and departed for Atrpatakan.\\nThey ravaged the entire country , putting all men and women to the sword. T aking all the loot, captives, and\\nbooty , they returned to their country .\",\"Now when the clamorous news of this [event] reached Ormazd, the king of Iran, at the court of the Sasanians,\\nhe felt no few pangs of alarm. Summoning the naxarar s who were at the royal court, the brigades of\\nhamaharz es and the p'ushtipans , he planned to take the treasury of the kingdom [17] and the entire court host,\\npass across the great T igris river by bridge to V ehkawat [or , via Zom to V ehkawat], cut the bridges down and\\nfind asylum in the multitudinous hosts of the king of the T achiks.\\nHowever , this did not come to pass. For the king's men, and hamaharz es and pushtipan s resolved to kill\\nOrmazd [g31] and to enthrone his son Xosrov . They decided to free [Vndo, Vstam's brother] to make him\\ntheir leader and chief of the operation. They went to Gruandakan fortress and released him and all the\\ncaptives with him. [Vndo] sent a trustworthy messenger with very swift horses to his brother . [18] They went\\nto Gruandakan fortress and released him and all the captives with him. [Vndo] sent a trustworthy messenger\\nwith very swift horses to his brother Vstam with the written message: \\\"Come as fast as you can, and\\nparticipate\\\". And Vstam arrived quickly .\\nThen all the naxarar s and commanders of troops, and soldiers assembled in the hall of the court at an hour\\nwhen they met there. Entering the royal chamber , they seized, quickly blinded and then killed king Ormazd.\\nThey enthroned [Ormazd's] son, [Xosrov II Aparvez, first reign 590] as king of the land of Iran, then began to\\nprepare to flee to the other side of the great T igris river . Not many days later V ahram arrived with speed, like\\na pouncing eagle.\\nBecause Xosrov was a small boy when enthroned, his uncles [ k'erhink'n , \\\"mother's brothers\\\"] Vndo and\\nVstam took him across the great T igris river by bridge, destroying the bridges after them. [Meanwhile],\\nVahram came [19] and took all the tun, treasury , and women of the court and sat upon the throne of the\\nkingdom. He ordered wooden rafts tied together and crossed the river to seize Xosrov . But [the latter], out of\\ndread, was in no way able to halt for rest. As soon as [his party] crossed, they fled, wondering on the road\\nwhether it would be better to go to the king of the T achiks or to the king of the Byzantines.\\nFinally they decided it best to seek refuge with the king of the Byzantines. \\\"For\\\", they said, \\\"despite the\\nhostility existing between [us], nonetheless [the Byzantines] are Christian and merciful, and they are unable\\nto break a sworn oath\\\". Going west by a direct route, they entered the city of Xaghab where they stopped.\\n[As for V ahram], although he crossed the river he was unable to catch up. He returned to Ctesiphon [g32].\\n[The text styles Xosrov ark'ay  and Maurice t'agawor , though elsewhere both are called t'agawor . Hereafter\\nwe shall translate t'agawor  as \\\"emperor\\\" when it refers to the Byzantine ruler , and as \\\"king\\\" for the shah .]\\nThen king Xosrov sent men bearing costly gifts to emperor Maurice, and he wrote him the following: \\\"Give\\nme the throne and place of rule [which belonged] to my fathers and [20] and ancestors: dispatch an army to\\nassist me defeat my enemy; establish my reign and I shall be your son. I shall give you the areas of the\\nSyrians, Aruastan in its entirety as far as the city of Nisibis and from the country of the Armenians, the land\\nof Tanuterakan  rule [extending] as far as Ararat, and to the city of Dwin, and as far as the shore of the Sea of\\nBznunik' [Lake V an] and to Arhestawan [I shall also give] a lar ge part of the land of Iberia/Geor gia, as far as\\nthe city of T iflis. Let there be an oath of peace between the two of us, lasting until our deaths, and between\\nour sons who rule after us\\\".\\nThe emperor assembled the entire senate to ask their advice. He said to them: \\\"The Iranians have killed their\\nking Ormazd and then enthroned his son. However , the troops of the realm seated yet another man as king in\\nthe East, and he [V ahram] came with a lar ge army and seized the kingdom for himself. [Ormazd's] young son\\nhas come to us as a fugitive seeking an auxiliary army from us, and in return has promised to do thus and so.\\nNow what shall we do, accept him? [20] Is he worthy of acceptance or not?\\\" [The senators] replied: \\\"It is not\\nworth accepting him, for [the Iranians] are an impious people, and thoroughly false. For , in times of their own\",\"difficulties they make promises, but when the turmoil ends, they break those promises. W e have suf fered\\nmuch wickedness from them. Let them wipe out each other , and we will have peace.\\\"\\nKing Xosrov was in great danger then and could see death before his eyes because, having escaped from the\\nlion's mouth, he had fallen into the mouths of enemies from which there was no escape.\\nHowever , the emperor rejected the senate's counsel, and instead sent his own son-in-law , Phillipicus,\\nentrusted with a reply of acceptance [for Xosrov]. He received [Xosrov's] oath and gave him an imperial\\nauxiliary army [including] Y ovhan Patrik  from Armenia, the stratelat  Nerses [g33] from Syria plus their\\ntroops. They mustered 3,000 cavalry [massed] in hundreds and in thousands, in brigades, under their own\\nbanners.\\nThe mother of [the Iranian commander] Shapuh was the daughter [22] of the Asparapet  (who was from the\\nnaxarar  House of the Part'ews which had died out) [The text seems corrupt: dustr  Asparapetin  aynorik , or er\\nnaxarar  tann Part'ewats' , ork' merheal ein...] and the sister of Vndo and Vstam. Vndo himself was a wise and\\nsagacious man, and very brave-hearted, as I have said. He fought a great battle at Melitene, but was defeated\\nand left. Then came T am Xosrov who fought two battles: one in Basen [district] at Bolorapahak where the\\nMurts' and Arax [rivers] mingle; and one in Bagrewand [district] at Ket'n. He was very successful in both\\n[battles]. After remaining for two years, he departed.\\nThen came V araz Vzur who fought one battle at Ut'mus village in V anand. At first he was driven of f, but he\\nlater triumphed. He remained for one year , and then departed.\\nThen came marzpan  Hrahat who went to Mrtsuni [having] his kinfolk for support in battle. They were\\ndefeated there, but later triumphed. T urning thence he fought and won a battle at T saghkajur in Bznunik'. He\\ndeparted after four months.\\n[23] Next came marzpan  Hrarti Datan. Thereafter , however , the Iranians were unable to resist the Byzantine\\ntroops. It was during this period that Ormazd was killed and his son Xosrov was enthroned. [Hrarti Datan]\\ndeparted after two years.\\nAfter this Iranian border -guards came [and this continued] until the expiration of the peace which had existed\\nbetween the Iranians and the Greeks, between the two kings, Maurice and Xosrov .\\nThen came V endatakan, then Xorakan. The latter was killed by Iranian troops at Garni who then rebelled and\\nwent to Geghums. Then came Merakbut, then Y azden, then Butmah, then Hoyiman [g34].\\n[Page 24]\\n[This is the] Book of the T imes the History of Kings an Iranian romance [regarding] the universal defeat of\\nthat Sasanian brigand, Xosrov Apruez [ Matean zhamanakean patmut'iwn t'agaworakan V ep ariakan vanumn\\ntiezerakan, hen Sasanakan yApruezn Xosr ovean .] who put everything to flame, agitated the sea and land, and\\nbrought ruin upon every country .\\nI shall narrate what happened to the country , how it was ruined, making use of legends\\n[charhets'its'...ar haspels vipasanelov ]. [I shall tell] about W rath from On High, how anger blazed forth below;\\nabout the fire and the bloodshed, the pillaging expeditions, the raids which brought death [accompanied by]\\nthe screams of dews (demons) and the roar of dragons. [I shall speak of] the race of Mages [ zazants'\\nk'awdeats' ], about men descended from giants, armed braves, cavalrymen from East to W est, from North to\\nSouth; about the Southerners [the Arabs] who arose with great turbulence and attacked [Iran and Byzantium]\\nand executed the command of the Lord's anger over every country . [The Arabs] spun like a whirlwind,\"],\"start\":12,\"end\":16,\"length\":4},{\"chapter\":\"3\",\"pages\":[\"became a storm, and corrupted everything below them, devastating mountains and hills, tearing apart plains\\nin various places, and crushing rocks and stones under the trampling hooves of their horses. Now I shall begin\\nthe romance about that destructive corrupter , Xosrov , God's accursed [g35]. \\nChapter 3\\nVahram's attack on Xosr ov, and the two letters to Mushegh; Mushegh's loyalty to Xosr ov; the gr eat battle; the\\ndefeat of the r ebels; Xosr ov's lack of gratitude towar d Mushegh which r esulted in Mushegh's plans to kill him;\\nthe writing of an accusation to the emper or by means of the Byzantine princes; the emper or's dissatisfaction\\nwith that and the letter to [the princes] and to Xosr ov; the dispatch of Byzantine tr oops; the summoning of\\nMushegh to the palace by the emper or.\\nAfter the death of Kawad's son, Xosrov , his son, Ormazd, ruled over the land of Iran [579-90]. [Ormazd's]\\nmother , Xosrov's wife named Kayen, was the daughter of the great Khaqan/Qaqan (Xak'an), king of the\\nT'etalats'ik'. Thus [Ormazd] inherited a bad [nature] from his father's line, but an even more bestial [nature]\\nfrom his mother's line.\\nHe did away with all the naxarar s and [26] the earlier , more indigenous Houses of the land of Iran. He killed\\nthe great Asparapet  of the Part'ew and the Pahlaw who was [descended] from the son of Anak (whom [the\\nArmenians] put to death) whom that bandit king Xosrov of Armenia took as a dayek , whom they spirited\\naway to the court of their king in Iran [The text seems corrupt: Span sa zAsparapetn mets zpart'ewn ew\\nzpahlawn or er i zawake Anakay mahaparti. zor ar hareal dayekats' i hine anti Xosr ovay ark'ayi Hayots'\\np'axuts'in i dur hn ark'uni iwr eants' i koghmans parsits' ]. The king fulfilled [on the son] the rewards promised\\nto his father Anak once [the son] had fled there, namely , the bun [native habitat] of Part'ewakan Palhaw itself.\\nHe tied a crown on his head and exalted him, making him second in the kingdom.\\nThe Asparapet  had two sons, one named Vndo, the other Vstam. They accepted troops from the land of\\nArmenia and assembled whomever they found at hand then. When they mustered they were some 15,000\\nmen, each brigade of naxarar s [arranged] in hundreds and in thousands in brigades and under their banners.\\nAll were armed, all were choice warriors, [27] burning with bravery , like fire. They neither panicked nor\\nturned back. Their faces were like eagles'. Their light-footedness was like the lightness of wild goats running\\nupon the plains. W ith dilligence and full loyalty they took the road.\\nThe Mithraist rebel took his troops [The translation is uncertain: arheal apstambin  mihrats 'eloyn  zzawrs  iwr...\\n], elephants, and all the royal treasures and reached Atrpatakan. They encamped, at a little distance from each\\nother , in the district of V ararat. Then V ahram wrote a hrovartak  to Mushegh and to other naxarar s of\\nArmenia. It went as follows:\\n\\\"I had thought that as soon as I started battling with your enemies, you would come from those parts\\nand help me; and that I and you, united, would do away with that universal pestilence, the House of\\nSasan. But you, massed and coming against me in battle, are helping them. I am not afraid of the\\narmy of Roman elders who have come against me. But you Armenians show the love of your master\\nat an inopportune time. T ruly, did not the House of Sasan abolish your country and lordship? Why\\nwas it that your fathers always rebelled and went to serve those [the Byzantines] who to this day are\\nfighting over your land? Should you come against me you will destroy so much of your merit, for\\n[28] should Xosrov triumph, the two of them united [i.e., Xosrov and the emperor Maurice] will\\nremove you from their midst. If, however , it is agreeable to you, break with them, unite with and aid\",\"me. Should I triumph, I swear by the great god Aramazd, by the lord Sun, by the Moon, by Fire and\\nby W ater, by Mihr and by all the gods, that I shall give you the Armenian kingdom. Make whomever\\nyou want the king. And I shall leave you the entire country of Armenia as far as Kapkoh and the\\nGate of [Caucasian] Aghbania/Aghuania; from the Syrian area: Aruastan and Nor Shirakan as far as\\nthe boundaries of the T achiks, for this [territory] was yours from your ancestors; [I shall give\\nterritories] extending westward to Caesarea in Cappadocia. I shall not rule beyond the Arasp river\\n[g37]. Let the treasury of the Aryan kingdom be considered suf ficient for me and you. That should\\nbe plenty for you before your kingdom is established\\\".\\nThen, in accordance with their [Iranian] custom, [V ahram] wrapped up salt, and sealed it with the hrovartak .\\n[The partisans of Mushegh] received and read the hrovartak , but they neither replied nor did they reveal [its\\ncontents] to many [ naxarar s] because they feared their disunity .\\n[29] But [V ahram] wrote a second letter:\\n\\\"I wrote to you to break with them, considering all the lands and treasures of this kingdom suf ficient\\nfor you and me. Y ou, however , chose not to listen, and you did not respond. I feel sorry for you,\\nbecause tomorrow at dawn I will show you splendid elephants mounted by troops of armed braves\\nwho will rain down upon you arrows of iron, shafts of tempered steel dispatched by hard-hiting\\narchers, powerful young men, well-armed, and swift T achik horses, axes and swords of tempered\\nsteel, and blows enough for Xosrov and for you.\\\"\\nMushegh replied to him [as follows]:\\n\\\"God's compassion goes to whomever He grants it to. Y ou should feel sorry for yourself, not for us. I\\nhave come to regard you as a boastful man, someone who takes comfort not in God, but in bravery\\nand the strength of elephants. And now I say to you that if God so wills it, tomorrow you will be\\nembroiled in a battle with braves who will explode upon you and your multitude of elephants like\\nthe most violent clouds in the sky . An enormous explosion will be heard from on High, and a flash\\nof lightning, and armed men on white horses with unerring spears will attack you and pass through\\nyour hosts the way lightning does through an ever green forest, burning [30] the branches as the bolts\\nrain down from Heaven to earth [g38], burning the brush of the fields. For , should God will it, a\\nwhirlwind will carry of f your might like dust, and the treasury of the court will return to the court.\\\"\\nAmong [the Iranians] were Vndo and Vstam, about whom I spoke earlier . The Iranians had about 8,000\\ncavalrymen. At early dawn the next morning, just as the sun was rising [the troops] drew themselves up, front\\nfacing front, and clashed in battle. The massing and the melee were violent and in the agitation the\\ndestruction was enormous. After fighting from dawn to dusk, both sides became fatigued with warfare.\\nThe killing was so great that a torrent of blood flowed in streams and watered the entire country . Unable to\\nresist, the army of rebels fled before the Byzantine troops. [The latter] pursued them, covering the plains and\\nroads with corpses, until it was dark night. [The Byzantines] put many to their swords; many others they\\narrested, binding their hands to their necks, and leading them before the king.\\nA multitude of elephants was coming at a violent speed. Behind them were the armed azatagund.  From below\\n[the Byzantines] [31] pierced the armor of the cavalrymen who were mounted on elephants. Fighting\\nfearlessly and courageously , [the Byzantines] killed many elephants, cavalrymen, and elephant-keepers and\\nwere able to forcibly lead of f a multitude of the elephants, which they brought before the king.\",\"Thence they turned upon the campsite of V ahram's army . In one tent they found the court treasury and all the\\npriceless, countless, inestimable treasures of the kingdom. This was all taken as booty . With their swords they\\ndismembered many gor geous thrones of diverse sorts. Going to the area in phalanxes, they loaded [the goods]\\nonto a multitude of camels and mules. Everyone filled up with much great loot.\\nThe Iranian troops then were able to gather a not insignificant part of the treasures and take them to their\\ncourt. King Xosrov on that day grew more powerful as a result of this victory , more so than any of his\\nenemies, and his kingdom was established.\\n[Xosrov] ordered that the multitude of arrested horsemen and elephant-riders be stripped, that their hands be\\ntied upon their shoulders, and that they be trampled under the elephants' hooves. But they could find no trace\\nof Vahram. [32] For he had fled and gone as a fugitive, and landed in Bahl Shahastan where, upon Xosrov's\\nword, they themselves killed him.\\nSome days after this great battle, king Xosrov sat in his tent. Before the king were all of his grandee naxarar s.\\nThe Byzantine army was encamped at a day's distance from [the Iranians], densely massed, brim full of their\\nbooty .\\nThe king began speaking as follows: \\\"In truth has there ever been any one of the world's kings who, being\\nable to seize another king—his own enemy , the destroyer of his kingdom—did not have him killed, and did\\nnot exterminate all the males [with him] from his land? [What king, instead of doing these things] would\\nadopt [such a royal fugitive], crown him, and exalt him by adorning him with purple, defeat his enemies,\\nestablish him on the throne of his kingdom, give him courtly treasure out of his own treasures, and\\nbenevolently free him to go his way? My father , emperor Maurice, bestowed such benefits on me which no\\nman could bestow upon his own beloved son.\\\" Some of those [ naxarar s] responded to [Xosrov] as follows:\\n\\\"King, live forever! W e do not know whether or not gratitude is fitting, for every kingdom is made stable by\\ntreasure, [33] [yet the Byzantines] have looted all the kingdom's treasures.\\\"\\nThe king replied: \\\"I shall directly retrieve the treasures of my kingdom from them, together with [other]\\ntreasures they have amassed, for all of that belongs to me. But the one thing that disconcerts me is the fact\\nthat that [Vahram], who hates his master , lived and departed. He is a brave man and will again assemble\\ntroops from among the braves of the peoples of the East.\\\"\\n[The naxarar s] answered him: \\\"They helped that ingrate to flee. W ith our own eyes we saw how that\\nMushegh Mamikonean took [V ahram], gave him horse and weapon and released him. They said this because\\nthey wished [Mushegh] ill, since, viewing his grandfather evilly , their hearts hardened against him. Y et the\\nking never wondered about the matter , since he was a small boy , and inexperienced. Nor did he recollect the\\nagitation of such [Armenian] soldiers. Rather , he fixed his mind on those falsehoods, saying: \\\"Let that\\nMushegh be summoned here and be bound hand and foot, until I inform the emperor about him.\\\"\\n[The king] immediately ordered a note [ yetkar ] to be written [34] [to Mushegh]. He dispatched one of the\\nenvoys to Mushegh [with the message]: \\\"Come quickly . An extremely important matter has come up.\\\"\\n[Xosrov] gave this command to his p'ushtipan s: \\\"Be ready . When IMushegh] arrives, and when I signal you\\nwith my hand, pull his arms back and tie him up. But be prepared, for he is a brave man. And see to it that he\\nneither dies, nor kills me. Should he die, I will be answerable for him to the emperor .\\\" He similarly\\ncommanded his ushers [ barapanats'n ], saying: \\\"T ake care that when Mushegh comes to the entrance of my\\ntent you remove his belt and sword. T ell him, 'it is not legal to go before the king with a weapon.'\\\"\\nNow while [Mushegh] conducted a review of his troops, ascertaining the number living and the number\\nwhich had died in battle, [Xosrov's] messenger came before him. [The messenger] greeted him and gave him\\nthe letter . Taking the letter , Mushegh asked him: \\\"Is this a greeting, and [does it mean] peace?\\\" The\",\"messenger replied: \\\"It is indeed a greeting and [signifies] peace. I do not know what else it says, only that I\\nwas commanded to summon you quickly .\\\" [Mushegh] immediately began preparing himself [35] as though he\\nwere going to war , for it had entered his [g41] mind that perhaps some military matter had come up, or that he\\nwould be rewarded with gifts for his labors. He took along 2,000 armed men, azats and non- azats, whom he\\nfound worthy of honor , and he felt confidence in his cavalry .\\nHe wrote to Y ovhan patrik  to release him. [The latter] so commanded that [Mushegh] travel with such\\npreparation [as he had planned], and he ordered all of [Mushegh's men] to see to their own armaments. They\\narmed, and departed.\\n[Mushegh's forces] entered the [Iranian] army and were close to the court Mashkaper chan  (\\\"tent\\\", \\\"pavilion\\\")\\nwhen an order reached him not to approach with such a multitude, but rather to have them encamp at a\\ndistance, and to appear before the king with only a few men.\\n[Mushegh], however , did not consent to this. Instead, he went with his troops close to the entrance of the\\ncourt tent. Iranian soldiers, well-armed, were standing around the tent. Dismounting from his horse,\\n[Mushegh] went to the entrance of the tent with 50 men. The men remained as they [36] were, each one\\narmed, and with a horse. The king was horrified as were all the soldiers with him, and began to conceal their\\ntreachery . As soon as [Mushegh] reached the entrance of the tent, ushers at the door approached him and said:\\n\\\"Remove the belt and sword from your waist, and remove your armor , because it is not lawful to go before\\nthe king [armed].\\\" Doubt stirred in [Mushegh's] heart and he began to condition and prepare himself for\\nattack. He responded to the ushers as follows: \\\"From my childhood I have been the table-companion of kings\\n[deriving from the time] of my ancestors and grandfather . And now I have reached the door of the court, the\\nplace of review . Am I to remove my armor , my girdle and belt now , when I never do so even in my own\\nHouse, even when rejoicing? Or indeed, am I worthy of the wickedness of you Iranians?\\\" Then he ordered\\nsomeone to go to the soldiers to have the auxiliary army move forward. He himself turned to go.\\n[37] The king was informed that [Mushegh] refused to enter so [unarmed], and instead had turned and left. So\\nthe king started to conceal his wickedness, saying: \\\"Let [g42] him overlook it, let him come as he pleases.\\\"\\nFor [Xosrov] himself was a lad, and his troops were few and far between. They called [Mushegh] back,\\nsaying: \\\"[The king] ordered that you may enter as you wish.\\\" [Mushegh] turned and said: \\\"Let me see what\\nboon the king of kings plans to give me.\\\"\\n[Mushegh] entered the tent, [going] before the king accompanied by seven men. He prostrated himself in\\nreverence to the king, and then stood up. But the king did not extend his hand as hitherto had been done [in a\\ngesture of] receiving and greeting him. Rather , he remained there frozen, and they stubbornly faced each\\nother that way .\\nThe king grew frightened and dismayed, and was unable to give the order he had planned, or to say anything,\\ngreat or small, because of his dread. Once again [Mushegh] quickly left the tent. They brought him his horse;\\nhe mounted and departed. As soon as the king saw that, he became extremely frightened. But wanting to\\nconceal his injury , he arose from the throne and strode to the entrance of the [38] tent, went outside and\\ndispatched a certain principal naxarar  after [Mushegh]. He had salt sent, to swear an oath, and to call him\\nback \\\"so that you depart with honor and exaltation and do not consider that something else was intended.\\\"\\n[Mushegh], however , did not want it. Instead, he took to the road. Now he planned to deal with them as\\nfollows: [he planned] to attack his tent at the second hour , and to kill him. He so ordered the armed troops\\nwho stood around the tent of Xosrov . [But] because his troops were informed there was agitation, and they\\nabandoned that plan and departed.\",\"As they travelled, a certain one of the king's p'ushtipan s strayed across their path. [The Mushegheans] seized\\nhim and took him to their own people. And Mushegh threatened him with an oath, saying that if he did not\\ntell him what had transpired concerning [Mushegh] himself, he would die.\\nThen [the p'ushtipan ] made [Mushegh] swear an oath that he would not turn him over to the Iranian king. He\\ntold everything. The next day at dawn [Mushegh] went to the door/court [g43] of Y ovhannes patrik , saw him,\\nand told him all the wicked tales. He had with him the ostikan  p'ushtipan  who also came and described all\\nthat had happened. The princes and [39] all the soldiers became agitated, but when reminded of the emperor's\\noath and his disturbed state, did nothing about it. They told [Mushegh] to write to the emperor , to familiarize\\nhim with all the wicked events. But Mushegh said in front of all of them: \\\"If that man is not killed, every\\ncountry under the lordship of the Byzantines will be taken by his hand.\\\"\\nThen [the Mushegheans] selected great gifts as their king's share of the booty: crowns and a diadem made of\\nemeralds and pearls; a very great quantity of gold and silver , matchless precious gems, as well as the most\\noutstanding garments which, in their ornamentation, were made for the kings of the Iranians; horses from the\\ncourt, including the very court trappings for them.\\nThey sent [the above gifts] and with them a written hrovartak  announcing the good news, as well as an\\nindictment of king Xosrov . [The Mushegheans] massed four hundred cavalrymen to accompany the gifts.\\nNow Xosrov became informed that they were about to deliver to their emperor as a share of the loot some of\\nhis treasures, and he learned that they had written a complaint about himself. Filled with bitterness, Xosrov\\nsent an army after them, to reach them on the road, to destroy Mushegh suddenly and [40] secretly , to take the\\ntreasure of the court and to bring it back to him at once. The Byzantine princes also knew about matters. They\\nsent after them a very forceful army; when they had passed by , not a single one [of the enemy] lived, and no\\nword rose about it. [The text seems corrupt.] The troops took [the treasures] and brought them to the palace\\nwith great rejoicing.\\nThe king received the gifts and sent a hrovartak expressing great thanks by means of his messenger . And he\\nwrote [the Mushegheans] to abandon the plan in which they condemned the king. \\\"If you do not restrain\\n[Mushegh] I shall demand him from you\\\" [the emperor wrote]. He also wrote to the king gratefully releasing\\neveryone [g44].\\nThen king Xosrov gave presents to each according to importance, and dismissed them. He himself left\\nAtrpatakan and went to Asorestan, to his native royal abode. And he was [41] established on the throne of his\\nkingdom. He gave to the emperor the promised gifts: all Aruastan as far as Nisibis: the country of the\\nArmenians which had been under his sway the Tanuterakan  House as far as the Hurazdan river the district of\\nKote as far as the awan  of Garhni and to the shore of the Sea of Bznunik' [Lake V an], Arhestawan and to the\\ndistrict of Gogovit as far as Hats'iwn and Maku. The area of the V aspurakan brigade was in service to the\\nIranian king. Many of the naxarar s of Armenia were in the Byzantine part, few were in the Iranian part.\\n[Xosrov] also gave [to Maurice] a great part of the land of Iberia/Geor gia, up to the city of T iflis. The king\\nsummoned Mushegh to the palace, and he never again saw the country [of Armenia].\"],\"start\":16,\"end\":21,\"length\":5},{\"chapter\":\"4\",\"pages\":[],\"start\":21,\"end\":21,\"length\":0},{\"chapter\":\"5\",\"pages\":[\"Chapter 4.\\nThe piety of queen Shirin, who was king Xosr ov's Christian wife; Xosr ov's hrovartak .\\n[Xosrov], in accordance with their Magian religion, had numerous wives. He also took Christian wives, and\\nhad an extremely beautiful Christian wife from the land of Xuzhastan named Shirin, the Bambish , queen of\\nqueens [ tiknats'  tikin]. She constructed a monastery and a church close to the royal [42] abode, and settled\\npriests and deacons there allotting from the court stipends and money for clothing. She lavished gold and\\nsilver [on the monastery]. Bravely , with her head held high she preached the gospel of the Kingdom, at court,\\nand none of the grandee mages dared open his mouth to say anything—lar ge or small—about Christians\\n[g45]. When, however , days passed and her end approached, many of the mages who had converted to\\nChristianity , were martyred in various places.\\n[Xosrov] commanded: \\\"Let no infidel dare convert to Christianity and let none of the Christians convert to\\nimpiety . Rather , let each individual remain true to his paternal religion [ hayreni yawr ens]. Whoever does not\\nhold his paternal faith [ zhayr eni den] but rebels from the religion of his fathers, will be put to death.\\\" But on\\nthe great feast of Psalm Sunday , [Christians] from the monastery of Shirin, and other Christians went to the\\nentrance of the king's chamber , and worshipfully read the Gospel. They received presents from [43] the king,\\nand departed. And no one dared to say anything to them. \\n \\nChapter 5.\\nEmper or Maurice r equests the body of Daniel fr om king Xosr ov.\\nIt happened in those days that the emperor of the Byzantines requested from the king of the Iranians the body\\nof that deceased man which was in Shawsh, in a copper basin in the king's treasury . The Iranians called him\\nKaw Xosrov , while the Christians called him Daniel the prophet. King Xosrov ordered that [Maurice's]\\nrequest be granted. But queen Shirin was extremely agitated over this af fair. When she was unable to change\\nthe king's mind, she ordered all the Christians of the land to request of Christ with fasting and prayers that the\\nblessing [of Kaw Xosrov's presence] not leave their land.\\nThe entire country assembled in that spot and beseeched Christ to prevent [the move] with fervent pleas and\\nwith tears. Mules were brought, as was the court palankeen [g46]; they took [Daniel's remains] and departed.\\nBut as soon as they passed through the city gate, suddenly those streams which flowed through the city and\\noutside, dried up. The entire country [44] followed after [Daniel's remains] with cries and alarm.\\nAs soon as they were at a distance of three aspar ez from the city , suddenly those mules [bearing] the\\npalankeen halted and no one could make them budge. Suddenly they violently wielded their swords causing\\nthe mob and the brigade to scatter and they rushed back to the city . And as soon as they entered the city gate\\nthe waters of the river flowed and water gushed forth in abundance, as had been the case before.\\nThey quickly informed the emperor about this. He had a mass performed [for Daniel] and ordered [his troops]\\nto do as [the relics] willed. They left [the relics of Daniel] and departed.\"],\"start\":21,\"end\":22,\"length\":1},{\"chapter\":\"6\",\"pages\":[\"Chapter 6.\\nMaurice writes Xosr ov a letter of condemnation about the princes and tr oops of Armenia, suggesting that he\\nsend those [princes and tr oops] in his section to Thrace while [Xosr ov] send those in the Iranian section to\\nthe East; the flight of princes in the Byzantine section to Iran; Xosr ov dispatched the Hazarakar with much\\ntreasur e to the Byzantine section to attract many [princes] to his side; the princes ravish the tr easur e;\\npreparation for war; the message; disunity of the princes, some of whom went to the Byzantines, others to the\\nIranians.\\nIn that period the Byzantine emperor ordered a letter written to the Iranian king. [It was] a complaint about\\nthe [45] princes of all Armenia, and their troops [which read as follows]:\\n\\\"There is a crooked and disobedient people which dwells between us and causes trouble. Come now ,\\nI shall assemble mine and send them to Thrace. Assemble yours and have them taken East. Should\\nthey die, [our] enemies will be the ones dying; should they kill others it will be our enemies who\\nperish, and we shall live in peace. But should they remain in their own country , we shall have no\\nrest\\\" [g47].\\nThen the two [rulers] united. The emperor started ordering [the Armenians] to assemble to go to Thrace, and\\nhe was implementing the order with extreme violence. [The Armenian princes and their troops] began to flee\\nfrom the [Byzantine] sector and to go in service to the Iranian king—especially those whose country lay\\nunder [the emperor's] jurisdiction. Now [Xosrov] received all [the fugitives] with more exaltation and much\\ngreater gifts than the emperor had ever bestowed on them. This occurred even more when he saw them\\nfleeing from the emperor , he wanted to win them to his side with even greater af fection.\\nNow when the Iranian king observed the flight of people from the emperor , he sent to Armenia the [46]\\nVaspurakan  hamarakar  with much treasure, and very great honors to subdue [the princes] with it and to draw\\nthem into his service. The hamarakar  went to Armenia with treasure loaded onto numerous camels.\\nSamuel V ahewuni with other comrades went against him, encountering him at the borders of the land of\\nAtrpatakan. They took the treasure [but] granted the hamarakar  his life. [The princes were]:\\nAtat Xorhxorhuni, \\nSamuel V ahewuni, \\nMamak Mamikonean, \\nStep'annos Siwni, \\nKotit, lord of the Amatunik', \\nT'eodos T rpatuni,\\nand about 2,000 cavalrymen. They were thinking as follows: \\\"W ith that treasure we shall make Armenia our\\nown. W ith their aid we shall wage war with both kings and forcibly return our country to ourselves.\\\" [But]\\nonce they reached the city of Naxchawan, their plan of unity came apart. They did not believe one another ,\\nthey divided the treasure, and then encamped in the swamp called Chahuk. Meanwhile that hamarakar  went\\nto court and informed the king of all that had [47] transpired. And the emperor's words were vindicated. \\n \\nKing Xosrov ordered that a hrovartak  be written to the emperor , requesting an auxiliary force. He also\\ndispatched the vaspurakan  hamarakar  to Armenia. Then [the emperor] ordered the general Heraclius who\"],\"start\":22,\"end\":23,\"length\":1},{\"chapter\":\"7\",\"pages\":[\"was located in the country [g48] of Armenia to take his troops and go against [the rebels] in battle. The troops\\nof the two kings united in the city of Naxchawan. As these troops started to mass, they began sending\\nmessages [to the rebels] saying: \\\"Let there not be warfare and bloodshed among Christians. Rather , abandon\\nyour stuborness and resign yourselves to serving the king.\\\" By oaths they confirmed that \\\"you have nothing to\\nfear from the king.\\\" The hamarakar  also said: \\\"The king of kings sent me to you; indeed, I brought the\\ntreasure for you. Y ou have nothing to fear from the king of kings.\\\" He gave an oath, in accordance with their\\ncustom. \\n[The Armenian rebels] began to separate and divide from each other . Mamak Mamigonean, Kotit, lord of the\\nAmatunik', Step'annos and others withdrew , displaying themselves as innocent to the hamarakar , subduing\\ntheir troops into serving the Iranian king. Meanwhile Atat Xorhxorhuni and Samuel V ahewuni and their\\ntroops fled. Going via the town called Sawdk', they reached the land of [Caucasian] Aghbania/Aghuania,\\nheading for the Huns [48] and, after crossing the river called Kur , they encamped on the riverbank. \\n[The Huns] also reached the river and encamped on the opposite side. And as soon as [the rebels realized]\\nthat they could not trust the Huns' camp, they requested an oath from the Byzantine emperor and went into his\\nservice. Some went to the hamarakar  and then returned to their own country . The hamarakar  assembled all\\nthe princes and troops of the Iranian sector of Armenia encouraging them all through persuasion and sweet\\nwords. He united them and formed them into brigades. Leaving few in the land, he departed, saying: \\\"until I\\nfind out about you, and a command comes to remain there.\\\" For it had entered his mind that others would\\ncome to [the rebels] and that they would multiply .\\nThe emperor summoned Atat Xorhxorhuni and his troops to quickly come to the palace. He exalted [Atat]\\nwith splendor and honor , gave him numerous goods, and sent him to Thrace [g49]. \\n[Page 49]\\nChapter 7.\\nThe Armenian princes in the Byzantine sector r ebel; the war; the deaths of some in battle and the\\ndecapitation of two [r ebels].\\nOnce again the V ahewunik' sepuh s in the Byzantine sector—Samuel whom I mentioned above, and Sar gis\\nand V araz Nerseh and Nerses and Vstam and T'eodoros T rpatuni—rebelled. They planned to kill the\\n[Byzantine] curator while he was seated in the hot springs close to the city of Karin, to cure an illness. But\\n[the latter] was informed somehow and fled to the city . Thus, when they invaded the bath, they did not\\nencounter him. Then [the rebels] looted whatever they found, taking a great deal of booty , and departed to the\\nsecure Korduats' country . They wanted to have the stronghold there.\\nNow the Byzantine forces with general Heraclius and Hamazasp Mamikonean pursued them. [The rebels]\\napproached the stronghold, crossing by bridge the river called Jermay (which is styled Daniel's bridge). They\\ncut down the bridge and fortified themselves in a pass where they held the site of the bridge. [The\\nByzantines] were on the [opposite] riverbank wondering what to do. Because they were unable to find a ford,\\nthey wanted to depart. But unexpectedly , [50] a traveling priest strayed into their midst. They seized him and\\nsaid: \\\"If you do not show us the river's ford, we will kill you.\\\" [The traveller] took the forces and showed\\nthem the ford [at a place] below where they were. All the troops crossed the river . Some of them held [watch\"],\"start\":23,\"end\":24,\"length\":1},{\"chapter\":\"8\",\"pages\":[\"over] the stronghold, others the bridgehead. [Some] held the mouth of the valley , others entered the\\nstronghold and battled with them. The devastation was enormous, and [the rebels] were worn out. \\nKilled in the battle were Nerses, Vstam, and Samuel, who killed quite a few [warriors] around them in fight\\n[g50]. But Sar gis and V araz Nerseh were arrested along with some others. They were taken to the city of\\nKarin and later beheaded. When they were about to be beheaded, V araz Nerseh said to Sar gis: \\\"Let's cast lots\\nto see whom they kill first.\\\" But Sar gis replied: \\\"I am an old, blame-worthy man. I beg you, grant me this\\nlittle respite, that I not see your death.\\\" So they beheaded him first. Now T'eodoros T rpatuni fled to the court\\nof the Iranian king, for refuge. But [the king] ordered him bound and delivered into the hands of his enemies\\nto be put to death. And [51] [the king] visited severe misfortunes upon him.\\nThe enemies who were in the Thrace area, having looted the kingdom by means of quick engagements\\nconducted by a countless multitude of troops, [now] wanted to destroy the kingdom and people of the\\nlordship of the Romans, and to actually rule over the royal city itself. \\nChapter 8.\\nThe emper or's or der to assemble his Eastern for ces and those of Armenia to cr oss the sea and mass in\\nThrace, against the enemy . The selection of Mushegh as their commander . The victory , vanquishment, seizur e,\\nand killing of Mushegh.\\nThe Byzantine emperor gave a command to assemble all of his forces which were in the Eastern area, for it\\nwas peacetime and he had no dif ficulties with Syria, from the Iranian lordship. He ordered that all [the troops]\\nbe taken across the sea and assembled against the enemy in the Thracian area. He also commanded the entire\\ncavalry of Armenia, and the princes of the naxarar s who were skilled and able to resist and fight in a spear -\\nthrowing battle. Again [Maurice] ordered that very many troops be raised [52] from the land of Armenia a\\nsecond time, all of choice age and determination, [that they] be or ganized into decorated [g51] brigades,\\n[kazmel gunds zar ds] armed, and transported to the land of Thrace against the enemy . Mushegh Mamikonean\\nwas their commander . \\n \\nNow they went against the peoples who hold the area west of the great Danube river . A fierce battle took\\nplace in that country . The enemies' strength was shattered before the Byzantine forces, and they fled to the\\nother side of the river . With great victory they quickly dispatched to the emperor a messenger with the glad\\ntidings.\\nThen they went to an area below where they were, raiding. They crossed a narrow place, laying waste the\\nentire country . Coming opposite [to the Byzantine army], [the enemy] waged a great battle, striking at the\\nByzantines, destroying them with great slaughter and driving them in front of themselves, as fugitives. [But]\\nthe enemy had [53] seized a narrow pass before them and so put [the Byzantines] to the sword. [The\\nByzantines] were barely able to save their lives in the strongholds of the land of Thrace. [The enemy] had\\narrested Mushegh Mamikonean, bound him to a tall tree in the forest, and killed him. On that day a multitude\\nof the naxarar s and troops of Armenia were killed. \\n \\nYet another time did the emperor order other troops called up, telling them only \\\"Look out for yourselves.\\\"\"],\"start\":24,\"end\":25,\"length\":1},{\"chapter\":\"9\",\"pages\":[],\"start\":25,\"end\":25,\"length\":0},{\"chapter\":\"10\",\"pages\":[\"Chapter 9.\\nEmper or Maurice's or der to pr each the [acceptance of the] Council of Chalcedon in Armenia; the division of\\nthe patriar chal thr one.\\nOnce again the emperor issued an order , this time to preach [acceptance of] the Council of Chalcedon in all\\nchurches of the country of Armenia, and to celebrate communion with his troops. Now the cler gy of the\\nchurches of Armenia they treated as fugitives going to a foreign [g52] country . But many disregarded the\\norder and remained where they were, not budging. Many of the faithful, however , [54] out of the love of\\nambition, united [with the Byzantines] in communion. Then the kat'oghikos al Throne was divided into two\\nparts. One [of the kat'oghikoi ] was named Movses; the other , Yovhan. Movses was in the Iranian sector;\\nYovhan was in the Byzantine [sector]. \\n \\nYovhan communed with [the Byzantines] but Movses was in no way close to them. The vessels of the entire\\nChurch which had been at [the church of] saint Gregory in Dwin, were taken and placed in a repository in the\\ncity of Karin. But [Y ovhan] himself was later taken into captivity to Ahmatan shahastan  in the country of the\\nIranians. \\n \\nChapter 10.\\nAgain the emper or's command to assemble the Armenian cavalry . The tr oops of Sahak Mamikonean and\\nSmbat Bagratuni ar e taken. Smbat r eturns to Armenia. The Armenian naxarar s' plan. Smbat goes to the\\nemper or with seven men. [Smbat] falls into ar ena [combat]. Smbat's bravery ther e. His liberation, and exile\\nto Africa.\\nIn that period, once again a command issued from the emperor to seek and demand 2,000 select armed\\ncavalrymen from the land of Armenia, to entrust them to two faithful [commanders] and to dispatch them\\nwith all possible haste. \\n[55] So 2,000 armed men were selected and entrusted to two faithful men: 1,000 to Sahak Mamikonean, and\\n1,000 to Manuel's son, Smbat Bagratuni. But they did not go by the same road. Rather , they sent Sahak\\nMamikonean with 1,000 [men] by way of Sebastia; and Smbat Bagratuni with the other [1,000 soldiers] via\\nthe Xaghteats' area. Sahak took [his] troops to the palace, to the king's presence. \\n \\nSmbat, however , upon reaching Xaghtik', became his own man. For enroute the force became frightened and\\ndid not [g53] want to go [to Thrace] in compliance with the emperor's request. The emperor was informed\\nabout the events. By means of hrovartak s and trustworthy emissaries [the emperor] promised [Smbat] with an\\noath that he would send him back to his own country with great honor , and quickly . He promised the troops\\nvery great honors and goods, and thus did he coax them to a reconciliation. [Smbat's army] went united\\nbefore the emperor . The emperor armed the troops, decorated them, and sent them to the borders of Thrace.\\nHe sent Smbat back to their country with great honor and many goods.\"],\"start\":25,\"end\":26,\"length\":1},{\"chapter\":\"11\",\"pages\":[\"[56] Once again the remaining naxarar s of Armenia started to unite, seeking to stop serving the Byzantine\\nemperor . They also wanted to enthrone their own king so that they too not go to Thrace to die, but rather [they\\nplanned] to stay where they were and die upon their own soil. But there was disunity in their councils\\nregarding what they established. And some of them went as informers taking the story to the emperor's ears.\\nThen [the rebels] dispersed here and there eluding [the Byzantine forces].\\nIn that period imperial ambassadors arrived with edicts. They seized Smbat and seven other men and took\\nthem before the emperor . Investigating them in front of the multitudinous public, the verdict was passed that\\n[Smbat] be stripped and thrown into the arena. [Smbat] possessed a gigantic size; he was handsome, tall of\\nstature, broad-shouldered with a body as [hard] as a fist, or the ground. He then was [57] mighty and martial\\nand had displayed his bravery and force in numerous wars. Such was his strength that [once] when riding on a\\nlarge and powerful horse, passing through a dense forest of pines and [other] strong tress, Smbat seized a\\nbranch of the tree, ener getically wrapped his torso and legs around the horse's middle and lifted [the horse]\\nbodily from the ground. When all the troops saw this they were awestruck with wonder[g54].\\nSo they stripped [Smbat], dressed him in trousers and threw him into the arena to be eaten by the beasts. They\\nreleased a bear on him. As soon as the bear was opposite him, [Smbat] shouted in a great voice, attacked the\\nbear, punched its forehead with his fist and killed it on the spot. Second, they released a bull on him. [Smbat]\\nseized the bull by the horns, shouted powerfully and, [when] the bull wearied of the fight, [Smbat] wrenched\\nits neck and crushed both horns on [the bull's] head. The bull weakened, and drawing back, took to flight. But\\n[Smbat] ran after the bull and seized it by its tail and worked on the hoof of one of its legs. The hoof came of f\\nin his hand, and the bull fled from him, lacking a hoof on one leg. The third time, they released a lion on him.\\nWhen the lion was attacking him, [Smbat] was aided by the Lord, for [58] he seized the lion by the ear and\\njumped astride it. Seizing the throat, he choked and killed the lion. Then the clamor of the vast mob filled the\\nplace, and they sought the emperor's mercy on [Smbat]. \\nTired from the combat, [Smbat] sat on the dead lion to rest a little. The emperor's wife threw herself at [the\\nemperor's] feet, requesting mercy for him. For previously the man had been dear to the emperor and to his\\nwife and [the emperor] had styled him his adopted son. [The emperor] was astounded by the man's strength\\nand endurance; and when he heard the entreaties of his wife and all the palace, he ordered that [Smbat] be\\npardoned.\\nThen they took him to the bath for washing. They washed and clothed him, invited him to dine at court, and\\nrevived him with food. After a short time, not because of any evil will of the emperor , but from the slander of\\nenvious people, [the emperor] ordered [Smbat's men] placed on a boat and exiled to a distant island. And he\\nordered that [Smbat] be taken to Africa with them and made tribune of the troops there [g55]. \\n[59]\\nChapter 11.\\nThe summoning by king Xosr ov to Asor estan of those naxarar s whom the Hamarakar  had left. The stationing\\nof their tr oops at Spahan.\\nAs I mentioned above, in the Iranian sector were naxarar s and troops which the Hamarakar  had left there and\\ndeparted, pending an order from Court.\"],\"start\":26,\"end\":27,\"length\":1},{\"chapter\":\"12\",\"pages\":[\"At that time, peshaspik'  arrived with edicts, summoning them to court all together . The following are the\\nnaxarar s and troops which went united to the court of Xosrov , king of Iran, each [ naxarar ] with his brigades\\nand banner , in the sixth year of [Xosrov's] reign: \\nfirst, Gagik Mamikonean, Manuel's son, \\nsecond, Pap Bagratuni, son of aspet  Ashot, \\nthird, Xosrov , lord of the V ahewunik', \\nfourth, V ardan Artsruni, \\nfifth, Mamak Mamikonean \\nsixth, Step'annos Siwni, \\nseventh, Kotit, lord of the Amatunik' \\nand others of the naxarar s among them. They reached Asorestan where the royal house was, and went before\\nthe king. [The latter] received them with delight, exalting them [60] with noteworthy , lavish honors. He\\nordered the grandee princes to be kept at court, that court stipends be arranged for them, a dwelling place for\\neach, and that they be summoned daily to dine at court. [Xosrov] ordered that their troops be stationed in the\\nSpahan land, and he sustained them with af fection and all spontaneity [g56]. \\nChapter 12.\\nXosrov judges his uncle Vndo. The killing of Vndo. Vstam flees to war with Xosr ov, and he rules in the\\nParthian ar eas.\\nIn this period king Xosrov took it into his head to seek vengeance from those naxarar s who had slain his\\nfather . First he wanted to judge his mother's brothers. He gave the order to arrest that Vndo, about whom I\\nspoke earlier , to bind and kill him. However , [Vndo's] brother Vstam was not at court then. Although\\n[Xosrov] summoned him with entreaties and many persuasive words, so that [Vstam] would not find out\\nabout his brother's death, nonetheless, he learned about it somehow . Thus he did not fall into [Xosrov's]\\ndeception; rather , he went to the secure Gegham country as a rebel, and [61] subdued all of their troops to his\\ncommand.\\n[Vstam] went raiding in the area of Rey , looting all the many lands of the kingdom of Iran. Then king Xosrov\\ntook his troops and troops from the emperor , and went against him. The battle between them occurred in the\\nland of Rey , and no small feats of bravery were worked by the Armenian troops [ hayakoyt zawrats'n ]. When\\nthe king saw this, he was even more amazed.\\nAnd when the rebel was unable to resist, he secured himself in the mountains. Thus each side returned to its\\nplace, neither having triumphed. The rebel Vstam went to the secure Gegham country whence he went to the\\nParthian area, to his own native country of rule, so that the troops there submit to him [g57], then [he\\nplanned] to return.\\nThe king went to Asorestan reaching his own court residence. The naxarar s of Armenia were with him. \\n \\n[62]\"],\"start\":27,\"end\":28,\"length\":1},{\"chapter\":\"13\",\"pages\":[],\"start\":28,\"end\":28,\"length\":0},{\"chapter\":\"14\",\"pages\":[\"Chapter 13.\\nDeath of the Armenian princes, r ebellion of their tr oops at Spahan; the destruction of the country , seizur e of\\nthe tr easur e and going to Vstam.\\nAt that time death came to the princes of Armenia. Gagik Mamikonean and Xosrov , lord of the V ahewunik',\\ndied at court. Mamik Mamikonean, who had been released to Armenia for troops died a few days after\\nreaching the city of Dwin. Meanwhile, Step'annos Siwnik' was fighting for the tanuterut 'iwn with his father's\\nbrother , Sahak. Sahak wrote a document calling for [Step'annos'] death which he sealed with [his] ring and of\\nthe House of the bishop, and with the rings of yet other princes of Siwnik', to remind the king about the\\ndanger of their rebellion. Then the king gave the order to bind Step'annos and to put him in prison. They\\nbeheaded him on Easter day itself, in Easter week. [The king] sent Kotit to Nisibis as an emissary , but\\ncommanded cavalrymen to lie in ambush in the [63] field, and, like bandits, to attack and kill him on the road.\\nNow when their troops (which were stationed in the Spahan land) heard about these events, they rebelled and\\ndevastated the country . They took the court treasury , which was in the house of the hamarakar  [and] which\\nwas amassed from the taxes of that land. T aking the road, they went to the secure Gegham country . The\\nperozakan  troops caught up with them. Some of them were killed by [the rebels'] swords [g58], some fell\\nupon their own swords to avoid being captured. Some, escaping by a hairbreadth, got away to the secure\\nGegham country . But since [the rebels] did not encounter Vstam, they left for the country of the Parthians,\\nand presented themselves before him. \\n \\nChapter 14.\\nXosrov gives Smbat Bagratuni the marzpan ate of V rkan [Hyr cania] and gr eatly exalted him. Smbat impr oves\\nthe land of Hyr cania thr ough spiritual and political education.\\nIn that period Smbat Bagratuni became pleasing to king Xosrov's eyes. [Xosrov] gave him the marzpan ate of\\nthe country of Hyrcania; made him prince over all of those areas besides; exalted him yet more with honors\\nand authority; loaded him with gold and silver; adorned him in gor geous robes of honor; gave him the belt\\nand sword which had belonged to his father , Ormazd; assembled [64] under his authority the Iranian and\\nArmenian troops and ordered him to go to the country of his appointment. \\n \\nAt that time there were some countries which had rebelled from the king of Iran, namely , Amagh, Rhoyean,\\nJrechan and T aparastan. [Smbat] defeated them in battle, striking with the sword, and putting them in the\\nservice of the Iranian king. He built up the entire country of his marzpan ate, for it was in ruins. In that land\\nwere a people who had been captured from the country of Armenia and settled at the edge of the great desert\\nwhich is in the [g59] area of T urk'astan and Delhastan. They had for gotten their own language, learning had\\nweakened and the order of the priesthood had become reduced. There were also Kodreats' people there, who\\nhad been captured along with our own men. And there were not a few there from [lands subject to] Byzantine\\nauthority and from the Syrian area.\\nThe Kodreats' people were not believers but a great light dawned on the Christians. They became confirmed\\nin the faith, studied learning and language, and established [65] in the order of priesthood of that land a\\ncertain elder from among them named Abel.\"],\"start\":28,\"end\":29,\"length\":1},{\"chapter\":\"15\",\"pages\":[],\"start\":29,\"end\":29,\"length\":0},{\"chapter\":\"16\",\"pages\":[\"Chapter 15.\\nVstam comes to Asor estan to kill Xosr ov and take the kingdom. His death fr om the tr eachery of Pariovk, king\\nof the Kushans. The small battle in the land of Hyr cania.\\nIn that period Vstam subjected to himself two kings of the Kushans, Shawg and Pariovk. He gathered all the\\ntroops in the East and went to Asorestan with a lar ge and very powerful army , to kill Xosrov and take his\\nkingdom for himself. [Vstam's] troops were at a distance from him, on the right and left, while the Kushan\\nking Pariovk was [to provide] assistance from behind him. But then the deceitful king of the Kushans got the\\nidea of going before [Vstam] with a few men, where he dismounted the horse and bowed to the ground seven\\ntimes. Motioning him forward, Vstam ordered him to mount again. [But Pariovk] had placed an ambush for\\nhim on the road. Pariovk said: \\\"Order the multitude to leave you, for I would have secret words with the\\nking.\\\" [However], not sensing [Pariovk's] treachery , [66][Vstam] ordered the people to depart. As [the two of\\nthem] were going along the way , talking, suddenly the ambushers sprung out of their place of concealment,\\nand attacked and killed Vstam. Pariovk had stipulated the time with his troops, and he now quickly notified\\nthem. [The troops] came up and captured Vstam's wife, all his bags and baggage, and then turned quickly and\\ndeparted.\\nAfter some days had passed, all of the troops were informed, and they split away from each other , being as it\\nwere, abandoned, each one going to his own place. The troops of Geghum which were with [Vstam],\\nsimilarly , departed and quickly reached the strongholds of their own land. And those Armenian men who had\\nrebelled from Smbat [or: had rebelled in Ispahan] and gone over to Vstam, were among them. They went to\\nthe country called Komsh which is on the other side of the mountain which separates it from Hyrcania, and\\nreached the village named Xekewand.\\nShahr V ahrich and Smbat, marzpan  of Gur gan, went against them with many troops. The Geghumk' troops\\nwere not more than 2,000 men. There was a battle in that country . They struck at the Iranian troops, put them\\nto flight, killed many , arrested many , then turned back, encamping [67] near the battlefield. Those men from\\nArmenia were with them. Many of the [Iranian] troops and the Armenians who were with marzpan  Smbat\\ndied [g61]. \\n \\nChapter 16.\\nDiscovery of a fragment of the Cr oss.\\nThree months prior to this battle, a vision appeared to a certain man named Y ovsep'. He said: \\\"A man with a\\nwondrous appearance came and said to me, 'A battle will occurr in three months in which many people will\\ndie. Go to the site of the battle, and let this be a sign for you. For you will see a man lying on the ground\\nwhose body glitters among all the corpses. T ake whatever you find on him, and take care not to for get, for\\nhe/it is a miraculous thing.'\\\" [Y ovsep'] arose and departed. When he reached the place, he found things as they\\nhad been related to him in the vision for [the man] and all the corpses had been stripped, and [the man] had a\\nchestnut-colored fur [or: a leather bag ( shagoyr mashkeghen )] around his shoulders; his body was among the\"],\"start\":29,\"end\":30,\"length\":1},{\"chapter\":\"17\",\"pages\":[\"corpses. [Y ovsep'] took the fur and discovered that it contained a silver box with a cross in it fashioned from a\\nlarge fragment of the Lord's Cross. He made the sign of the Cross [68] over himself with this, took it and\\nwent after his comrades.\\nAll the troops left that place and went to the strongholds of their land. Then the king requested that V ahrich\\ngo home, and he sent great thanks to Smbat for he fought sincerely and was beaten and did not leave the\\nplace. He fled only after everyone else had fled [g62]. \\nChapter 17.\\nSmbat fights with the enemy and triumphs. He is mor e honor ed with estimable gifts and honors than all the\\nother marzpan s. Smbat's son, named V araztir ots', is appointed to the office of the king's cupbear er.\\nConstruction of the chur ch of saint Gr egory . Enthr onement of the kat'oghikos .\\nThe next year , all the brigades of the enemy assembled and went to the district of T aparastan. Smbat too\\nmassed all his troops and went against them in war . And the lord God betrayed the troops of the enemies into\\nSmbat's hands and killed them all with the sword. Those who survived went as fugitives to their own place.\\nNow those who were with them requested an oath and conditions and came before Smbat. That Y ovsep' was\\namong them, and related the vision and the many signs which [God] had worked among the barbarians.\\nYovsep' had his find with him. Then Smbat arose and kneeled [69] before him, took [the fragment of the\\nCross], made the sign of the Cross, and then gave it to a certain prominent man named Mihru from the\\nDimak'sean House whom [Smbat] had put in char ge of his House as a loyal man and executor [of his orders].\\nHe gave it to the church which priests kept at his court.\\nThen the king sent a hrovartak  expressing great satisfaction [with Smbat], and exalting him with honor , above\\nall of the other marzpan s in his lordship. He sent him cups of gold, royal clothing, and golden diadems set\\nwith precious stones and pearls. [Smbat's] son, whose name was V araztirots', had been raised [by Xosrov] as\\nthough he were one of his own sons, elevated over all at court, and appointed to the of fice of cup-bearer ,\\nserving wine to the king.\\nSmbat held the marzpan ate of that land for eight years. Then a command came to summon him with great\\nexaltation to [g63] the royal court, and [the king] ordered him to go and see his own country in the 18th year\\nof [Xosrov's] reign.\\nNow [Smbat] requested a command from the king [permitting him] to build the church of saint Gregory ,\\nwhich was in the city of Dwin. Because the blessed kat'oghikos  Movses had died, [70] and no vardapet  was\\nthere, [Smbat] hurried even more to request the king's order . When the order reached his country , [Smbat]\\nconcerned himself with the great [ kat'oghikos al] throne so that they set up an overseer , a caretaker of the\\nchurch, and a director of its salvation. They seated Abraham, bishop of the Rshtunik' on the patriarchal\\nthrone. Then they commenced laying the foundation of the church. [Smbat] assembled architects [skilled in\\nworking] stone, appointed trustworthy of ficials over them, and ordered that the work be brought to a speedy\\nconclusion. The overseer of the fortress and [Armenia's] marzpan  wrote a complaint to the king, saying: \\\"\\n[The church] is too close to the fortress and [will be] damaged by enemies.\\\"\\nThe king's reply arrived, saying: \\\"Pull down the fortress and build the church in that same spot.\\\" Amen.\"],\"start\":30,\"end\":31,\"length\":1},{\"chapter\":\"18\",\"pages\":[\"Chapter 18.\\nSmbat is summoned to the Iranian court and r eceives the honor of the lor dship ( tanuterut'iwn ) [and of being]\\ncalled Xosr ov Shum. He persecutes the Kushans. The killing of Datoyean. Once mor e Smbat and the\\nArmenian naxarar s go against the Kushans and Hepthalites. A certain wr estling match. Smbat triumphs and\\ngoes to the court with gr eat glory .\\n[71] When winter had passed and spring arrived, messengers came [to Smbat] with hrovartak s summoning\\nhim to the royal court with great pomp. [Smbat] went before the king at the dastakert  called \\\"the great\\ndastakert .\\\" Leaving the hall, he resided [ nsti] in Bob and in Bahghak [g64].\\nThen the king gave him the tanuterut 'iwn known as Xosrov Shum. He adorned him with gor geous clothing, in\\na hat and muslin robes embellished with gold; he exalted [him] with unbelievable honors, a bejewelled camp,\\ntroops, and silver thrones, and gave him char ge of the lesser diwan  of the land. He gave him four -toned\\ntrumpets and guards for his court selected from the soldiers at court. He assembled under [Smbat] an\\nenormous force in the eastern country of the Kushans; and he ordered [Smbat] to make whomever he wanted\\nthe marzpan .\\nNow [Smbat] departed and reached the nearby country of his first rule, Komsh. He summoned the troops of\\nhis own [72] countrymen from Hyrcania, and then went directly to the East.\\nHere are [the names of] the princes of the Armenian naxarar s who were with [Smbat], each with brigade and\\nbanner:\\nVarazshapuh Artsruni \\nSargis T ayets'i \\nArtawazd, Vstam, and Hmayeak Apahuni \\nManuel, lord of the Apahunik' \\nVrham, lord of Goght'n [V rham Goght'neats' ter] \\nSargis Dimak'sean \\nSargis T rpatuni\\nand other naxarar s. And he had some 2,000 cavalrymen from the land [of Armenia (?)]. [Smbat] saw that the\\nKushans' forces had spread across the entire country , raiding. But as soon as they heard about his reputation,\\nthey assembled and departed. [Smbat] went after them and quickly caught up. Now as soon as they observed\\nthat he was upon them, they turned and fought, clashing with each other in battle. The forces of the Kushans\\ntook to flight and were routed by the forces of Xosrov Shum. Many of them died, while many fled. Then\\n[Smbat] again camped at Apr Shahr and in the district of T os. He himself with 300 men stayed in the town\\ncalled Xrhoxt [g65].\\n[73] Then the kings of the Kushans requested aid from the great Khaqan/Qaqan (Xak'an), king of the northern\\nparts. A mob of 300,000 came to their aid. [This force] crossed the V ehrhot river which arises from the\\nEwighat country , T'urk'astan [crossing] Dionos ep'esteays [Abgaryan, p. 102, has emended this to yerkr e\\nEwighata y, zGimnosp 'esteays ...\\\"the Gymnosophists\\\"] Shamn and Bramn and flows to India. [The force]\\nsettled on the banks of the river , and spread out, raiding, to the west. Unexpectedly , they reached and besieged\\nthe town, for the village had a bulwark of fortification around it.\"],\"start\":31,\"end\":32,\"length\":1},{\"chapter\":\"19\",\"pages\":[\"Smbat gave an order to the 300 men to fall upon the fortress which was in the town. He himself mounted,\\ntaking along the following three men: Sar gis Dimak'sean, Sar gis T rpatuni, and a certain arms-bearing\\nmounted villager named Smbatik. Suddenly coming upon its entrance, they crushed the might of the mob and\\ndeparted. The 300 men who were about the fortress in the town went against [his] troops. And the\\ncommander of his troops was a certain Iranian prince named Datoyean, by the king's order .\\nNow despite the fact that Smbat (who is Xosrov Shumn) sent to him, telling him to evade them, [Datoyean]\\ndid not want to listen; rather , he went against them in battle. They struck at the Iranian troops, putting\\nDatoyean to flight, and then [74] spread out, raiding as far as the borders of Rey and the district of Aspahan.\\nAfter devastating the entire country , they turned back to their army; and a command came from the great\\nKhaqan/Qaqan (Xak'an) to Chembux to recross the river and to return home. Now a certain principal naxarar\\nnamed Shahrapan Bandakan arrived from the court to investigate Smbat and Datoyean. All the surviving\\ntroops vindicated Smbat; but Datoyean was taken in shackles to the court and was killed by the king. Then\\nSmbat assembled troops and again armed [them] and called up many other troops [g66] to aid him, after\\nwhich he went against the Kushan people and the king of the Hepthalites. [The latter] with great preparation\\narose and went against him. They reached the place of battle and massed against each other . The king of the\\nKushans sent a message to Smbat, saying: \\\"What good is it going into battle with such a tumultuous mob,\\nexhausting our forces. How shall our bravery be fathomed? But come, let you and I fight alone and compete,\\nand today my bravery will be revealed to you.\\\" And he thumped himself with his hand and said: \\\"Behold I am\\nready to die.\\\" W ith great speed the two prepared to attack, and approached each other . In the midst of the two\\narmies [75] they battled each other . But they were unable to defeat each other quickly , for both were failing in\\nstrength, and heavily armed. But then aid came from On High. Smbat's spear pierced the vertewamut  bahlik\\n[?] and the security of the Kushan king's armor , and because [Smbat] struck him forcefully , he fell to the\\nground, dead. As soon as [the Kushan king's] forces saw [what had happened to] their king, they were\\nhorrified and turned to flight. [Smbat's troops] pursued them, raiding as far as Bahl shahastan  of the Kushans,\\nlooting the entire country: Harew , Vaghages, all T oxorostayn and T aghakan. They also took numerous\\nfortresses which they pulled down, and then returned in great triumph, with much booty . They went and\\nencamped in Mar g and in the district of Mar grhot.\\nMessengers bearing the glad tidings quickly reached king Xosrov relating in full the bravery [displayed by\\nSmbat]. King Xosrov rejoiced with exceeding delight. He ordered that a huge elephant be adorned and\\nbrought to the chamber . He commanded that [Smbat's son] V araztirots' (who was called Javitean Xosrov by\\nthe king) [g67], be seated atop [the elephant]. And he ordered treasures scattered on the crowd. He wrote [to\\nSmbat] a hrovartak  [expressing] great satisfaction and summoned him to court with great honor and pomp. \\n[76]\\nChapter 19.\\nSmbat dies peacefully . The Armenian naxarar s rebel fr om the Iranians and go to serve the king of the north,\\nthe Khaqan/Qaqan (Xak'an).\\nWhen [Smbat] was about one day's journey from the royal court, the king commanded all the naxarar s and\\nhis forces to go before him. He ordered his aides to take before [Smbat] a steed from the court stable decked\\nout in royal trappings. [Smbat] went into the king's presence with great splendor and glory .\"],\"start\":32,\"end\":33,\"length\":1},{\"chapter\":\"20\",\"pages\":[\"Now when [the king] saw him, he received him with joy , extending his hand which [Smbat] kissed,\\nprostrating himself. Then the king said to him: \\\"Y ou served loyally , and we are even more satisfied with you.\\nFrom now on, do not tire yourself by going to battle. Rather , stay close by . Take, eat, and drink, and partake\\nof our joy .\\\" [Smbat] was the third naxarar  in the palace of king Xosrov . But after a short while [Smbat] died\\nin the 28th year of [Xosrov's] reign [618-19]. His body was taken to the country of Armenia, to his native\\nplace of rest, and they placed it in a tomb in the village of Dariwnk' which is in the district of Gogovit.\\n[77] Then [the naxarar s] rebelled and went into the service of the king of the northern regions, the great\\nKhaqan/Qaqan, by means of Chepetx of the House of Chen [The text may be defective here, and the\\ntranslation of this sentence is tentative. The sentence lacks a subject.]. Then they went from east to west via\\nthe northern regions [g68] to join with the forces of that Chepetx, by order of their king the Khaqan/Qaqan.\\nGoing through the Choray gate with a multitude of troops they went to give aid to the Byzantine emperor . \\nChapter 20.\\nThe r ebellion of the gr eat patrician Atat Xotxor huni, and his death. The Iranian and Byzantine bor derlor ds.\\nNow what shall I say about another rebellion, that of Atat Xorhxorhuni? He was a great patrician, as a result\\nof which the emperor ordered him summoned to the palace. He went to him accompanied by 17 men. [The\\nemperor] exalted and glorified him and those with him by a fitting and attractive reception, and gave him gold\\nand silver vessels and an extremely lar ge amount of treasure.\\n[The emperor] ordered him to go to his forces in Thrace. T aking leave of the emperor [Atat] departed. While\\ntraveling [78] along the road he had the idea of rebelling and going over to the Iranian king. Departing from\\nthe road he went to the seashore where he encountered a boat. He said to the boatsmen: \\\"T ake me across to\\nthe other side, for I have been sent on important work by the emperor .\\\" After cajoling the boatsmen, they took\\nhim across. In a great hurry he quickly reached the country of Armenia. No one knew of his route until he\\nwas quite a distance from the shore. But then somehow they learned of his departure. T roops from city to city\\nwent against him but were unable to resist. Enroute [Atat] battled eighteen times and was the victor in every\\ninstance. Nonetheless, his forces were depleted. He went in haste and reached Naxchawan. The Iranians\\nreceived him and he secured himself into the [g69] fortress.\\nKing Xosrov was informed about what had happened and sent against [the Byzantines] Parsayenpet with\\ntroops. As soon as the force approached, [the Byzantines] left the city and departed. [Atat] quickly went to the\\nIranian king who received him af fectionately , exalting him with honors, giving him treasures, and\\ncommanding that he be given a stipend from the court treasury .\\n[79] One year later Maurice died and Phocas ruled [602-10]. [Atat] planned to rebell and go to the Byzantine\\nemperor . He began to prepare horses and to ready armaments and attract rascals to himself. News of this\\nreached the king's ears. He ordered [Atat] to be bound hand and foot and beaten to death with clubs.\\nThese are [the names of] the borderlords in the country of Armenia and the city of Dwin [in that sector of the\\ncountry under] the lordship of Iran in the years of that peace:\\nVndatakan Nixawrakan. The Iranian troops killed him at Dwin and themselves went as rebels to Geghum. \\nMerkut \\nYazden\"],\"start\":33,\"end\":34,\"length\":1},{\"chapter\":\"21\",\"pages\":[\"Butmah \\nYeman \\nNow in the Byzantine sector [the borderlords were]:\\nYovhan the Patrician, \\nHeraclius \\ngeneral Suren \\nuntil thirteen years of peace had elapsed.\\nThen the emperor issued an order [which said]: \\\"Thirty thousand cavalrymen are my levy for the land of [80]\\nArmenia. Let thirty thousand families be assembled for me there and settled in the land of Thrace.\\\" He\\ndispatched Priskos to Armenia to see to this matter . But when he arrived, news of a great disturbance reached\\nhim, and Priskos arose and departed with incredible haste [g70]. \\nChapter 21.\\nThe killing of emper or Maurice and the r eign of Phocas. The r ebellion of general Erakghes (Heraclius) of\\nAlexandria and general Nerses of Syrian Mesopotamia. Ur ha (Edessa) is besieged by the Byzantines and the\\ncity of Dara [is besieged] by Xosr ov. Troops ar e muster ed from [the Iranian sector of] Armenia and prince\\nJuan V eh is made their commander . He comes to Edessa and takes T'eodos. The destruction of Dara. The\\nByzantines take Edessa; general Nerses is killed.\\nIn the 14th year of king Xosrov and in the 20th year of Maurice's reign, the Byzantine army which was in\\nThrace rebelled from the emperor and enthroned as their king a certain man named Phocas. Going together to\\nConstantinople, they killed the emperor Maurice and his son and seated Phocas on the throne of the kingdom.\\nThen they themselves went to the Thracian area to oppose the enemy . Now the empeor Maurice had a son\\nnamed Theodosius, and a rumor spread throughout the entire country that Theodosius had escaped and gone\\nto the Iranian king. Thus there was no small agitation in the lordship [81] of the Romans, in the capital city , in\\nthe city of Alexandria in Egypt, in Jerusalem and Antioch and in all parts of the country , [people] took up the\\nsword and killed one another .\\nEmperor Phocas ordered all the rebels who wavered [in their loyalty] to his rule to be killed. Many were slain\\nthere in the capital. He dispatched a certain prince Bonos with troops against Antioch, Jerusalem, and all parts\\nof the land. He went and struck Antioch and Jerusalem and indeed the entire multitude of cities in that\\ncountry were consumed by the sword [g71].\\nThen the general Heraclius who was in the Alexandria area rebelled from Phocas along with his own troops.\\nHe forcibly detached the country of Egypt [from Byzantine control]. In Syrian Mesopotamia general Nerses\\nalso rebelled. T ogether with his troops he entered and took the city of Edessa. [But a Byzantine] force came\\nagainst him and besieged the city and [Nerses'] troops.\\nWhen king Xosrov heard about this, he assembled the entire multitude of his troops, went to the W est,\\nreached the city of Dara which he invested and besieged and started battling with. In the regions of Armenia,\"],\"start\":34,\"end\":35,\"length\":1},{\"chapter\":\"22\",\"pages\":[\"troops were assembled, a certain [82] great prince, Juan V eh, being their commander . Then king Xosrov\\ndivided [his forces] into two parts: one part he left around the city; with the other he himself went against\\nthose forces which were besieging Edessa. He came upon them at dawn, unexpectedly . Some were slain by\\nthe sword; some took to flight; some (who had gone into the Euphrates river for security) died there; some\\nwere pursued. King Xosrov approached the city gate, so that they would open it and so that he might enter .\\nNow Nerses dressed a youth in royal garb, placed a crown on his head and sent him [to Xosrov], saying:\\n\\\"This is Theodosius, emperor Maurice's son. Have mercy upon him, just as his father had mercy on you.\\\"\\nKing Xosrov received him with great delight, departed, and went to the city of Dara. He kept [Theodosius]\\nwith him in royal honor . [Xosrov] besieged Dara for one and a half years. He dug beneath the city walls,\\ndemolished the wall, and took the city , putting everyone to the sword. He looted the city [g72], then went to\\nCtesiphon, since his troops were worn and wasted from battle. But another force from Byzantium came upon\\nEdessa, fought with and took the city . They seized and killed Nerses, and shed blood there. \\n[83]\\nChapter 22.\\nThe Iranians and Byzantines battle in the plain of Shirak, and the Byzantines ar e defeated. Another battle\\ntakes place in T saghkotn. The Byzantines ar e defeated, T'eodos Xorxor huni surr enders, giving the fortr ess to\\nthe Iranians. [T'eodos Xorxor huni's] death.\\nNow Juan V eh, who had been dispatched to the Armenian area with his troops, reached the city of Dwin in\\nAyrarat district in wintertime. He stopped there, resting his forces until spring came.\\nMeanwhile the Byzantine troops were assembled in the town of Eghevard. The Iranian troops came against\\nthem and a battle took place in the plain of Eghevard in which [the Byzantines] struck at the Iranians and\\nseverely defeated them. The general [Juan V eh] was slain in the fight while the survivors fled, pursued. [The\\nByzantines] looted the Iranian army and then returned to their camp on the riverbank called Horhomots'\\n[Romans'] meadow .\\nThe next year [in 602/603], while king Xosrov battled with the city of Dara, another Iranian force was\\nassembled in Armenia under the command of Datoyean. The Byzantine army assembled in the plain of\\nShirak, in the village named Shirakawan. They located there and stayed some days embroiled in internecine\\n[84] strife, terrified of an attack by the foreign enemy . The Iranian troops came upon them, roaring like lions.\\nNow [the Byzantines] abandoned their campsite and crossed the river to the plain called Akank', pursued by\\nthe Iranian troops which caught up with them. The battle took place in the village named Getik. As the two\\nsides were approaching each other to fight, the inhabitants of the district had gathered in Er gina fortress. A\\nmultitude of youths streamed out of there armed with scythes and swords, and fell on the army's rear causing\\ngreat slaughter , leaving wounded men, and taking loot and booty , returned to their fortress.\\nWhen the two armies met in battle, [the Iranians] put the Byzantine forces to flight before them. Pursuing\\nthem, they killed many men, filling the plains and roads with corpses. V ery few survivors managed to flee.\\n[The Iranians] took the loot and returned to their army . When they observed the evil that had been wrought,\\nthey attacked the fortress in a mob and took it. Many they killed with the sword, many out of fright hurled\\nthemselves from the precipice; some fled through the gate which faced the river , while all the rest were taken\"],\"start\":35,\"end\":36,\"length\":1},{\"chapter\":\"23\",\"pages\":[\"into slavery . On that day 33 villages around the fortress [85] were similarly enslaved. [When the Iranians] had\\ngathered up all the loot of the district, the troops turned and went to Atrpatakan.\\nThen Senitam Xosrov arrived. The Byzantine army was settled in T saghkotn close to the village called\\nAngegh which the Aratsani river flows through, and on the other side they had pulled apart the village and\\ndrawn its fortification around themselves. Their commander was T'eodos Xorhxorhuni. The Iranian troops\\ncame and encamped near them, to their rear . At first, terrified, [the Byzantines] spoke of peace with them,\\nrecommending that they not fight and instead they would leave them the fortress and depart peacefully . But as\\nthey were united, the matter went no further . Rather , confident of their fortification, they thought they might\\naccomplish something. The next morning the Iranian troops went against them. None [of the Byzantines] had\\narmed himself or saddled his horse. If anyone did so, the retainers/children of the princes [ mankunk'\\nishxanats'n ] ran over [g74] and disarmed the men, tormenting them severely and slashing the horses' saddles\\nwith their swords. \\nThe Iranian troops came and faced them from the plain area. They released a multitude of bowmen who\\nemptied their [86] quivers shooting at them and piercing all the men and horses with their arrows. The horses,\\nwhich were tied to mangers at the entrances to the tents, became frightened and trampled on all the tents and\\narmy . The enemy broke through the fortification and fell upon the army causing incredible destruction. [The\\nByzantines] broke through at one spot, some on foot, others mounted on the kicking horses, and fled. T'eodos\\nXorhxorhuni fortified himself in the fortress, while that evening [the Iranians] settled into [the Byzantines']\\ncampsite. The next morning [the Iranians] dispatched a messenger telling them to quit the fortress and depart\\nwith all their baggage and equipment. They agreed to do so. On the third day [the Byzantines] opened the city\\ngates and all departed as had been agreed. But the Iranian commander summoned T'eodos Xorhxorhuni and\\ntold him: \\\"I do not have the authority to release you without a royal command. Rather [I must] have you taken\\nto court. I shall write to the king all the good things about you, how you labored so sincerely and loyally to\\nbetray [the Byzantine] troops into our hands; how you came into [Iranian] service willingly .\\\" And he did\\nwrite such things and had him taken to court. King Xosrov received [T'eodos] af fectionately , arranging a\\nstipend and money for clothing for him from the treasury . Subsequently , however , as there was a suspicion of\\ntreachery about him, he [87] ordered him killed. Now the fortress-keeper residing at Angegh fortress\\nassembled his troops and went in person deeper into the countryside which he subjugated [g75].\\nAfter this there was another battle in the Basen area. [The Iranian commander] struck at and chased the\\nByzantines who fled back to their own country . He took the cities of Angegh, Gaylatus, Er gina, and the city\\nof Tsxmkert in Dara. Receiving a command from the king, he departed. \\nChapter 23.\\nXosrov sends a lar ge for ce to Asor estan under the command of Er hazman Xor heam, and [another army] to\\nArmenia under Ashtat Y eztayar accompanied by the emper or Theodosius. Er hazman Xor heam subdues all of\\nMesopotamia. Ashtat wars with the Byzantines and subjugates the district of Karin. Shahen battles with the\\nByzantines and is victorious. The inhabitants of Karin ar e deported to Ahmatan Shahastan. Death(s) of the\\nKat'oghikoi . Shahen takes Caesar ea, and V asak Artsruni is killed.\\nKing Xosrov left Dara and again released his troops. Once more he called up another multitude of soldiers,\\ndispatching a lar ge and extremely powerful army to the Asorestan area commanded by Xorheam, called\"],\"start\":36,\"end\":37,\"length\":1},{\"chapter\":\"24\",\"pages\":[\"Erhazman. [Xosrov] commanded them as follows: \\\"Whomever comes into [my] service, receive [88] with\\naffection and keep in peace and prosperity; but kill with the sword whomever resists and makes war .\\\" He sent\\nAshtat Y eztayar with a lar ge army (including emperor Theodosius, called Maurice's son) to Armenia.\\nXorheam took a multitude of soldiers and went to Asorestan, reaching Syrian Mesopotamia where he\\nbesieged and battled with the city of Edessa. Because of the multitude of the troops and the success of [the\\nIranian] battles, and because [the besieged] had no hope of salvation from any quarter , [the Edessans] spoke\\nof peace requesting an oath so that [the Iranians] would not ruin the city . They opened the city gates and\\nsubmitted. Similarly Amida, T'ela [g76], Resaina (Rhashayenay) and all the cities of Syrian Mesopotamia\\nvoluntarily submitted and were kept in peace and prosperity . [The Iranian troops then] went to the city of\\nAntioch which also submitted voluntarily together with all the surrounding] cities and their inhabitants,\\nescaping from the sword of Phocas.\\nNow Ashtat Y eztayar came to the borders of Armenia in the 18th year of the reign. The Byzantine army was\\nassembled in the district of Basen and again frightfully attacked him. A great battle took place in Du and\\nOrdru. The Byzantine army struck and was defeated with great destruction. Many men died in the battle, and\\nthere was no counting the number of corpses on the plain. [Ashtat] pursued them as [89] far as the city of\\nSatala and then he himself encamped around the city of Karin with which he began to fight. [The inhabitants]\\nresisted somewhat from within causing no small casualties to those outside. But then the emperor Theodosius\\ncame forward and said [to the inhabitants]: \\\"I am your king,\\\" whereupon they consented and opened [the\\ngates]. The principal men of the city emer ged and were presented to him, then returned to the city and\\nconvinced them that he was indeed Maurice's son, Theodosius. After this [the inhabitants] opened the gates\\nand submitted. [Ashtat] set up guards there and then went and captured the city of Hashteank', Dzit'arhich,\\nand Satala, Arhistia and Nicopolis, and then departed. Then Shahen the Patgosapan  arrived, passed by the\\ncity of Karin, and Shahrayeanapet came to Dwin, ostan  of the marzpan ate. Now Shahen went and\\nencountered the Byzantine troops in the district of Karin. Engaging in battle, he struck them with the sword,\\nputting them to flight and chasing them from the land.\\nNow in the 21st year of his reign [A.D. 61 1] king Xosrov ordered [Shahen] to move the inhabitants of the city\\nof Karin and settle them in Ahmatean shahastan . The venerable aged kat'oghikos  was among those led into\\ncaptivity , together with all the Church vessels. He died there. His body was brought [g77] [back to Armenia]\\nto the village of A wan and the church which [90] he himself had built. That same year the venerable\\nkat'oghikos  Abraham died. He was succeeded on the patriarchal throne by Kumitas, bishop of T aron who was\\nfrom the village of Aghts' awan . During his tenure the construction of the church of saint Gregory was\\ncompleted.\\nIn the 20th year of king Xosrov [610], Shahen raided through the western areas, going to Cappadocian\\nCaesarea. Now while the Christian inhabitants of the city arose and departed, the Jews went before [Shahen]\\nand submitted. He remained in that city for one year . [The Iranians] seized V asak Artsruni, son of Sahak\\nnahapet  of the Artsrunids, and crucified him opposite the city gate. Despite the fact that he had wrought much\\ncarnage among the Iranian troops, nonetheless, all the Iranian troops mourned him because of his bravery and\\nmanliness and because he was a powerful and tall youth. [They mourned] especially because he had been\\nnourished and trained among them. That is what became of him. \\n[91] \\nChapter 24.\\nHeraclius goes to Asor estan to fight against the Iranians. The gr eat battle near the city of Antioch in which\",\"the Byzantines wer e defeated. The country of Palestine submits to the Iranians. An Iranian ostikan  takes up\\nresidence in Jerusalem. His mur der. The gr eat destruction of Jerusalem by the Iranians by swor d and fir e. The\\nholy Cr oss is captur ed.\\nIn that period, in the 22nd year of the reign of Xosrov [612], Heraclius gathered the troops in the area of\\nEgypt, went by sea to Constantinople, killed the emperor Phocas and seated his son Heraclius on the throne of\\nthe kingdom, and pacified the entire country [g78].\\nNow as soon as Heraclius ruled [Heraclius I, 610-41], he dispatched messengers with great treasures and\\nedicts to king Xosrov , requesting peace with great entreaties. King Xosrov , however , did not want to listen.\\nHe said: \\\"That kingdom belongs to me, and I shall enthrone Maurice's son, Theodosius, as emperor . [As for\\nHeraclius], he went and took the rule without our order and now of fers us our own treasure as gifts. But I\\nshall not stop until I have him in my hands.\\\" T aking the treasure, [Xosrov] commanded that his envoys be\\nkilled and he did not respond to his message.\\nThen Heraclius gathered his troops and encamped around the city [of Caesarea], obstructing their expeditions.\\nAfter assembling troops under the direction of a certain Curator , [Heraclius] ordered [them] to be watchful,\\nand then returned to his own place.\\nThey besieged the city of Caesarea for one year and the Iranian troops were placed into straits regarding\\nvictuals, [92] nor was there hay for the multitude of horses. When warm summer days arrived and the area\\nbecame filled with green plants, [the Iranians] set fire to the city and forcibly departed, striking at the\\nByzantines and pursuing them from behind. The Iranian troops then went to the land of Armenia, where they\\nwintered.\\nThe Iranian king quickly summoned Shahen to court and ordered him to return to the west in haste. T aking\\nhis troops in summertime, [Shahen] reached the city of Karin. He went against Melitene, took and subdued it.\\nThen he went and united with the army of Xorheam which was in the Pisidia area and at the Ostan  of Dwin.\\nParseanpet Parshenazdat came and replaced Shahrayenapet; he was succeeded by Namgar Shonazp [or:\\nNamdar Vshnasp], then by Shahrapghan. This latter fought a battle in Pars and was victorious [g79]. Then\\ncame Chrhoch V ehan [Abgaryan, p. 282 n. 378 emends this name to Erhoch V ehan.] He followed emperor\\nHeraclius through Armenia as far as the borders of Asorestan. The battle occurred at Nineveh, in which he\\nand all of his troops fell.\\nNow emperor Heraclius summoned a certain priest P'ilipikos to military service. This P'ilipikos was the son-\\nin-law of emperor Maurice and had been in the military for a long time, [93] triumphing in battle. But then,\\nduring Maurice's reign, he took it into his head to cut his hair and to wear priestly garb, becoming a soldier in\\nthe covenant of the Church. Heraclius forcibly made him a general and dispatched him to the East with a\\nlarge army . Going by way of Cappadocian Caesarea, he reached the A yrarat district in the country of Armenia\\nand encamped in the plain of the city of V agharshapat. An ur gent order from the [Iranian] king, entrusted to\\nswift, fleet-footed messengers arrived [at the camp of the Iranian general in the vicinity]. W ith great peril [the\\ngeneral] forced his troops to pursue them and wipe them out without a trace. W ith great ur gency [the Iranian\\ntroops] reached the district of A yrarat and encamped on the bank of the Arax [river] wanting to engage in\\nbattle the next day . However , that very night P'ilippos went against them in Nig district, surrounding them\\nfrom the rear of mount Aragats. [Then] he crossed through Shirak and V anand close to the city of Karin, and\\narrived at his own borders.\\nNow because the Iranian troops were tired from such a long and dangerous journey during which many of the\\nmen and horses had died along the way , and since, therefore, [many] were on foot, they were unable to\\nquickly pursue [the Byzantines]. [94] Rather , they stopped for a few days and then proceeded at a relaxed\",\"pace passing into Asorestan. They encamped there in the same place they had been previously , expanding\\nboth to their rlght and left. And they ravaged [ lastet'an ] and seized the entire country .\\nIn that period Heraclius enthroned his son Kostandin [Constantine III, 613-41], entrusting him to the Senate\\nand to all the grandees of the palace [g80]. He confirmed him on the throne of his kingdom. T ogether with his\\nbrother Theodosius, he assumed the military command, assembled a multitude of troops, and crossed into\\nAsorestan by way of Antioch. A great battle took place in the area of Asia, and the blood of the generals\\ncoursed violently to the city of Antioch. The groupings and clashings were severe and the slaughter was great\\nin the agitation. Both sides were worn and wearied in the fight. However , the Iranians grew stronger and\\npursued the fleeing Byzantines, receiving the victory , in addition to [the renown of] bravery . Yet another\\nbattle took place close to the defile leading to Cilicia. The Byzantines struck the Iranians in a front of 8,000\\narmed men. And they turned and fled. The Iranians grew stronger , went and took the city of T arsus and all the\\ninhabitants in the district of Cilicia.\\n[95] Then the entire country of Palestine willingly submitted to the king of kings. The remnants of the\\nHebrew people especially rebelled from the Christians and taking in hand their native zeal [The translation is\\nuncertain: ew ar heal i dzer hn znaxandz hayr eni, perhaps \\\"manifesting desire for a/their homeland\\\"] wrought\\nvery damaging slaughters among the multitude of believers. Going [to the Iranians], [the Jews] united with\\nthem. At that time, the army of the king of Iran was stationed at Caesarea in Palestine. Their general was\\nnamed Rhazmiozan (that is, Xorheam). He spoke with [the inhabitants of] Jerusalem so that they submit\\nvoluntarilly and be kept in peace and prosperity .\\nNow first [the Jerusalemites] voluntarily submitted, of fering the general and the princes very great gifts, and\\nrequesting that loyal ostikan s be stationed with them to preserve the city . However , several months later the\\nentire mob of the city's young braves united [ miabaneal amenayn r hamik kachar hats'n` mankunk'\\nk'aghak'in ...] and killed the Iranian king's ostikan s. Then they rebelled from his service. After this [g81] a\\nbattle took place among the inhabitants of the city of Jerusalem, Jew and Christian. The multitude of the\\nChristians grew stronger , struck at and killed many of the Jews [The pejorative satakets'in  is used]. The\\nremainder of the Jews jumped from the walls, and went to the Iranian army . Then Xorheam (who is\\nErhamikozan) assembled his troops [96] and went and encamped around Jerusalem and invested it, warring\\nagainst it for 19 days. Digging beneath the foundations of the city , they destroyed the wall. On the l9th day\\n[of the siege] which was the 27th day of the month of Marg [The 1 1th month of the Armenian calandar ,\\ncorresponding to June] in the 25th year of the reign of Xosrov Apruez [615], ten days after Easter , the Iranian\\nforces took Jerusalem and putting their swords to work for three days they destroyed [almost] all the people\\nin the city . Stationing themselves inside the city , they burned the place down. The troops were then ordered to\\ncount the corpses. The figure reached 57,000. Thirty-five thousand people were taken alive, among whom\\nwas a certain patriarch named Zak'aria who was also custodian of the Cross. [The Iranians] sought for the\\nlife-bringing Cross and began to torment [the clerics], executing many clerics at that time. Finally [the\\nclerics] pointed out the place where it was hidden. [The Iranians] took it into captivity and also melted all the\\ncity's silver and gold, which they took to the court of the king. Now regarding those who had been arrested,\\nan order was issued by the king to have mercy on them, to build a city and to settle them there, establishing\\neach person in his [former] rank/profession [ karg]. He commanded that the Jews [97] be driven from the city ,\\nand the king's order was quickly implemented, with great ur gency . They placed a certain archpriest named\\nModestos over the city . He wrote [a letter] with the following import to the country of Armenia [g82]\\n[The main portion of chapter 25, which we omit, contains Modestos' letter to the Armenian kat'oghikos\\nKumitas, and the latter's response. These letters concern doctrinal matters. The translation resumes with the\\nlatter portion of chapter 25.]\"],\"start\":37,\"end\":40,\"length\":3},{\"chapter\":\"25\",\"pages\":[],\"start\":40,\"end\":40,\"length\":0},{\"chapter\":\"26\",\"pages\":[\"The Construction of the Church of Hrhip'sime\\nNow in the 28th year of the reign of Xosrov Apruez [618], kat'oghikos  Kumitas pulled down the chapel of\\nsaint Hrhip'sime in the city of V agharshapat since it was a very base and gloomy construction, having been\\nbuilt by saint Sahak the patriarch and kat'oghikos  of Armenia, son of saint Nerses.\\nIt happened that while they were demolishing the chapel wall, unexpectedly a radiant and matchless pearl was\\nuncovered, namely the vir gin body of the blessed lady Hrhip'sime. [She had been martyred] by being torn\\nlimb from limb. Now since the venerable saint Gregory had sealed [the reliquary] with his ring, as had the\\nvenerable Sahak, kat'oghikos  of Armenia, [Kumitas] did not dare to open it. He too sealed it with his own\\nring, and indeed he was worthy of sealing such a pearl with his ring, [it being the ring] of the third of the three\\n[true] believers.\\n[98] Which is the pearl that comes not from the sea, but the pearl born from a royal line, nourished in the\\nembrace of holiness and dedicated to God? The righteous long to behold you, and the venerable Kumitas is\\ntenderly in love with you.\\nThe venerable one had a height of nine palms and four fingers. The entire northern area was motivated to\\ncome to worship. Many af flicted people received healing for all kinds of pains. [Kumitas] built the church,\\nand left the [g88] venerable [Hrhip'sime's reliquary] outdoors until the moisture of the lime in the wall had\\ndried. Then he placed it in its abode.\\n[Kumitas] also raised the wooden roof of the blessed cathedral, repaired the crumbling wall and built a stone\\nroof. This occurred in the years of Y ovhank, priest of the monastery of the blessed cathedral. \\n \\n[99] \\nChapter 26.\\nXorheam comes to Chalcedon with a lar ge army to take Constantinople. The emper or's exhortation and gift.\\n[The Iranians] consent to turn back. The Iranians again r eturn to Byzantium ( i Biwzandia ). The gr eat naval\\nbattle and the Iranian defeat. Xosr ov's hrovartak  to Heraclius. Heraclius goes against the Iranians. The battle\\nnear T igranakert and Heraclius' arrival at Cappadocian Caesar ea in triumph and with booty . He goes\\nagainst Xosr ov again and battles in the plain of Nineveh wher e the Iranians ar e defeated.\\nIn that period it happened that Xorheam went to Chalcedon with his troops and encamped opposite\\nByzantium. He wanted to cross [the straits] and capture the capital city .\\nNow as soon as emperor Heraclius saw the brigand who had come to destroy his kingdom, against his will he\\nexalted [the Iranians] as meritorious and beloved guests, and became friendly . He went before [Xorheam]\\nwith presents and gave gifts to the general and to the very great princes. [Heraclius] gave the troops salaries,\\nand lunch and dinner for seven days. Then he boarded a boat which was in the sea, and spoke [the following\\nwords] to [the Iranian troops]: \\\"What did you expect to accomplish by coming to this place? Could it be that\\nyou regard the sea as the land and would war with it? God, should He so will, could dry up the sea before\\nyou. But take care that you not displease God, and that He not take vengeance on you with the bottomless sea.\\nFor [God] did not give the victory to you because of your piety , but because of our impiety [g89]. Our sins\\ndid it, not your bravery . What is it that your king seeks from me that he will not make reconciliation? If he\",\"wants to destroy my kingdom let him not attempt it. For it was God who established it, and no one is capable\\nof destroying it except (should God for some reason want to) to fulfill God's will. Furthermore [Xosrov] has\\nsaid that he will [100] enthrone our emperor . Well, let him enthrone whomever he wants, and we will accept\\nhim. Now if he is seeking to avenge the blood of Maurice, God took revenge on Phocas by means of my\\nfather , Heraclius. But [Xosrov] is still thirsting for blood. When will he be satiated? The Romans could have\\nslain him, could they not, and done away with the lordship of the Iranians, when God delivered him into our\\nhands. On the contrary , he was shown mercy . And now I seek the same from him—reconciliation and love. I\\nrequest three things besides, so hear me out. Quit subjecting the land to fire, the sword, and captivity . Rejoice\\nin your priests [The translation is uncertain: yerets'unts'd awgut gtanek' . Perhaps, \\\"take comfort in your\\nseniority\\\"], for you are not oppressed by famine nor are royal taxes being lost. Behold, I am sending a\\nhrovartak  with of ferings to your king to request reconciliation from him, and [that he make] peace with me.\\\"\\nTaking [Heraclius'] gifts, [the Iranians] were persuaded to do as he requested. Now the Iranian king received\\nthe of ferings brought from the emperor , but did not dispatch the emissaries. He ordered his troops to go to\\nByzantium by boat. Or ganizing ships, he started preparing to wage naval warfare with Byzantium. A force of\\nsailors from Byzantium arose before him, and there was a naval battle from which the Iranian forces returned\\nhumiliated. Four thousand men [101] were lost on the ships, and [the Iranians] thereafter did not attempt such\\na project.\\nIn the 34th year of his reign [624] king Xosrov wrote the following hrovartak  to Heraclius:\\n\\\"From Xosrov , the honored of the gods, lord of every country and king, born of the great Aramazd,\\nto Heraclius, our stupid and useless servant [g90].\\n\\\"You did not want to give yourself into our service, but rather , you call yourself lord and king, and\\nthose treasures of mine which are with you, you spend, and you deceive my servants. Furthermore,\\nhaving assembled troops composed of brigands, you give me no rest. Did I not, truly , exhaust the\\nByzantines? Y ou claim confidence in your God, yet how was it that your troops did not save\\nCaesarea, Jerusalem and great Antioch from my hands? And could it be that even now you do not\\nknow that land and sea has been made obedient to me. Now it is only Constantinople which I have\\nbeen unable to dig up. Y et, I will for give all your faults. Bring your wife and children and come here,\\nand I shall give you fields, vineyards and olive-trees by which you may live; and we shall [102] look\\nupon you af fectionately . Do not deceive yourself with your vain hopes, for how can that Christ who\\nwas unable to save himself from the Jews (but was crucified instead) save you from me? For [even]\\nif you descend to the bottom of the sea, I shall stretch forth my hands and seize you. And then you\\nwill see me under circumstances which you would rather not.\\\"\\nEmperor Heraclius took the hrovartak  and commanded that it be read in the presence of the patriarch and the\\ngrandees. Entering the House of God, they placed the hrovartak  on the altar , and prostrated themselves before\\nthe Lord, weeping bitterly , so that He see the insults with which His enemies dishonored Him.\\nIt pleased Heraclius and all the senators to seat Heraclius' small son, Kostandos [Constantine III, 613-41], on\\nthe throne of the kingdom. Heraclius prepared himself to take his wife and go East. At that point Kostandin\\nwas even more confirmed into the royal dignity .\\nThen Heraclius prepared with his wife, eunuchs, and princes of the court, and celebrated Easter in\\nConstantinople. On Easter morning he sailed to Chalcedon, commanding his [103] troops to assemble at\\nCappadocian Caesarea. Then he himself left Chalcedon, came to Caesarea, pitched his tent in the midst of the\\narmy and ordered all the troops to be summoned. He read the hrovartak  before them and related why he had\\n[g91] come there. Now although [the troops] were agitated by the words, nonetheless they were exceedingly\\nhappy that [Heraclius] had come among them. They wished him victory and said: \\\"W e shall live and die with\\nyou, wherever you go. May all of your enemies become dirt beneath your feet, and may we wipe them of f the\",\"face of the earth of our Lord God and exterminate those people who insult Him.\\\" W ith 120,000 men\\nHeraclius departed for the court of the Iranian king, travelling via the north, passing opposite the city of\\nKarin. He reached A yraratean Dwin, and Naxchawan, both of which he burned.\\nThen he went against the village of Gandzak, which he took, destroying as well the altars of the great Fire\\nwhich they called Vshnasp. King Xosrov ur ged those of his troops in the Byzantine district to hasten and\\ncome to his aid. Y et although they or ganized his horses and entrusted them to [104] Shahen the Patgosapan,\\nthe army was fatigued and could not resist. [Xosrov] stored up his treasures at Ctesiphon and prepared to flee.\\nNow the Iranian troops hurriedly reached Nisibis. Emperor Heraclius was informed that Xorheam had come\\nto Nisibis. He took his troops and captives and turned through the secure land of Media, reaching P'aytakaran.\\nXosrov was informed that Heraclius had turned and reached P'aytakaran, and wanted to cross into\\nIberia/Geor gia, via [Caucasian] Aghbania/Aghuania. He ordered his general, Shahr V araz, to get ahead [of\\nHeraclius]. He quickly reached A yrarat, crossed to Gardman across from him and encamped facing\\n[Heraclius] at the other T igranakert. And Shahen with 30,000 troops arrived and encamped at Heraclius' rear\\nin the awan  of T igranakert. Thus one [army] was encamped in one place, the other , at the other place, while\\nHeraclius' army was between them [g92].\\nAs soon as Heraclius saw that they had trapped him in the middle, he turned upon the troops at his rear , with\\nresolute strength struck at [the Iranian general], routed him, and went through T sghuk. He disentangled\\nhimself by going into the plain of Naxchawan through the mountains, in wintertime.\\n[105] Shahr V araz and his troops, and Shahen, together with those of his men who had escaped, pursued\\n[Heraclius]. Now the latter forded the Arax river going to the V rnjunik' awan,  and encamped in the fields\\nthere. The Iranian army caught up, but they were unable to ford the river that day . Heraclius reached\\nBagrewand and crossed to Apahunik', encamping in the village called Hrchmunk'. Shahr V araz spread his\\ntroops out to Aghiovid and he himself with 6,000 select armed braves went and located in an ambuscade in\\nthe district of Archesh, so that he might pounce upon Heraclius' army in the middle of the night.\\nHeraclius was informed by the spies he had dispatched that Xorheam had arrived and was planning to attack\\nhim from the ambuscade. Heraclius, similarly , took select cavalrymen and horsemen and dispatched 20,000 of\\nthem on him. Reaching Aghi, he found 500 of the [Iranian] advance-guard and destroyed them. Now one of\\nthose [Iranian] cavalrymen escaped, reached Archesh and delivered to Xorheam the bad news that the enemy\\nhad come upon him and decimated the peshopa  [advance-guard] troops at Aghi. Xorheam became furious\\nwith the man and ordered him bound, hand and foot, saying: \\\"Up to the present, Heraclius has fled from me.\\nNow that I have arrived with [106] such an army , should he not flee from me?\\\" But while these very words\\nwere in his mouth, [the Byzantines] forcefully came upon them, surrounded the city on three sides and set it\\nafire, burning to death multitudes of troops. If anyone was able to flee from it, [the Byzantines] seized and\\nkilled him. No one survived as all were consumed by the awful fire. Shahr V araz, however , did escape seated\\non a horse which [g93] swam. Thus did he escape to those troops of his which he had assembled in the\\ndistrict of Aghiovit.\\nNow Heraclius took the loot and booty of their army and returned in great triumph reaching the area of\\nCaesarea. Shahr V araz hurried after him. But because the army was fatigued, he thought to go by way of a\\nnumber of districts to rest and or ganize the troops. They went into the area of Asia where they spread out and\\nstopped.\\nThen Heraclius took his forces and returned to the country of Armenia, crossing through Shirak, reaching the\\nford of the Arax river , crossing it to the awan  of V ardanakert, and entering the district of Gogovit. Rhoch\\nVehan and the Iranian troops thought that they had fled. Now he travelled to Her and the district of Zarewand\\nheading straight toward Ctesiphon against Xosrov . Once he had entered the borders of [107] the district of\\nAtrpatakan, news finally reached Rhoch V ehan who took his troops and pursued him to the city of\"],\"start\":40,\"end\":43,\"length\":3},{\"chapter\":\"27\",\"pages\":[\"Naxchawan. Thus he went hurriedly , day and night until he approached him. [Heraclius] went to the far side\\nof Zarasp mountain in the country of Asorestan while [the Iranians] pursued him. [The Byzantines] turned\\nwest, and went to Nineveh. Other troops came to the aid of Rhoch V ehan from the king's court, the most\\nselect men of the entire kingdom. The soldiers joined together and pursued Heraclius. Heraclius drew them\\nalong as far as the plain of Nineveh and then suddenly turned back upon them with intense might. Now there\\nwas a fog over the plain, and so the Iranians were unaware that Heraclius had turned upon them until the two\\narmies mer ged.\\nOn that day the Lord so increased his compassion on Heraclius that [the Byzantines] struck them as though\\n[the whole army] was but one man, and they killed the general in battle. [The Byzantines] surrounded the\\nsurvivors and wanted to kill all of them. But [the Iranians] raised a clamour , saying: \\\"Pious and benevolent\\nlord, have mercy on us\\\" [g94]. Then Heraclius commanded that they be set free. And now it was Heraclius\\nwho ordered that the country be raided. \\n[108] \\nChapter 27.\\nThe flight of Xosr ov. Heraclius takes and burns Ctesiphon and r eturns to Atrpatakan. The killing of Xosr ov\\nand his forty sons. Kawad rules and makes peace with Byzantium and leaves the [Byzantine] bor ders.\\nNow the king of Iran, Xosrov , fled crossing the T igris river to V ehkawat, severing the ties of the pontoon\\nbridges behind him. Heraclius came and encamped close to the gates of the city of Ctesiphon and burned\\ndown all the royal mansions surrounding the city . Then he went to Atrpatakan with all his multitude and\\nequipage, for Heraclius was terrified of Xorheam. Now Xorheam did not go to the aid of king Xosrov but\\ninstead went to where he was in the west. Then Xosrov turned to go home and commanded that a pontoon\\nbridge be built. However , the king's women and children, the treasury , and stable of royal horses were at\\nVehkawat. \\n \\nXosrov began to assemble the remaining naxarar s speaking to them with extreme criticism, saying: \\\"Why did\\nyou not die at the site of the battle, instead of coming to me? Did you, perhaps, think that Xosrov was dead?\\\"\\nThen [the Iranian naxarar s] decided on a plan of unified action, saying: \\\"Although [109] we survived the\\nenemy , there is no way for us to escape from Xosrov . Come, let us plan something.\\\" They then vowed\\n[loyalty] to one another . They went by night over a draw-bridge to V ehkawat, which they seized. They\\nappointed guards over it, then enthroned Kawad, [Xosrov's] son. They also had secretly removed the horse by\\nwhich Xosrov had come to Ctesiphon [g95]. Thus, when the outcry of what had taken place reached Xosrov ,\\nand when he became filled with dread and horror , and asked for his horse, they did not find the horse in the\\nstable. King Kawad then arrived with all of his troops. And king Xosrov , in a disguise, entered the royal\\ngarden and hid himself under some dense hedges. King Kawad ordered a search made and, going into the\\ngarden, they found him. They seized [Xosrov], sent him to the executioner , king Kawad gave the order , and\\nthey put him to death. Regarding Xosrov's children, the naxarar s said: \\\"It is not worth letting them live, for\\nthey will cause trouble.\\\" Then king Kawad gave the order , and all [the sons], some forty people, were killed\\nin the same hour . [Kawad] requested for himself the women, treasury , and royal stable.\\n[110] Then king Kawad began to consult with the naxarar s of his realm, saying: \\\"W e must make peace with\\nthe emperor , leave all of his borders, and make reconciliation on all sides.\\\" They unanimously agreed to do\\nthis. King Kawad ordered that a hrovartak  of greeting be written to Heraclius, and that all of his borders be\\nleft alone. W ith this he sent an oath and salt to seal it. He dispatched a certain prince Rhash with very great\\ngifts to confirm [the hrovartak ] based on their unity .\"],\"start\":43,\"end\":44,\"length\":1},{\"chapter\":\"28\",\"pages\":[\"Now when this Rhash arrived, gave the glad tidings, presented the hrovartak  and went before them with gifts,\\nemperor Heraclius and all his troops greatly thanked God. Then emperor Heraclius commanded that the\\nmultitude of [Iranian] captives and all the troops be set free. He wrote a testament of praise, established peace\\nwith an oath, and sent [to Kawad] a certain one of his principal naxarar s named Y usdat' together with very\\ngreat gifts. He also exalted [the Iranian emissary] Rhash, loading him with precious [g96] treasures, and\\ndispatched him. He went peacefully back to his own place. And Y usdat' went to king Kawad and presented\\nthe hrovartak  and gifts. Once again the terms of peace were confirmed by him, the boundaries were fixed by\\nmeans of hrovartak s [111] which were sworn to and salt was sealed by Y usdat' in the manner of the first copy ,\\nand after [the custom of] the first kings. In [Y usdat's] presence [Kawad] ordered that Shahr V araz be written\\nto, to assemble the army and return to Iranian territory , quitting the Byzantine borders, though [the latter] did\\nnot want to obey that order . They released Y usdat' laden with treasures, and he departed. \\nChapter 28.\\nSmbat's son V araztir ots' becomes a marzpan . The selection and deposition of kat'oghikos  K'ristap'or and his\\nsuccession by Ezr . The death of Kawad and the enthr onement of his son Artashir . Heraclius writes to\\nXorheam r equesting the holy Cr oss fr om him. The killing of Artashir and the r eign of Xor heam. The killing of\\nXorheam, and the r eign of Bbor , Xosr ov's daughter . She was succeeded by a certain Xosr ov, who was followed\\nby Xosr ov's daughter , Azarmiduxt. She was followed by Ormizd. Finally , the r eign of Y azkert.\\nKing Kawad summoned V araztirots' (son of Smbat Bagratuni, who was called Xosrov Shum) and bestowed\\nupon him the authority of the tanuterut'iwn . He made him marzpan  and sent him back to Armenia with all of\\nhis father's belongings so that he would keep the land in a flourishing state. When he arrived in Armenia the\\nentire land received him with delight. However , because the venerable kat'oghikos  Kumitas had died and the\\nposition was vacant, [V araztirots'] consulted with [1 12] everyone to find someone worthy of filling it. Then,\\nat the proposal of T'eodoros, lord of Rshtunik', they selected a certain hermit from the House of Abraham,\\nnamed K'ristap'or , and seated him as kat'oghikos . He proved to be an arrogant and impious man whose tongue\\nwas as sharp as a sword. He stirred up much agitation and intruded the sword between Aspet and his brother ,\\nby slander . He occupied the patriarchal throne for two years. During the third year they made accusations\\nagainst him. W ith all the bishops and princes assembled, they held an investigation. T wo men from\\n[K'ristap'or's] family came [to the trial] and testified against him in front of the entire multitude. So they took\\nfrom him the veil of the dignity of the priesthood, removed him from the order and pursued him with\\nindignities. They swiftly enthroned Ezr , from the district of Nig, as kat'oghikos . The venerable Kumitas had\\nappointed him doorkeeper/warden [of the church] of saint Gregory . He was a humble and mild man who did\\nnot want to anger anyone, nor did unseemly words issue from his mouth.\\nThough king Kawad was planning to make the land flourish and wanted to make peace everywhere, he died\\nafter only six months [as king]. They enthroned Artashir who was his son, but a small boy [ca. 628/29]. Then\\nHeraclius wrote the [1 13] following to Xorheam:\\n\\\"Your king Kawad has died. The throne of that kingdom belongs to you. I shall give it to you, and to\\nyour son after you. Should you need troops I shall send as many as are required, and let there be a\\nvow between you and me in addition to a sworn and sealed document.\\\"\\nXorheam easily accepted and quit Alexandria. He assembled all his troops at one location and left them there.\\nThen he went to the appointment where Heraclius had told him to be, with but a few [men]. When [Heraclius\"],\"start\":44,\"end\":45,\"length\":1},{\"chapter\":\"29\",\"pages\":[\"and Xorheam] saw each other they were very joyful. And it was then that Heraclius swore to him that he\\nwould give the kingdom to him and to his sons after him, and that he would provide as many troops as\\nnecessary . The first thing that [Heraclius] requested of him was the life-giving Cross which he had captured at\\nJerusalem. Then Xorheam swore to him, saying:\\n\\\"As soon as I reach the royal court I shall make inquiry about the Cross, and have it [g98] brought to\\nyou. Furthermore, I shall place the border wherever you wish, and confirm it in writing, with seal\\nand salt.\\\"\\n[Xorheam] requested a small force from him, and they parted. Now Xorheam took his multitude of troops and\\nwent to Ctesiphon. He ordered some people to kill Artashir the boy-king, and he himself went and sat on the\\nthrone of the kingdom. He ordered all those principal men at the court and in the army whom [1 14] he could\\nnot trust to be killed by the sword, while others he had sent to Heraclius in shackles.\\nThen the venerable Heraclius dispatched loyal men to Xorheam concerning the lordly Cross. [The latter]\\nsought for it with great ur gency and barely gave it to the men who had come. They took it and departed\\nhurriedly . [Xorheam] also gave them no small amount of goods and dispatched them with great joy .\\nNow one day Xorheam donned royal garments, mounted a horse, and circulated among the troops, displaying\\nhimself. Suddenly , from the rear , they attacked, struck, and killed him. Then they enthroned Xosrov's\\ndaughter , Bbor , who was [Xorheam's] wife. They appointed Xorhox Ormazd, a prince of Atrpatakan, as the\\ncommander at court. Now Xorhox sent [a message] to [Bbor], the Bambish  [Iranian, \\\"queen of queens\\\"],\\n[saying]: \\\"Be my wife.\\\" She accepted, [replying]: \\\"Come to me at midnight accompanied by [but] one man,\\nand I shall fulfill your wishes.\\\" Arising at midnight, [Xorhox] took one man and went. As soon as he entered\\nthe royal chamber , the court guards fell upon him, [1 15] attacked and killed him. [Bbor], the Bambish , ruled\\nfor two years and then died. After her was a certain Xosrov , from the line of Sasan. After Xosrov was\\nAzarmiduxt, daughter of Xosrov . After her was Ormazd, grandson of Xosrov whom the troops of Xorheam\\nstrangled. Finally there came to rule Y azkert [ca. 631-52], son of Kawad, grandson of Xosrov , who ruled in\\nfear, since the troops of the land of Iran had split into three parts. The first army was the one in the Iranian\\nand Eastern region; the second army was Xorheam's [g99] which was in Asorestan; and the third army was in\\nAtrpatakan. However , the [center of the] kingdom was at Ctesiphon, and all [the Iranians] universally\\nrespected it. \\nChapter 29.\\nThe r eturn of the Cr oss to holy Jerusalem. The determination of the boundary between the two kings. For ced\\nby Mzhezh Gnuni, Ezr accepts the Council of Chalcedon. The plot of Mezhezh with Rhatovm against aspet\\nVaraztir ots' and the latter's flight. The king swears to him and he goes to the palace and is exalted. The evil\\nplot of At'alarikos with the princes against his father . The exposur e of the plot and the plotters' deaths. The\\nexile of V araztir ots'. The bravery of Dawit' Sahar huni, who becomes Cur opalate. The deeds of T'eodor os, lor d\\nof Rshtunik'.\\nNow when the holy Cross of the Lord had fallen to the venerable, pious, and blessed king Heraclius, he\\nenthusiastically [1 16] and joyfully assembled his troops. Then, taking all the royal attendants and revering the\\nblessed, miraculous and divine discovery , they took [the Cross] back to the holy city of Jerusalem. They also\\ntook there all the vessels of the church which had been saved from the enemy , in the city of Byzantium. And\\nthere was no small amount of joy on the day they entered Jerusalem, with the sound of sobbing and moaning,\",\"an outpouring of tears from their excited and moved hearts, and there was a tightening feeling in the king, the\\nprinces, all the troops and the inhabitants in the city . No one was capable of singing the sacred songs due to\\nthe tremendous and deep emotion [felt by the] king and the entire multitude. [Heraclius] took [the Cross] and\\nreestablished it in its place; he put each of the vessels of the churches back in its place; and he gave wealth\\nand incense to all the churches and inhabitants of the city [g100].\\n[Heraclius] himself then took to the road heading directly for Syrian Mesopotamia in order to personally see\\nto establishing the cities of the borders. The boundary which was confirmed was the same as had been\\nestablished under Xosrov and Maurice. The Cross of the Lord remained in the [1 17] heaven-built city until\\nthe taking of Jerusalem by the sons of Ishmael At that time it was taken in exile to the capital city [of\\nConstantinople] with all the church vessels.\\nA general of the Byzantines named Mzhezh Gnuni, from the country of Armenia, arrived next and personally\\ntook control of all the country of the borders. He told the kat'oghikos  Ezr to come to him in the country of the\\nborders and to take the sacrament of communion with the emperor . \\\"Otherwise,\\\" he said, \\\"we shall get\\nourselves another kat'oghikos  and you will hold sway in the Iranian sector .\\\" The kat'oghikos , since he was\\nunable to leave the country of his jurisdiction, requested a statement of faith from the emperor . A volume\\nwritten by the emperor himself was quickly sent to him in which [the emperor] cursed Nestorius and all\\nheretics, but he did not curse the Council of Chalcedon. The kat'oghikos  went to the country of Asorestan,\\nsaw the emperor and communed after his fashion. As a gift, [Ezr] requested from the emperor the salt [mine]\\nat Koghb, which he received. Then he returned to his home in great pomp. Subsequently , he resided with the\\nByzantine army , doing as the general wished. He arranged the orders of soldiers and the distribution of\\ngranaries for the entire country .\\n[118] Now aspet  Varaztirots' (son of the great Xosrov Shum, styled Jawitean Xosrov [Forever Loyal to\\nXosrov] by the kings) completely built up the entire land of Armenia. But he did not submit to the great\\nprince named Xorhox Ormazd of the Atrpatakan land, nor to his son and successor , Rostom, who [also] was a\\nprince in the Atrpatakan area. There was great agitation between the two. Then the Byzantine general Mzhezh\\nstarted to slander the aspet  to prince Rostom, who was in Atrpatakan: \\\"Let him not stay in Armenia,\\notherwise, there will be great agitation between the two kings.\\\" And he sent [g101] his brother Garik'pet to go\\nand winter in Dwin; and then they would arrest the aspet  and depart. However , because all the Iranian troops\\nliked the aspet , one of the great princes there informed him, saying: \\\"Look out for yourself, for they are going\\nto arrest you, tomorrow .\\\" So aspet  took his wife and children and fled at night to T aron. When he got there, he\\nassembled his troops. [V araztirots'] requested an oath from emperor Heraclius, that he not be alienated from\\nhis own land. Accepting [the emperor's] oath as genuine, he went to him in Asorestan. Then emperor\\nHeraclius swore to him: \\\"Stay with me for a brief time, then I shall dispatch you to your country with great\\nhonor .\\\" And [Heraclius] exalted him more than all the patricians in his realm. When [V araztirots'] went to the\\npalace, he gave him a royal mansion, a silver throne, [1 19] and an extremely lar ge amount of treasure.\\nFurthermore, [V araztirots'] son, Smbat, was the beloved chamberlain of Heraclius.\\nHere is [an account of] the evil accomplished by the son of emperor Heraclius named At'alarik [Heracleonas,\\n638-41]. This concerns the great crime which deeply wounded his father's heart, broke a marvellous\\nindividual, made the beauty of his face fade and became the cause of the ruin of himself and of many others.\\nNow [At'alarik], T'eodoros called Magistros, brother of emperor Heraclius' son, many of the grandees of the\\ncity, and V ahan Xorhxoruni all had united to kill Heraclius, and to enthrone his son, At'alarik. Included in the\\ndeliberation similarly was V araztirots', son of Smbat Xosrov Shum; however , he did not consent to the slaying\\nof the emperor and his sons. He said, rather: \\\"Y ou say that they are the locum tenens  of God, therefore there is\\nno need to do that [killing], nor do I unite with you in that plan.\\\" Now a certain curator who had been\\nincluded in the deliberations, fully related the plot to the emperor . When the emperor had confirmed [the truth\\nof the matter] [g102], he ordered that his son, nephew , and all those with them, be arrested in the morning.\"],\"start\":45,\"end\":47,\"length\":2},{\"chapter\":\"30\",\"pages\":[\"The noses and right hands of all of them were cut of f. [Heraclius] sent a message [120] to the aspet , saying:\\n\\\"Since you did as you did with regard to me and did not want to dip your hand into my blood and the blood of\\nmy sons, I shall not reach for you and your sons. Go where I order you, and I will have mercy upon you.\\\"\\nAlthough the sides protested, saying: \\\"Kill him,\\\" nonetheless, [Heraclius] did not want to listen to them.\\nRather he ordered [V araztirots'], his wife and children taken to the island and city of tribulation named Ak'sor\\n[\\\"Exile\\\"].\\nAlso included in the plot was Dawit' Saharhuni, who was sent to the palace bound, by Mzhezh Gnuni.\\nBursting his bonds enroute to the palace, [Dawit'] killed the men who were taking him. He then returned and\\nunited the troops of Armenia with himself, suddenly attacking and killing Mzhezh Gnuni the Byzantine\\ngeneral, and V araz Gnel Gnuni. [Dawit'] himself took over the military ccmmand with the support and\\naffection of all the troops.\\nNow at the request of the princes, the emperor made him prince of all the lands and bestowed on him the\\ndignity of curopalate. [Heraclius] confirmed [Dawit'] in his service. He held authority for three years in the\\ngreatest luxury . Then, however , he was dishonored by the troops and persecuted; and all the azats, being\\ndisunited, were the undoing of the country of Armenia.\\n[121] It was, however , only the pious prince T'eodoros of the Rshtunik' district who continually was\\norganizing the troops of his area, and was on the alert day and night, as his deep wisdom dictated. He wrought\\nnot a few slaughters of the enemy , and he built up the island of Aght'amar ,[acts which] envivified many\\ndistricts [g103]. \\nChapter 30.\\nThe elimination of the Sasanian [dynasty] which held sway for 542 years. The birth of Muhammad and the\\nentrance of the sons of Ishmael into the land of Armenia. The death of Heraclius and the r eign of\\nConstantine.\\nI shall discuss the [line of the] son of Abraham: not the one [born] of a free [woman], but the one born of a\\nserving maid, about whom the quotation from Scripture was fully and truthfully fulfilled, \\\"His hands will be\\nat everyone, and everyone will have their hands at him [Genesis 16. 1 1,12].\\\"\\nTwelve peoples [representing] all the tribes of the Jews assembled at the city of Edessa. When they saw that\\nthe Iranian troops had departed and left the city in peace, they [122] closed the gates and fortified themselves.\\nThey refused entry to troops of the Roman lordship. Thus Heraclius, emperor of the Byzantines, gave the\\norder to besiege it. When [the Jews] realized that they could not militarily resist him, they promised to make\\npeace. Opening the city gates, they went before him, and [Heraclius] ordered that they should go and stay in\\ntheir own place. So they departed, taking the road through the desert to T achkastan to the sons of Ishmael.\\n[The Jews] called [the Arabs] to their aid and familiarized them with the relationship they had through the\\nbooks of the [Old] T estament. Although [the Arabs] were convinced of their close relationship, they were\\nunable to get a consensus from their multitude, for they were divided from each other by religion. In that\\nperiod a certain one of them, a man of the sons of Ishmael named Muhammad, a merchant, became\\nprominent. A sermon about the W ay of T ruth, supposedly at God's command, was revealed to them, and\\n[Muhammad] taught them to recognize the God of Abraham, especially since he was informed and\\nknowledgeable about Mosaic history . Because the command had [g104] come from On High, he ordered\\nthem all to assemble together and to unite in faith. Abandoning the reverence of vain things, they turned\",\"toward the living God, who had appeared to their father , Abraham. Muhammad legislated that they were not\\nto [123] eat carrion, not to drink wine, not to speak falsehoods, and not to commit adultery . He said: \\\"God\\npromised that country to Abraham and to his son after him, for eternity . And what had been promised was\\nfulfilled during that time when [God] loved Israel. Now , however , you are the sons of Abraham, and God\\nshall fulfill the promise made to Abraham and his son on you. Only love the God of Abraham, and go and\\ntake the country which God gave to your father , Abraham. No one can successfully resist you in war , since\\nGod is with you.\\\"\\nThen all of them assembled together , from Havilah to Shur , which is opposite Egypt [The text is corrupt here.\\nThe citation is from Genesis 25.18], and they set out from the P'arhan desert [being] twelve tribes [moving] in\\nthe order [of precedence] of the Houses of the patriarchs of their tribe. They were divided into 12,000 men, of\\nwhich the sons of Israel were in their own tribes, 1,000 to a tribe, to lead them to the country of Israel. They\\ntravelled army by army in the order [of precedence] of each patriarchy: Nebaioth, Kedar , Adbeel, Mibsam,\\nMishma, Dumah, Massa, Hadad, T ema, Jetur , Naphish and Kedemah [Genesis 25. 13-16]. These are the\\npeoples of Ishmael. They reached Moabite Rabbath, at the borders of [124] Ruben's [land]. The Byzantine\\narmy was encamped in Arabia. [The Arabs] fell upon them suddenly , struck them with the sword and put to\\nflight emperor Heraclius' brother , Theodosius. Then they turned and encamped in Arabia.\\nAll the remnants of the sons of Israel then assembled [g105] and united, becoming a lar ge force. After this\\nthey dispatched a message to the Byzantine emperor , saying: \\\"God gave that country as the inherited property\\n[i kaluats zhar hangut'ean ] of Abraham and of his sons after him. W e are the sons of Abraham. It is too much\\nthat you hold our country . Leave in peace, and we shall demand from you what you have seized, plus interest.\\nThe emperor rejected this. He did not provide a fitting response to the message but rather said: \\\"The country\\nis mine. Y our inheritance is the desert. So go in peace to your country .\\\" And [Heraclius] started or ganizing\\nbrigades, as many as 70,000 [troops] giving them as a general, a certain one of his faithful eunuchs. He\\nordered that they were to go to Arabia, stipulating that they were not to engage them [125] in war , but rather\\nto keep on the alert until he could assemble his other troops and send them to help. Now [the Byzantines]\\nreached the Jordan and crossed into Arabia. Leaving their campsite on the riverbank, [the Byzantines] went\\non foot to attack [the Arabs'] camp. [The Arabs], however , had placed part of their army in ambuscades here\\nand there, lodging the multitude in dwellings around the camp. Then they drove in herds of camels which\\nthey penned around the camp and the tents, tying them at the foot with rope. Such was the fortification of\\ntheir camp. The beasts were fatigued from the journey , and so [the Byzantines] were able to cut through the\\ncamp fortification, and started to kill [the Arabs]. But suddenly the men in the ambuscades sprung from their\\nplaces and fell upon them. A we of the Lord came over the Byzantine troops, and they turned in flight before\\nthem. But they were unable to flee because of the quicksand which buried them to the legs. There was great\\nanxiety caused by the heat of the sun and the enemy's sword was upon them. All the generals fell and\\nperished. More than 2,000 men were slain. A few survivors fled to the place of refuge.\\n[The Arabs] crossed the Jordan and encamped at Jericho. Then dread of them came over the inhabitants of the\\ncountry , and all of them submitted [g106]. That night the Jerusalemites took [126] the Cross of the Lord and\\nall the vessels of the churches of God, and fled with them by boat to the palace at Constantinople. [The\\nJerusalemites] requested an oath [from the Arabs] and then submitted.\\nThe emperor of the Byzantines was no longer able to assemble his troops against them. [The Arabs] divided\\ntheir army into three parts. One part went to Egypt, taking [territory] as far as Alexandria. The second part\\nwent north [to war] against the Byzantine empire. In the twinkling of an eye they had seized [territory\\nstretching] from the sea to the shores of the great Euphrates river , as well as Edessa and all the cities of\\nMesopotamia, on the other side of the [Euphrates] river . The third part [of the Arab army] was sent to the\\neast, against the kingdom of Iran.\",\"In that period the kingdom of Iran grew weaker , and their army was divided into three parts. Then the\\nIshmaelite troops who were gathered in the east, went and besieged Ctesiphon, since the king of Iran resided\\nthere. T roops from the land of Media [Marats'], some 80,000 armed men under their general Rostom\\nassembled and went against [the Arabs] in battle. Then [the Arabs] left the city and crossed to the other side\\nof [127] the T igris river . [The Iranians] also crossed the river , pursuing them. And they did not stop until they\\nreached their borders, at the village called Hert'ichan. [The Arabs] continued to pursue them, [eventually]\\ngoing and encamping in the plain. Present were Mushegh Mamikonean, son of Dawit', the general of Armenia\\nwith 3,000 armed men, and also prince Grigor , lord of Siwnik', with 1,000 men. [The Iranian and Arab\\narmies] attacked each other , and the Iranian forces fled before them. But [the Arabs] pursued them, putting\\nthem to the sword. All the principal naxarar s died, as did general Rostom. They killed Mushegh and two of\\nhis sister's sons, as well as Grigor , the lord of Siwnik', along with one son. Some [of the Iranian troops]\\nescaped and fled back to their own land. The remnants of the Iranian forces assembled in Atrpatakan at one\\nspot and made Xorhoxazat their general. Then they hurried to Ctesiphon and took the treasury of the [g107]\\nkingdom, the inhabitants of the cities, and their king, and then hurried to get back to Atrpatakan. But as soon\\nas they had departed and gone some distance, the Ishmaelite army unexpectedly came upon them. Horrified,\\n[the Iranians] abandoned the treasury and the inhabitants of the city , and fled. Their king also fled, winding up\\nwith the southern troops. Now [the Arabs] took the entire treasury and returned to Ctesiphon, taking the\\ninhabitants of the cities along too. [128] And they pillaged the entire country .\\nThe venerable Heraclius ended his life in ripe old age. He reigned for 30 years [610-40/41]. [Heraclius] made\\nhis son Constantine swear to have clemency upon all those transgressors whom he had ordered exiled. He\\nmade him vow to send each back to his place, and to bring back the aspet , his wife and son, and to establish\\nhim in his former rank. \\\"Should he want to go to his land, as I have sworn—and may my oath not be false—\\nrelease him, and let him go in peace.\\\"\\nHeraclius died and his son Constantine ruled. But no one was chosen as general of the land of Armenia, since\\nthe princes were disunited and quit each other's presence.\\nThe polluting army [of the Arabs] arose from Asorestan and came through the valley route to the land of\\nTaron. They took [T aron], Bznunik' and Aghiovit and then, going to the Berkri valley via Ordspoy and\\nGogovit, poured into A yrarat. None of the Armenian troops was able to carry the bad news to the awan  of\\nDwin. There were, however , three of the princes who went and gathered the dispersed troops: T'eodoros\\nVahewuni, [129] Xach'ean Arhaweghean, and Shapuh Amatuni. They fled to Dwin, reached the Metsamor\\nbridge, crossed it, destroyed it, and then they went to take the bad news to the awan . All the people of the\\nland had assembled in the fortress, and they had come in harvest time for the vineyards.\\nT'eodoros went to the city of Naxchawan. The enemy Busha reached Metsamawr bridge but was unable to\\ncross over [g108]. However , [the Arabs] had as a guide V ardik, prince of Mokk', who was called Aknik\\n[\\\"Little Eyes\\\"]. Crossing the Metsamawr bridge, they raided the entire country . They accumulated a very\\ngreat amount of loot and captives, then came and encamped by the edge of the Xosrakert forest.\\nOn the fifth day [of the Arabs' sojourn], on a Friday , the 30th of the month of T re [T re: the fourth month in\\nthe Armenian calendar , November], they came against the city [of Dwin] and it was betrayed into their hands.\\nFor they set fires here and there, and drove away the guards on the wall by smoke and by shooting arrows.\\nThey then erected ladders, scaled the wall and, once inside, opened the city gates. The army of the enemy\\npoured inside and put most of the city to the sword. Then, taking the loot and booty of the city , they departed\\nand encamped at their same campsite. After passing some days there, they arose and departed by the same\\nroute they had come. They had a multitude of captives with them, some [130] 35,000 souls. Now the prince\\nof Armenia, the lord of Rshtunik', who had been concealed in an ambuscade in the district of Gogovit, went\\nagainst [the Arabs] with few troops. But he was unable to resist, and so fled before them. [The Arabs]\"],\"start\":47,\"end\":50,\"length\":3},{\"chapter\":\"31\",\"pages\":[\"pursued [Rshtunik's troops] killing many of them. Then they went to Asorestan. This occurred in the days of\\nkat'oghikos  Ezr.\\nAs a result of that battle, an order came from the emperor [granting] the military command and the dignity of\\npatrician to T'eodoros, lord of Rshtunik'.\\nAll this took place as a result of kat'oghikos  Nerses who succeeded Ezr on the kat'oghikos al throne.\\nWhen the sons of Ishmael had arisen and issued from the desert of Sinai, their king Amrh ['Umar] did not\\naccompany them. But when [the Arabs] had militarily routed both kingdoms, seizing from Egypt to the great\\nTaurus mountain, from the W estern Sea [the Atlantic Ocean] to Media and Xuzhastan, they then emer ged\\nwith the royal army [and went] to the [g109] natural borders of the holdings of Ishmael. Then the [Arab]\\n[131] king gave an order to assemble boats and many sailors and to navigate southwardly , going east to Pars,\\nto Sagastan, to Sind, to Srman, to the land of T uran and to Makuran as far as the borders of India. The troops\\nswiftly prepared and implemented the command. They burned every country , taking loot and booty . They\\nthen turned and made expeditions on the waves of the sea, and reached their own places.\\nWe heard this [account] from men [who had returned] from captivity in Xuzhastan T achkastan, who\\nthemselves had been eye-witnesses to the events described and narrated them to us. \\nChapter 31.\\nRegar ding the Jews and their wicked plans.\\nNow I shall speak about the plot of the Jewish rebels, who, finding support from the Hagarenes for a short\\ntime, planned to [re]build the temple of Solomon. Locating the place called the holy of holies, they\\nconstructed [the temple] with a pedestal, to serve as their place of prayer . But the Ishmaelites envied [the\\nJews], expelled them from the place, and named the same building their own place of prayer . [The Jews] built\\na temple for their worship, elsewhere. It [132] was then that they came up with an evil plan: they wanted to\\nfill Jerusalem with blood from end to end, and to exterminate all the Christians of Jerusalem. Now it\\nhappened that there was a certain grandee Ishmaelite who went to worship in their private place of prayer . He\\nencountered three of the principal Jewish men, who had just slaughtered two pigs and taken and put them [in\\nthe Muslim] place of prayer . Blood [g1 10] was running down the walls and on the floor of the building. As\\nsoon as the man saw them, he stopped and said something or other to them. They replied and departed. The\\nman at once went inside to pray . He saw the wicked [sight], and quickly turned to catch the men. When he\\nwas unable to find them, he was silent and went to his place. Then many [Muslims] entered the place and saw\\nthe evil, and they spread a lament throughout the city . The Jews told the prince that the Christians had\\ndesecrated their place of prayer . The prince issued an order and all the Christians were gathered together . Just\\nas they wanted to put them to the sword, the man came and addressed them: \\\"Why shed so much blood in\\nvain? Order all the Jews to assemble and I shall point out the guilty ones.\\\" As soon as they were all assembled\\nand [the man] walked among them, he recognized the three men whom he had previously [133] encountered.\\nSeizing them, [the Arabs] tried them with great severity until they disclosed the plot. And because their prince\\nwas among the Jews present, [the Arab prince] ordered that six of the principals involved in the plot be killed.\\nHe permitted the other [Jews] to return to their places.\"],\"start\":50,\"end\":51,\"length\":1},{\"chapter\":\"32\",\"pages\":[\"Chapter 32.\\nConstantine dies as a r esult of his mother's plot, and Heraclius (son of Heraclius by his second wife) is\\nenthr oned. General V aghentin (V alentinian) comes to Constantinople and enthr ones Constantine's son,\\nKostas. The Iranians war with the Ishmaelites and ar e defeated. Aspet  Varaztir ots' r eturns fr om court, and\\ndies. The Ishmaelites come to Atrpatakan, and divide into thr ee wings They take Artsap'u fortr ess,\\ncampaigning against the sep'hakan gund .\\nWhen Heraclius died, his son Constantine ruled. [The latter] appointed V aghentianos, called an Arsacid, as\\nthe general of his troops. He ordered his troops to go to the East [g1 11].\\nConstantine ruled only a few days before dying in the plot of his mother Martina, Heraclius' wife. Heraclius'\\nson, Heracleonas, born of the Augusta Martina, was then enthroned [638-641]. [134] Constantine had been\\nHeraclius' son by his first wife. T aking the initiative, V aghentin went against him at Constantinople with his\\ntroops. He captured Martina, cut of f her tongue, and then killed her with her two sons. They enthroned\\nConstantine's son, Constans [II, 641-668], calling him after his father's name. Constans personally assembled\\nthe troops and went to the East.\\nDuring the first year of the reign of the Byzantine emperor Constans, and in the tenth year of the Iranian king\\nYazkert [641/642], the Iranians assembled 60,000 armed men to war with the Ishmaelites. The Ishmaelites\\nfought them with 40,000 swordsmen, clashing in the district of Mark'. The battle lasted for three days until\\nthe foot soldiers on both sides were reduced. Suddenly the Iranian troops were informed that an auxiliary\\nforce had come to help the Ishmaelites. The Iranians fled from camp all though the night. The remnants of the\\nIshmaelite troops went against them in the morning, but found no one in the camp. so they raided across the\\nface of the entire country , putting man and beast to the sword. They captured 22 fortresses and killed\\neverything alive in them.\\nBut who can relate the incredible disasters inflicted by the brigand Ishmael who whipped up sea and land?\\nThe prophet [135] Daniel long ago prophesied that such dif ficulties would come upon the earth. [He spoke of]\\nthe four beasts which represent the four kingdoms which arose on the earth. The first was the W estern\\nkingdom, which is Byzantium, represented by a humanlike beast. \\\"Its wings were plucked of f, and it was\\nlifted up from the ground.\\\" He said that this was diabolical idolatry . \\\"And it stood erect, as a man, and it was\\ngiven a human heart.\\\" Behold, the second beast resembles a bear . It is [g1 12] in the East and is called the\\nSasanian kingdom. \\\"And the bear had three ribs in its mouth\\\"— the kingdom of Persians, Medes and\\nParthians—and they said to it: \\\"Arise and devour much flesh.\\\" Everyone knows how it ate. \\\"Now the third\\nbeast was like a leopard with four wings of a bird, and possessing four heads.\\\" [The winged leopard]\\nrepresents the Northern kingdom, Gog and Magog and their two comrades to whom had been given authority\\nto fly in force to the north. \\\"Now the fourth beast was awesome and dreadful with teeth of iron, and claws of\\ncopper . It would eat and devour then stomped the residue with its feet.\\\" This fourth emer ged from the South\\nand represents the Ishmaelite kingdom As the chief of the angels said: \\\"The fourth beast will come to possess\\na kingdom greater than any kingdom, and will devour the entire world.\\\" \\\"And from the ten horns, ten kings\\nwill arise but after them yet another shall arise who in wickedness [136] will surpass all the previous ones\\\"\\n[Daniel 7].\\nIn the second year of the venerable Heraclius' grandson Constans' reign, V aghentin planned to deceive the\\nSenate through rhetoric and to personally acquire the throne, such that by crowning him, he would do what he\\nwanted with his military command. He made the yoke of service weigh heavy on the inhabitants of the city ,\\nhaving as his support the 3,000 armed troops which he had brought with him and numerous other troops\\nwhich had joined him. It was then that the men of the city gathered together before the patriarch, in the holy\",\"church of God, and told him that [they wanted to] eliminate the weight of their service. They sent to\\nVaghentin [telling him] to abolish their service, but he did not want to hear it. Now there was a certain one of\\nthe princes present, named Antoninos, who said to V aghentin: \\\"What is their alliance, what is their plot?\\nBesides, how could they dare to send you such a message? But if you command, I shall go and destroy their\\nalliance and plot, and shall chase each one back to his place, that your [g1 13] [137] will be done.\\\" [V aghentin]\\nresponded: \\\"Go and do as you said\\\" [Antoninos] arose and departed with a thousand men. As soon as he\\nentered the church he began severely beating the principals. At this, the patriarch rose to his feet and said: \\\"It\\nis too much, and unjust to do what you are doing here.\\\" Anton attacked him and slapped him on the jaw ,\\nsaying: \\\"Go to your place.\\\" Then the mob became agitated and attacked [Antoninos], seizing him and\\ndragging him through the city by his feet. After this they set him on fire. V aghentin was informed and he was\\nseized with trembling. Just then the mob poured in upon him, dragged him beyond the houses, beheaded him,\\nand then took [the corpse] to the same place where they had burned Antoninos, and burned that too. Then\\nthey confirmed Constans on the throne of the empire. They made T'eodoros, a certain one of the loyal princes\\nof Armenia, the general over those in the Byzantine sector .\\nAs soon as [T eodoros] took the military command, he beseeched the emperor as a favor to have clemency on\\nthose [people] who had been exiled to Africa, especially on [138] Aspet, son of Smbat called Xosrov Shum.\\nGod made the emperor's heart mild, and he ordered that [the exiles] be brought to the capital. He received\\nthem as though they were beloved [personages] of the realm. He made [Aspet's] son Smbat the first\\nspatharios  among all the spatharioi , and a candidate. Thus, in the fifth year of his reign, he returned to the\\nprevious order . [The emperor also had clemency on] V ahan Xorhxorhuni and others besides. [Constans]\\ndispatched a certain prince named T'uma to Armenia. He arrived, and did not want to destroy the oath\\n[existing] between the emperor and the prince of Mark'. He united all the princes and took them with him to\\nthe prince of Mark'. He spoke with him about peace. And he received many goods from him and promised\\nwith an oath that he would have T'eodoros sent to the palace bound, since he was the prince of the land of\\nArmenia. He then returned to the Armenian troops. As soon as [T'uma] reached the Kotayk' country , [his\\nmen] suddenly fell upon [T'eodoros], seized, bound, and had him sent before the emperor . Now when\\nemperor Constans heard of this, he was exceedingly wroth, for he had not ordered that [g1 14] [T'eodoros] be\\nbound. He commanded that he be released from bonds, and that the document accusing him be read. When\\n[Constansl learned what the treachery really was he ordered [139] that [T'eodoros] be summoned to his\\npresence. [Constans] received him with af fection and with the honor due to his authority He arranged a\\nstipend and funds for upkeep from the treasury . He then commanded that T'uma be summoned, but he did not\\norder him to enter the court. Rather , the examination was conducted outside [the chamber]. Lord T'eodoros\\nRshtuni was vindicated in his testimony and justice was done to him, T'uma was discredited and dropped\\nfrom honor . It was at this time that Aspet [Bagratuni] and T'eodoros, lord of Rshtunik', saw each other [again]\\nand shed tears upon each other's necks. For they had been nourished together at the court of Xosrov , king of\\nIran. But Aspet could not be reconciled with Byzantine rule, instead he plotted treachery . He requested an\\norder from emperor Constans so that [Aspet] could dispatch four men of his family to Armenia to bring him\\nsome things. The emperor commanded that the order be issued to him. Now [Aspet] disguised himself, took\\nalong three other men, reached the shore and showed the imperial order . He boarded a ship and quickly\\ncrossed the sea, resembling a bird, and soon reached T ayk' where he fortified himself. The people of T ayk'\\nreceived him with delight.\\nIn this period there was no small amount of turbulence in the land of Armenia, for a royal command arrived\\nfor the [140] general of Armenia to hold all the passes of the roads and to search the land's fortresses. Then it\\nbecame known that [Aspet] had returned and was fortified in T ayk', Armenia.\\nThen the Byzantine general, T'eodoros, together with the princes of the army and the naxarar s of Armenia\\nordered that kat'oghikos  Nerses should be sent to Aspet and vow to him [their] loyalty in requesting that the\\nauthority of the land be given to him, and that his wife and children be sent back to him.\"],\"start\":51,\"end\":53,\"length\":2},{\"chapter\":\"33\",\"pages\":[\"The kat'oghikos  went and made an oath with [Aspet] so that he would not depart. Then [the kat'oghikos\\nreturned. They wrote to emperor Constans to treat [Aspet] according to [g1 15] the oath he had promised. For\\nAspet had written to the emperor , saying: \\\"I am your servant and shall not leave your service. However ,\\nbecause some people told me 'Y ou will return to [the service of the country] whence you came,' I became\\nfrightened and fled. But now , if I am considered worthy , I shall serve you loyally and give my life for your\\npiety .\\\" Emperor Constans ordered that [Aspet] be made Curopalate, that he be given a crown of honor and the\\nauthority of the land. He further ordered that [Aspet's] wife and children be sent back with great splendor . He\\nhad [Aspet] given silver thrones and other very great gifts.\\n[141] Y et, before the hrovartak  arrived, before he was honored with the dignity of Curopalate, [Aspet]\\nbecame ill and died. They took his body and buried it near his father's, at Dariwnk'. The emperor established\\n[Aspet's] eldest son, who was named Smbat, in his father's dignity , giving him the authority of the aspetut'iwn\\nof his native tanuter dom. [The emperor] made [Smbat] drungarius  [drungar ] of his troops, and gave him a\\nwife from the Arshakuni House, one of his relatives, and dispatched him to the army , to his troops. After this,\\n[the emperor] sent T'eodoros, lord of Rshtunik' back to Armenia with great honor , giving him the same\\nauthority of military command [as he held before]—whether or not the princes of Armenia wanted it. He\\ncame and was established in the same authority .\\nThe next year , the Ishmaelite army came to Atrpatakan where it divided into three parts. One division went to\\nAyrarat; another , to the Sep'hakan Gund  area; and the third to Aghbania/Aghuania. Those who went to the\\nSep'hakan Gund  area spread out raiding, putting all of those parts to the sword, and taking booty and captives.\\nThey came and assembled at [142] Erewan [The Abgaryan edition has Herewan. See Abgaryan, p.314 n. 512,\\nwhere he speculates that the original text read Her ew and , and referred to the district of Her]. They battled\\nwith the fortress, but were unable to take it. They went to Ordspoy and were unable to take it. So they\\ndeparted, encamping across from the fortress of Artsap', near the water . [The Arabs] began warring with the\\nfortress, and suf fered no small amount of injury from those inside. Now there was a [secret] way out of the\\nfortress from the rear leading in the direction of Asoren. This [g1 16] was called Kaxanaktuts'. Now some men\\nthus descended from the fortress, to go to request an auxiliary force from Darawn fortress. And Smbat\\nBagratuni gave them his son, V araz Sahak, with forty men.\\nGoing at nighttime, they ascended to the fortress, not taking care [to conceal] the place. The Ishmaelites\\nfound the place and entered the fortress by the very same path. Before dawn they had seized the place. They\\ncame across ten guards asleep, whom they killed. \\nChapter 33.\\nThe Lor d frees the captives and destr oys the Ishmaelites. Those [Arabs] who had spr ead out raiding at\\nAyrarat strike T ayk', Iberia/Geor gia, and Aghbania/Aghuania. The naval battle between the Ishmaelites and\\nthe Byzantines. Pr ocopius [Pr hokop] goes to Mu'awiya [Muawiya], prince of the Ishmaelites, [143] and the\\npeace between [the Arabs] and Byzantines. The deeds of kat'oghikos  Nerses. The dispute over faith with the\\nArmenians. The Armenians' r eply to emper or Constans.\\nIn the second year of Constans' [reign], on a Sunday , the 23rd of the month of Horhi [Horhi: the second\\nmonth of the moveable Armenian calandar], the Ishmaelites shrieked before and behind the fortress and put\\n[the inhabitants] to the sword. Many were thrown from the height and were killed. After lowering the women\\nand children from the fortress, they wanted to kill them. There was no counting the captives, and there were\\nan extremely great number of cattle [which they seized]. But at dawn the next day the general of Armenia\",\"came upon them and visited inconceivable destruction on them. Now they were 3,000 select armed men,\\ndrawn from all the Ishmaelite forces, but [virtually] none of them escaped. A few , however , fled on foot, and\\nsecured themselves in Shamp [\\\"Swamp\\\"]. On that day , the Lord spared the multitude of captives from the\\nIshmaelites, and greatly destroyed Ishmael. T wo Ishmaelite princes, 'Uthman [A wt'man] and Ogomay\\n[Abgaryan: Ogbay , p. 317 n. 523], died. Great was the tiumph of the general of Armenia, and the latter sent to\\nConstans gifts from the booty , one hundred of the most [144] select horses. The emperor and the entire palace\\nwere pleased, and [Constans] sent great thanks [to T'eodoros].\\nNow that [Arab] army which was in the A yraratean region put to the sword areas as far as T ayk', Iberia, and\\nAghbania/Aghuania. They took booty and captives and passed on to Naxchawan where the other division was\\nbattling to take the fortress of Naxchawan. However , they were unable to take it. They took the fortress of\\nXram, killing [the men] and taking the women and children captive.\\nNow the [Arab general] who was in the Palestine area, ordered that a lar ge naval fleet be or ganized. He\\nboarded a ship and began warring with Constantinople. But his naval battle did not succeed, for a multitude\\nof [Byzantine] troops in boats came up before him, and sent [the Arabs] to the deep, driving of f many others\\nwith fire, and pursuing those who fled. Nonetheless, emperor Constans was horrified [by the attack] and\\nconsidered it wise to pay a tax/tribute [ sak], and to make peace by means of messengers. The Ishmaelites\\nhurried the Byzantines to complete a peace agreement. Now [145] Constans, the Byzantine emperor , because\\nhe was a lad, did not dare to do so without the approval of the army . So he wrote to Procopius for him to go\\nwith him to Damascus, to see Mu'awiya, prince of the Ishmaelite army , in order to make the terms of the\\nagreement in accordance with the desires of the troops. As soon as Procopius saw the imperial order and\\nlearned about matters from the troops, he went with them to Damascus to Mu'awiya, prince of the Ishmaelite\\narmy . He revealed the amount of the tribute, stated the limit, made peace, and departed.\\nAt that time Nerses, kat'oghikos  of Armenia, decided to build a dwelling for himself close by the holy\\nchurches in the city of V agharshapat, by the road where it is said king T rdat went before saint Gregory .\\n[Nerses] also built [g1 18] a church there named after the divine Zvart'nots' [\\\"Joyous Ones\\\"] the multitude of\\nheavenly soldiers who appeared in the vision of saint Gregory . He built a lofty structure of stunning beauty\\nworthy of the divine honor to which it was dedicated. [Nerses] led [the course of] a river [near to the church],\\nhe had all the stony areas worked on, and then planted vineyards and trees. T o the glory of God, he ordered\\nthat a lofty wall be constructed, which by its [146] beautiful design blended with nature.\\nBut that rebellious dragon did not cease and instead out of its cunning, wanted to war with God. It strove to\\nbring persecution upon the churches of the land of the Armenians. For in the time of Heraclius' grandson,\\nemperor Constans, it started working the guile of its wickedness taking as satellites those troops stationed on\\nByzantine [Armenian] land. Now the Armenians never accepted the Roman communion of the Body and\\nBlood of the Lord. [The soldiers] wrote a letter of complaint to the Byzantine emperor Constans and to the\\npatriarch, saying: \\\"W e are regarded as infidels in this land. For [the people here] are disrespectful toward\\nChrist God's Council of Chalcedon and the T ome of Leo, and they anathematize them.\\\" Then the emperor and\\nthe patriarch ordered that an edict be written to the Armenians telling them to unite with the faith of the\\nRomans and not to despise the Council or the T ome. Now there was [in Constantinople] a man named Dawit'\\nfrom the village of Bagrawan who had studied the art of philosophy . [Constans] ordered that he be dispatched\\nto Armenia to eliminate the opposition. All the bishops and naxarar s of Armenia assembled in Dwin by the\\nChrist-loving kat'oghikos , Nerses, and the pious general of Armenia, T'eodoros, lord of Rshtunik'. They saw\\nthe emperor's [147] order , and listened to the philosopher who taught the division of the T rinity according to\\nthe T ome of Leo. Having heard this, they did not agree to replace the correct doctrine of saint Gregory with\\nthe T ome of Leo. All were inclined to [g1 19] give a written reply .\",\"[The following is] a copy of the reply to the letter sent to Armenia by Constans, emperor of Rome, written by\\nthe bishops of Armenia, kat'oghikos  Nerses, the naxarar s and general T'eodoros, lord of Rshtunik'.\\nA true and orthodox Nicean letter . \\nI beseech those of you who hold the God-loving Christian faith to read this.\\nWe have the command of the caring prophets and apostles of Christ to make beseeching prayers for\\nyour God-loving realm, for all the princes, troops, and pious palace of ficials, wherein the love of\\nGod reposes and the signs of divine favor are apparent.\\nFor behold, [you possess] a kingdom greater and stronger [148] than all others, which was crowned\\nnot by human hands but by the right hand of God, which nothing except Christ's kingdom can equal.\\nBy the grace of God the same is true of [your] patriarchate.\\nThe naxarar s and Christ-loving troops—and we glory in the light of your God-loving kingdom—\\nwere unmoved by the wicked and impious Iranian kings. For when they abolished the kingdom, and\\ndestroyed all the troops of the land of Armenia taking men and women into captivity , brandishing\\nswords at the survivors and trying to convert [us] to fanaticism, they were unable to do so. Indeed,\\n\\\"the infidels were yet more embarassed in their folly [Psalms 24].\\\" [So matters continued] until king\\nKawad and his son Xosrov ordered that \\\"each individual should adhere to his own faith and no one\\nshould dare harrass the Armenians. All are physically our servants, but as for spiritual matters, He\\nWho judges souls knows about them.\\\" Then there was Ormazd's son Xosrov who [g120], after\\ncapturing Jerusalem, ordered all the bishops of the East and of Asorestan to assemble at Court. He\\nsaid to them: \\\"I hear that both sides are Christians yet that one group anathematizes the other . What\\ndo they regard as just? Now [149] let them come together at the royal court so that what is correct\\nwill be confirmed and what is false will be rejected.\\\" So all the bishops and priests and believers in\\nthose parts assembled, and [the king] established as their ostikan  Smbat Bagratuni (who was called\\nXosrov Shnum), and the chief physician of the Court. Present were the patriarch Zak'aria of\\nJerusalem who was in captivity and many other philosophers who were captured from the city of\\nAlexandria. King Xosrov ordered them to proceed with justice and to acquaint him with the truth.\\nAll of them assembled in the royal hall, and there was a commotion. For some were of the orthodox\\nfaith, [possessing] documents with the seals of ancient kings. Others were Nestorians, while many\\nothers were the rabble. The patriarch even came forward and said: \\\"Let that man not be called God,\\\"\\nand the king was informed.\\nThe king responded: \\\"By whose command has he come here? Let him be beaten and have him\\ndepart.\\\" He also ordered that the multitude of sectarians be removed from the atean . He ordered that\\nonly the [beliefs of the] Niceans, Constantinopolitans, [150] Ephesians, and Chalcedonians should\\nbe examined. Now there were two bishops from the land of Armenia present, trustworthy men who\\nhad been dispatched [to Iran] because of the violence in the land [of Armenia]. [They were]\\nKumitas, bishop of the Mamikoneans, and Matt'eos, [bishop] of the Amatunik', and had arrived to\\ninform the king. They had ready with them the document of saint Gregory . The king ordered that it\\nbe asked: \\\"During the reigns of which kings did those councils take place?\\\" And they replied: \\\"The\\nNicean Council took place under Constantine; the Council of [g121] Constantinople, under\\nTheodosius the Great; Ephesus, under Theodosius the Less; and Chalcedon, under Marcian.\\\" The\\nking replied: \\\"The orders of three kings seem more just than that of one king.\\\" Then the king started\\nasking about Nestorius, wanting to know who he was, where he was from, at which council had he\\nbeen present, and what he had said. Then he ordered that the Nestorians be removed from the atean .\\nSimilarly he inquired about the Council of Chalcedon, wanting to know who were its principals.\",\"They told him everything, saying \\\"[the heads of the councils of] Nicea and Constantinople were\\nemperors Constantine and Theodosius the Great themselves. The Council of Ephesus was presided\\nover by [151] Cyril, bishop of Alexandria and Chalcedon, by bishop T'eodoretos who was inclined\\ntoward Nestorius.\\\"\\nPresent [at this assembly] were [the cleric] called the Eran kat'oghikos , and other bishops from\\nAsorestan, Aruastan, Xuzhastan, and other lands. King Xosrov ordered that if they did not turn from\\ntheir heresies and walk the royal path, he would have all of their churches demolished, and have\\nthem put to the sword. He ordered that a tax be levied for the Chalcedonians, Iberians/Geor gians,\\nand the kat'oghikos  of Aghbania/Aghuania and many other bishops from the Byzantine area, and the\\nprinces who had come into the service of the Iranian king [? isk ork' zk'aghkedonin ew zV rats'. .ew\\nishxank' ` ork' ekeal ein i tsar hayut'iwn parsits' t'agaworin, or ov ew ch'ep'ayk'arn isk hramayeats'\\ntal]. However , he sought a contract from the two sides. He started to examine the Council of Nicea\\n(which was convened by Constantine): of Constantinople (under Theodosius the Great) of Ephesus\\n(under Theodosius the Less) and of Chalcedon (under Marcian). When he was familiarized with\\neverything justly and truthfully , he inquired: \\\"Why is it that those three do not mention the division\\nof [Christ's] [152] nature into two parts, as the others do? It is clear that even we must be divided in\\ntwo, that [even] the king has two, rather than one, nature. For I, too, am of two natures, one from the\\nfather and one from the mother , one spiritual, one physical. However , the Divinity which is not\\neverywhere [g122] despite what it wants, cannot be everything or do everything. What is Divinity?\\\"\\nThen [Xosrov] ordered that Zak'aria the patriarch of Jerusalem and the philosopher from the city of\\nAlexandria be ordered to tell the truth under oath. They replied: \\\"W e did not approach God wickedly\\nnor did he visit his anger upon us wickedly . Now , fearing God we shall speak the truth before you.\\nThe true faith is the one pronounced at Nicea before the venerable Constantine. [The councils of]\\nConstantinople and Ephesus were in accord with this as is the correct faith of the Armenians. The\\npronouncements of Chalcedon were not in accord with them, as your benevolence has learned.\\\" The\\nking ordered that the treasury be examined and they found [in the treasury a copy] of the true Nicean\\ncreed and the confession of faith of the land of Armenia which was sealed with the ring of king\\nKawad and of his son Xosrov . And this king Xosrov ordered that 'all Christians under my authority\\nshould hold the faith of the Armenians.' [153] Those uniting with the Armenians' faith were the\\nmetropolitan Kamyishov from Asorestan and ten other bishops, the God-loving queen Shirin, brave\\nSmbat, and the great Chief Physician. King Xosrov ordered that a copy of the correct confession of\\nfaith be sealed with his ring and placed in the royal treasury .\\n\\\"Now because God removed us from serving the authority of darkness and made us worthy of your\\ndivine kingdom how much more ought we to beseech Christ God that your pious and God-loving\\nkingdom remain unshaken for eternity , that days on earth be as days in Heaven filled with much\\ntriumph, ruling the entire world, land and sea. For although physically you are of the [g123] human\\nrace, nonetheless you sit on a divine throne and your God-loving kingdom is filled with the light of\\nglory which shines down upon all, you who are crowned from On High, the pride of all Christians,\\nwith the strength of the divine Cross. Y ou resemble the God-loving, pious, God-favored, brave,\\ntriumphant, salvation-working, blessed Heraclius, your father , who saved all countries from the\\nbitter executioner . May Christ God grant you the same because of your piety .\\\"\\n[There follows a lengthy discussion of doctrinal matters, which we omit. The translation resumes with chapter\\n34 grabar  p. 135.]\"],\"start\":53,\"end\":57,\"length\":4},{\"chapter\":\"34\",\"pages\":[\"[154] \\nChapter 34.\\nThe attack of the Hagar enes, and events in Rome.\\nOnce again I shall speak about the evil which befell us in our time, regarding how the veil of ancient faith\\nwas torn, and how that death-bringing dry heat breathed upon us and scorched the tall, beautiful, leafy trees of\\nour tender orchards. And this is the truth, for we sinned against the Lord and angered the saint of Israel.\\n\\\"Should it please you to heed me,\\\" he said, \\\"you shall take the land's goodness. But should you wish not to\\nlisten, the sword shall devour you, for this was uttered by the mouth of the Lord.\\\" This same whirlwind was\\nseen above Babylon and then reached every country . For Babylon is the mother of all nations and its realm,\\nthe kingdom of the North.\\nNow further south of them, namely , the Indians and the peoples dwelling in the great desert were the\\ndisowned sons of Abraham, born of Hagar and K'etura: Ishmael, Amram, Mogan, Madian, Y ek'san, Y esbok,\\nand Melisawe. And the sons of Lot were Amon and Movab; and those of Esau were Edom, and there were\\nothers yet, who dwelled to the north of the southen Indians in the enormous and vast desert, [being] disowned\\n[155] by Moses and the children of Israel. The prophet said about them: \\\"[They are] as a storm which comes\\nmoving from the south, from the terrible desert.\\\" That is the lar ge and terrible desert [I mentioned], from\\nwhich came that whirlwind of peoples, arising as a storm, and seizing and trampling every country . And the\\nsaying was fulfilled, that \\\"the fourth beast will create a fourth kingdom upon the earth, more wicked than all\\nother kingdoms, which will make a desert of every country\\\" [g135].\\nNow what shall I say about the agitation and calamitous disasters taking place within the empire of the\\nRomans, [the empire] which never ceased its internecine warfare? The principal men and advisors of the\\nrealm were drowned in blood, since it is said, they were plotting the emperor's death. As a result, all the\\nprincipal men and the princes of the empire were destroyed and the inhabitants of the land were reduced, until\\nthere was no advisor to be found. [Among those] killed were Geor g Magistros and that virtuous man, Manuel,\\nwho was the father -in-law of aspet  Smbat (son of Smbat the great, called Xosrov Shum). Some say that they\\nobserved a glowing light at the place where he was killed. Smbat was exiled. For the troops accused him of\\ntrying to rebel afterwards. They told the emperor that [Smbat had said] \\\"The [156] Magistros' blood must be\\navenged.\\\" He was a prince of the army there, and liked by all the troops. Smbat was prince of the Thracian\\nprinces' troops, while Manuel was a Magistros working in Constantinople. Now the emperor did not summon\\nthe Magistros with bold authority , since he feared a rebellion of the troops. Rather , he summoned the aspet\\nSmbat and made him swear by the Lord's Cross, which he possessed, that he would divulge nothing. Then the\\nemperor sent [Smbat] back to his troops to speak to the Magistros in peace, but to deceive him and bring him\\n[into captivity]. Now [Smbat] went but was unable to deceive him, especially since he did not conceal [the\\nemperor's] words. Then he spoke with all the princes of the army and gave [the Magistros] the imperial order .\\nSince they and all the troops were unable to resist the imperial order , they gave him into their hands. They\\nseized and bound him and took him into the emperor's presence As a result, the troops of the Thracian princes\\nplotted [Smbat's] death and said that he was planning to rebel, so that he would be put to death. However , the\\nemperor rejected them and spared [Smbat] [g136].\"],\"start\":57,\"end\":58,\"length\":1},{\"chapter\":\"35\",\"pages\":[\"Chapter 35.\\nThe Ishmaelites war with the Iranians and destr oy their lor dship. The death of Y azkert. The Medes and the\\nArmenians enter the service of the Hagar enes. Constans comes to Armenia. The Ishmaelites pr epare [to fight]\\nwith the Byzantines. Regar ding Nerses, kat'oghikos  of Armenia.\\nIn the twentieth year of king Y azkert of Iran [A.D. 652], in the eleventh year of emperor Constans (who was\\ncalled Constantine after his father), in the nineteenth year of the lordship of the Ishmaelites, the Ishmaelite\\narmy which was in the country of Iran and Xuzhastan went eastward to the area known as the Palhaw country\\n(which is the land of the Parthians) against Y azkert, king of Iran. Y azkert fled from them, but was unable to\\nescape, because [the Arabs] caught up with him close to the Kushans' borders, and destroyed all of his troops.\\n[Yazkert] fled to the army of the T'etals who had come from dif ferent areas to help him. Then there was the\\nMarats' prince, about whom I spoke earlier . He had gone to the east to their king, rebelled, fortifying himself\\nin one place, requested an oath from the Ishmaelites, and went to the desert to serve the Ishmaelites. Now the\\nT'etal troops seized Y azkert and killed him. He had reigned for twenty years. And so ended the lordship of the\\nIranians and [158] the House of Sasan, which had ruled for 642 years.\\nWhen the king of the Ishmaelites saw the success of these victories, and that he had done away with the\\nkingdom of Iran, [he became confident], and when three years of the peace provision had passed, [the Arab\\ncaliph] no longer wanted to continue the peace with the Byzantine emperor . So he ordered his troops to\\ncommence warfare on land and sea, to do away with this kingdom as well, in the twelveth year of the reign of\\nConstans [g137].\\nIn the same year the Armenians rebelled, withdrawing from the Byzantine empire, and entering the service of\\nthe Ishmaelite king. T'eodoros, lord of Rshtunik' and all the princes of Armenia made an oath until death, and\\nan agreement [lasting] until the grave to break the divine harmony [between Armenia and Byzantium]. The\\nIshmaelite prince spoke with them as follows: \\\"Let this be an oath of peace between myself and you [lasting]\\nas many years as you wish. I shall not take tribute [ sak] from you for three years after which, by oath, you\\nmay pay what you wish. Y ou may keep 15,000 cavalry in your land. Provide sustenance from your land and I\\nshall include it in the royal tax. I shall [159] not demand that the [Armenian] cavalry be sent to Syria though\\nlet it be ready to go and fight wherever else I order it. I shall send no emirs to [your] fortresses, nor even a\\nsingle Arab of ficer or cavalryman. Let no enemy enter Armenia, but should the Byzantines come against you,\\nI shall dispatch as lar ge an auxiliary force as you want. And I swear by God the Great that I shall not break\\nthis vow .\\\" Thus did the satellite of the anti-Christ pull [the Armenians] away from the Byzantines [This\\nsection, unlike the major portion of the book uses hrhomots ' (Romans) instead of yunats'  (Greeks) for the\\nByzantlne empire.]. For although the emperor wrote them many requests and entreaties and summoned them,\\nthey did not want to listen to him. Then [the emperor] said: \\\"I shall come to the city of Karin and you should\\ncome to me. For I want to give you stipends in aid and plan together with you what we should do.\\\" Despite\\nthis [the Armenians] did not want to heed him.\\nAll the Byzantine troops complained and grumbled about the lord of Rshtunik' and about the Armenians\\nbefore their emperor about the blows [inflicted] at Mardots'ek'. They said: \\\"[The Armenians] have allied with\\nthe Ishmaelites. They made us trust them, encouraged the troops to go raiding to Atrpatakan, then had [the\\nArabs] attack us unexpectedly [160] and defeat us. W e left everything there. Now let us go to Armenia and\\nget our things.\\\"\",\"Then emperor Constans agreed to do the will of the troops. He took 100,000 of his troops and went to\\nArmenia. As soon as he reached Derchan, Ishmaelites came before him [g138] and gave him a letter from\\ntheir prince which said: \\\"Armenia is mine, so do not go there. But should you go, I will deal with you in such\\na way that you will be unable to flee.\\\" Now emperor Constans said: \\\"That land belongs to me, and I shall go\\nthere. Should you come against me, God will be the judge of what is just.\\\" And he went to the city of Karin in\\nthe twelveth year of his reign and in the twentieth year of the lordship of the Ishmaelites.\\nThe emperor Constans spent several days in the city of Karin/Erzerum. The princes and troops from so-called\\nFourth Armenia came before him, as did all the troops and princes from that area who had separated from\\n[the followers of] Rshtunik'. [Among them] were the Sperats'ik', the Bagratid princes, the Managhayk', the\\nDaranaghayk', those from the district of Ekegheats', all the troops from those places, and the Karnats'ik',\\nTayets'ik' and Basenats'ik'. Also coming into [Constans'] presence there were the princes of V anand with their\\ntroops, [161] the Shirakats'ik', Xorxorhuni, men from the House of Dimak'sen; Mushegh Mamikonean with\\nhis people, certain other princes, troops from the A yrarat area, the Arhawegheank', Arhaneank' V arazhnunik',\\nGnt'unik', Spandunik' and others. Kat'oghikos  Nerses had come from T ayk' and visited [the emperor]. All the\\nprinces told the emperor about the plan and desire of rebellion of the lord of Rshtunik' and about the quick\\ntraffic of Ishmaelite emissaries going to see him. Then the emperor and all of his troops anathematized the\\nlord of Rhshtunik', removed him from the dignity of authority and dispatched another man in his place\\naccompanied by forty men. When they reached [T'eodoros] he had them seized and bound, sending some to\\nthe fortress of Baghesh and others to the islands in [Lake] Bznunik' [Lake V an]. Then he himself went to the\\nisland of Aght'amar commanding the troops of those areas to go and secure themselves in their own districts.\\nUnited with him were the Iberians/Geor gians, Aghbanians/Aghuanians and Siwnets'ik' who, in accordance\\nwith his order , went to their own lands and fortified themselves there. Now T'eodoros, lord of V ahewunik',\\nseized Arp'a fortress. His son, Grigor , was the son-in-law of the lord of Rshtunik' [g139]. V araz Nerseh\\nDashtkari secured himself out in the open and seized the treasury , since all the treasures [162] of the land, the\\nChurch, the princes, and merchants were there.\\nNow as soon as emperor Constans heard about this, he wanted to loot the multitude of the troops and to go\\nand winter in Armenia, in order to destroy the country . But then the kat'oghikos  Mushegh and all the princes\\nprostrated themselves and with great and tearful entreaties asked for clemency so that [Constans] not become\\ntotally enraged because of their of fenses and destroy the country . The emperor heeded their requests and\\nreleased the multitude of troops. Then he himself went to A yrarat with 20,000 troops and to Dwin where he\\nresided in the home of the kat'oghikos . The emperor made Mushegh lord of the Mamikoneans, prince of the\\nArmenian cavalry and dispatched him with 3,000 men to the area of the sep'hakan gund . Likewise, he sent\\nsome of his troops to Iberia, Aghbania, and Siwnik' to destroy their alliance. Other troops invested the area\\naround the emperor , in the mountains and plains. While for some time they did not want to submit, later on\\nthey did go into [imperial] service. However , [those] in Aghbania, Siwnik', and the sep'hakan gund  [area] did\\nnot submit. [Imperial troops] looted their country , taking whatever they found, and then returning to the king. \\n[163]\\nRegarding the Armenian k a t ' o g h i k o s Nerses.\\nNow I shall relate a few things about Armenia's kat'oghikos  Nerses. He was originally from the village of\\nIshxan in T ayk'. From childhood he was raised on Byzantine land, had learned the language of the Romans,\\nand circulated about the land as a member of the military . He had accepted the Council of Chalcedon and the\\nTome of Leo. He did not reveal [g140] his plans of impiety to anyone until he reached [the of fice of] the\\nepiscopacy of the land. Subsequently he was called to the kat'oghikos al throne. He was a man of virtuous\\nbehavior , of fasts and prayers. But within his heart was concealed the poison of bitterness: he planned to\\nmake the Armenians accept the Council of Chalcedon, but did not dare to do anything about it until emperor\",\"Constans came and stayed at the home of the kat'oghikos  and on Sunday preached the Council of Chalcedon\\nin the church of saint Gregory . The mass was of fered in Latin by a Roman priest, and the emperor , the\\nkat'oghikos , and all the bishops took communion—those who wanted to and those who did not. Thus did the\\nkat'oghikos  shake the true faith of saint Gregory which all [previous] kat'oghikoi  had held firmly in the holy\\nChurch, from [the time of] [164] saint Gregory to this day . And [Nerses] fouled the limpid, clear waters of the\\nfountains [a plan] which he had in mind for a long time, but which he dared not to reveal until that day . But\\nwhen the time was right, he worked his will, betraying the bishops one by one, and disheartening them with\\nterror . [He threatened them] to the point that all of them carried out the command to commune under fear of\\ndeath. [They communed] even more so because [their mentors], the venerable and most fundamental\\n[bishops] had died. But a certain bishop silenced and countered the emperor in his presence. Earlier all the\\nbishops had subscribed with him and he had cursed the Council of Chalcedon and the T ome of Leo and\\nrejected communion with Byzantium. This was sealed with the ring of the kat'oghikos , and the rings of all the\\nbishops and grandee princes. They gave it to him to keep in the church. Now when mass was of fered and all\\nthe bishops communed, the bishop whom I mentioned earlier , did not commune. Rather he descended from\\nthe bema  and was hidden in the crowd.\\nAs soon as the ceremony of communion was finished, and the emperor entered [his] room, the kat'oghikos\\nand the Byzantine priest betrayed [the bishop] and made a complaint about him, saying: \\\"He did not sit on\\n[his] throne and did [165] not commune with us, regarding us and you unworthy . He left the bema  and\\nconcealed himself in the crowd.\\\" The [g141] emperor became angry and ordered two men to go seize him and\\nbring him to him in the room. [When this was done] the emperor asked: \\\"Are you a priest?\\\" The bishop\\nreplied: \\\"If God and your glory so will it.\\\" The emperor said: \\\"And who are you that you regard neither me,\\nyour king, nor your kat'oghikos  and our father as worthy of communing with you?\\\" The bishop replied: \\\"I am\\na sinful, worthless man, and unworthy of communing with you; however , should God make me worthy of\\n[communing with] you I would consider that I enjoyed [communion] with Christ at [His] T able and from His\\nHands.\\\" The emperor retorted: \\\"Enough of that. Now tell me, is that the kat'oghikos  of Armenia, or not?\\\" The\\nbishop answered: \\\"Indeed, just as saint Gregory was.\\\" The emperor asked: \\\"Do you have that [respect] for the\\nkat'oghikos ?\\\" \\\"Y es,\\\" he said. \\\"W ill you take communion with him?\\\" [The bishop answered:] \\\"Just as with\\nsaint Gregory .\\\" The emperor asked: \\\"Then why is it that you did not commune today?\\\" The bishop replied:\\n\\\"Benevolent king, when we had but seen your image painted on the wall we were seized with trembling.\\nBehold [how much more frightening it is] now , to see you face to face and to speak with you directly . We are\\nignorant benighted people who know [166] neither [your] language nor [your] literature. But if we study first,\\nwe shall then master it. May your benevolent command rule by healing. He [the kat'oghikos ] has gone beyond\\nall the [religious] commands of this land. Four years ago he convened an assembly and all the bishops\\nassembled here. He had a document regarding the faith made. Then he, I, and all the princes sealed this with\\nour rings. That document is now with him. Order that it be sought and examined.\\\" And he was silent. The\\nemperor realized his treachery and reprimanded him a great deal in his own language. The emperor then\\nordered [the bishop] to go and commune with the kat'oghikos . As soon as the bishop fulfilled the emperor's\\norder , he said: \\\"May God bless your benevolent and pious rule forever , and may you rule over all the seas and\\nlands with much triumph\\\". The emperor likewise blessed the bishop [g142], saying: \\\"May God bless you.\\nYou did what befits your wisdom, and I am thankful.\\\"\\nThe emperor hastened to Constantinople with great ur gency , to reach it quickly . He departed in haste. He\\nmade a certain Morianos the prince of Armenia [and gave him] [167] an Armenian force which was from the\\narea.\\nNow when emperor Constans left Dwin, the kat'oghikos  went with him. [The kat'oghikos ] went and stopped\\nin Tayk' and did not return to his place, for the prince of Rshtunik' and the other princes with him directed\\nincredible rage at him. Now T'eodoros, lord of Rshtunik', and his son-in-law , Hamazasp, lord of the\\nMamikoneans, were lying in ambush at the island of Aght'amar . He requested troops from the Ishmaelites and\"],\"start\":58,\"end\":61,\"length\":3},{\"chapter\":\"36\",\"pages\":[\"7,000 men came to his aid. He stationed them at Aghiovit and Bznunik', then he came and remained with\\nthem.\\nWhen winter had passed and it was close to great Easter , the Byzantines fled and went to T ayk', but were\\nexpelled. They were unable to station themselves anywhere, but rather fled to the shores of the [Black] sea,\\ndestroying the entire country . They captured the city of T rapizon amassing a great deal of loot, booty , and\\ncaptives.\\nAfter this, T'eodoros, lord of Rshtunik', went to the Ishmaelite prince Mu'awiya in Damascus and saw him\\nwith very great gifts. And the Ishmaelite prince gave him clothing made with gold and silver threads and a\\nveil [or: banner], after their fashion. [Mu'awiya] gave [T'eodoros] authority over Armenia, [168] Iberia,\\nAghbania/Aghuania, Siwnik', as far as Kapkoh and the Chora Gate, and released him with honor . [Mu'awiya]\\nstipulated that he should bring that country into service. The breaking of the peace which had existed between\\nConstans and Mu'awiya the Ishmaelite prince, took place in the eleventh year of Constans' reign. The king of\\nthe Ishmaelites ordered that all his troops should assemble in the W est and make war on the Byzantine\\nempire, to take Constantinople and to eliminate yet another kingdom [g143]. \\nChapter 36.\\nThe letter of the Ishmaelite king to the Byzantine emper or Constans. The Ishmaelite prince Mu'awiya comes\\nto Chalcedon and is vanquished by the Lor d.\\n\\\"If you want to spend your life in peace,\\\" he wrote, \\\"abandon that foolish faith which you learned\\nfrom childhood. Deny that Jesus and turn to the great God whom I worship, the God of our father\\nAbraham.\\n\\\"Send the multitude of your troops away from you, back to their own places. I shall make you a\\ngreat prince in that region. I shall send ostikan s to your city , examine all the treasures, and order\\nthem divided into four parts. [169] Three parts will go to me, one part to you. I will give you as\\nmany troops as you need, and take as tribute as much as you are able to give. Otherwise, how can\\nthat Jesus whom you call Christ—who was unable to save himself from the Jews—possibly save\\nyou from me?\\\"\\nAll the troops in the east, in Iran, and Xuzhastan, in the Indian area, from Aruastan and Egypt assembled by\\nMu'awiya, prince of the army , who resided in Damascus. They readied military vessels at Alexandria and all\\nthe coastal cities and filled the boats with soldiers and [war] machinery . They had three hundred very lar ge\\nvessels with 1,000 very select cavalrymen in each boat. [Mu'awiya] also ordered that 5,000 light boats be\\nmade. Because of their light weight, he placed few men in them, 100 men per ship, so that they swiftly glide\\nover the waves of the sea surrounding the very lar ge boats. Then [Mu'awiya] dispatched them across the sea.\\nHe took the troops which were with him and went to Chalcedon. As he approached, all the inhabitants of\\nevery land submitted to him, the shore-dwellers, mountain-dwellers, and plains-dwellers. Now the multitude\\nof the [g144] Byzantine troops went and entered Constantinople to guard the city . Meanwhile the corrupter\\n[Mu'awiya] entered Chalcedon in the 13th year of Constans. At the shore he had or ganized many light ships\\nso that when the heavier boats reached Chalcedon he would quickly go to their aid. [The Arabs] [170] had a\\nletter from their king taken to Constans in the city .\\nThe emperor took the letter and entered the House of God. He prostrated himself and said:\",\"\\\"See, Lord, how these Hagarenes insult Y ou. Have mercy upon us, Lord, as we place our hopes in\\nYou. Shower them with contempt and avenge Y our Name, Lord. Let them be kept in embarrassed\\nconfusion forever and be destroyed in shame. Let them learn that Y our Name is Lord and Y ou alone\\nare high above every country .\\\"\\n[Constans] removed his crown and his purple robes and donned a hair shirt. He sat upon ashes and ordered\\nthat a fast be proclaimed in Constantinople after the fashion of Nineveh.\\nThen behold, the lar ge ships arrived at Chalcedon from the Alexandria area together with all the small ships\\nand all their equipment. For they had equipped the boats with engines of war , shooting machines, rock-\\nhurling machines, archers and slingers. [They were designed] so that when they reached the city wall they\\nwould easily be able to go over the wall into the city , from the summits of the towers. When [the Arabs] were\\nabout two aspar ez distant from land, the dreadful power of the Lord was revealed. For the Lord [171] made a\\nsign and caused a violent wind to blow from Heaven. The wind arose, [turned into] a great storm, stirred the\\nsea from the depths and rose to the surface creating waves as tall as the crests of lofty mountains. The wind\\nwhich howled at them crashed and thundered like a storm cloud. The abyss gur gled and the towers fell, the\\nmachinery was destroyed, the ships were demolished, and the multitude of [g145] troops sank into the depths\\nof the sea. The survivors were dispersed on planks, and, tossed about by the rising and falling of the waves,\\nwere killed. For the sea opened its mouth and swallowed them, and not a single one survived. That day , God\\nwith His arm raised, spared the city because of the prayers of the pious emperor Constantine. The violence of\\nthe wind and the churning of the sea did not end for six days.\\nWhen the Ishmaelites saw the dreadful power of the Lord, their hearts broke. Quitting Chalcedon at night,\\nthey returned to their own place. The other army which was stationed in the Cappadocia area made war on the\\nByzantine troops. The Byzantines struck them and they fled to Aruastan, subjecting Fourth Armenia to\\nlooting. When fall had passed and winter was near , the Ishmaelite army came and [172] encamped at Dwin. It\\nplanned to go and put Iberia/Geor gia to the sword. [The Ishmaelite commander] communicated [with Iberia]\\nby means of a threatening message which said: \\\"Either you enter our service, or you leave the country and\\ndepart.\\\" But [the Iberians] did not accept this. Rather , they prepared to resist them in war . The Ishmaelites\\nwent against them to make war and to extirpate them completely .\\nNow when they were on the road, cold and the snow of winter fell on them. As a result, they hastily departed\\nfor Asorestan, and did not work injustice in Armenia.\\nThen the princes of Armenia who were in the Byzantine and the Arab sections, Hamazasp and Mushegh and\\nall the others, came together in one place and united, making peace with each other so that the sword and\\nbloodshed not appear in their midst, so that they pass the winter in peace, and spare the shinakan s [peasants].\\nFor the lord of Rshtunik' had fallen ill and had gone to the island of Aght'amar , and was unable to go out or to\\nthink of anything. [The princes] divided [g146] the country on the basis of the number of cavalrymen each\\n[prince had], and established taxes in gold and silver .\\nOne could observe there the misfortunes of doubt similar [173] to the [reactions] of a sick person when the\\npain grows severe and he cannot speak. Such things occurred. For there was nowhere for a man to flee to and\\nhide, nor was he protected from within. Rather , he resembled someone who had fallen into the sea and was\\nunable to find a way out.\\nNow when the lord of Rshtunik' saw this, he requested troops from the Ishmaelites to strike and persecute\\nArmenia and to put Iberia to the sword.\"],\"start\":61,\"end\":63,\"length\":2},{\"chapter\":\"37\",\"pages\":[],\"start\":63,\"end\":63,\"length\":0},{\"chapter\":\"38\",\"pages\":[\"Chapter 37.\\nThe Medes r ebell fr om the Ishmaelites.\\nIn that year the Medes rebelled from Ishmaelite service and killed the Ishmaelite king's prince [in char ge] of\\ntaxation. They took refuge in the strongholds of the land of Medes, the deep forests, the chasms, rocky places,\\nthe troublesome deep valleys which are by the Gaz river and Marats' mountain; and [they took refuge] in the\\nmight of the vigorous and brave peoples dwelling in them, Deln and Delumn [Abgaryan, p. 360 n.653 emends\\nthis to Geghn  and Delamn  and takes it as a reference to the peoples of Gilan and Daylam, by the southern\\nshores of the Caspian Sea.].\\n[174] For they were unable to bear the bitter and harsh service and the weight of the tax which had been\\nimposed on them. Each year 365 sacks of money were taken from them. From those who could not pay they\\ntook a man for each dram  and eliminated the cavalry and the principality of the land. For such reasons they\\nplaced their lives in the balance and one out of two thought it better either to die, or to be freed from that\\nwicked service. They started [g147] to assemble the remaining people into an army and to or ganize by\\nbrigades so that perhaps they might escape the dragon's teeth and the bitter breath of the beast.\\nNow the multitude of the Ishmaelite troops saw that their work was not succeeding in the region of the secure\\nMarats' mountains. For they had not even been able to subjugate the Ket'rus and Skiwt'eay with all the\\nmultitude [staying] in secure places. Many [Arabs] lost their lives at the strongholds, falling headlong into the\\ndeep valleys. Many were pierced by arrows in the rough thorn patches, [arrows] shot by brave, manly\\nwarriors. [The Arabs] fled the place heading north toward the people who dwell by the Caspian Gates. They\\nreached the Chora pass, crossed it, and destroyed all parts of the land by the foot of the mountain. A small\\nforce resisted them [175] [at a place] called the Gate of the Huns and struck at them, for they were the\\ndefenders of the place.\\nAnother army arrived from the T'etal area and the two armies clashed with great violence. The Ishmaelite\\narmy was defeated by the T'etal army which struck at them and put them to the sword. Now the survivors\\nwere not able to flee through the pass since another T'etal army had come to assist the first army . So [the\\nArabs] headed for the great and rugged mount Caucasus. Barely going over a side of the mountain, a few\\n[Arabs] escaped by a hairbreadth, naked, barefoot, on foot, and wounded. Thus did they go to the Ctesiphon\\narea, to the country of their habitation [g148]. \\nChapter 38.\\nMushegh r ebells fr om the Byzantines and enters the Ishmaelites' service. The battle of the Ishmaelites with the\\nByzantines at Naxchawan, the destruction of the Byzantines and the destruction of Armenia. Once mor e the\\nArmenians quit Ishmaelite service and submit to the Byzantines. Hamazasp, lor d of the Mamikonean,\\nbecomes Cur opalate, as a r esult of which the Ishmaelites kill the hostages. Discor d breaks out among the\\nIshmaelite army and they separate fr om each other . Their prince Mu'awiya conquers all of them, becomes\\nking, and makes peace among them.\",\"Now Mushegh, lord of the Mamikoneans, rebelled in the [176] Byzantine area and entered Ishmaelite service.\\nAnd in that same year the Ishmaelite army which was in the land of Armenia seized the entire country from\\nend to end. T'eodoros, lord of Rshtunik', and all the princes of the land united and entered [Arab] service,\\nhastening to do their bidding in every way , for fear of a terrible death hung over them.\\nIn that year the venerable and pious man Artawazd Dimaksean was betrayed by a jealous brother and\\ndelivered up to the merciless executioner named general Habib, who resided at Ashnak, Aruch. He put\\n[Artawazd] to a very cruel death.\\nNow it was extremely cold winter and the Byzantines were harassing them. But because of the cold, [the\\nArabs] were unable to engage them in war . Instead, they arose unexpectedly , crossed the river , and went and\\nfortified themselves at Zarehawan. When the Byzantines saw this, they did not concern themselves about\\nthem, but rather destroyed the fortress of Dwin, went to Naxchawan and fought with the fortress so that they\\nmight destroy it too. The general of the Byzantine army was a certain Mawrianos who was said to be a\\ntrustworthy man.\\n[177] When spring arrived, [the army] was or ganized and readied to war with the Ishmaelite army . But\\nMawrianos, becoming stubborn, thought that he himself would accomplish the work. The Arabs campaigned\\nagainst the Byzantines who [g149] were fighting with the fortress of Naxchawan. They struck and put them to\\nthe sword and put the survivors to flight. Mawrianos fled to Iberia. The Ishmaelite army turned back and\\nbesieged the city of Karin, battling with it. Since [the inhabitants] were unable to resist them in war , they\\nopened the city gates and submitted. [The Arabs] entered the city , gathered up the gold, silver and entire\\nmultitude of the city's goods, robbed the entire country of Armenia, Aghbania/Aghuania, and Siwnik', and\\ndenuded all the churches. As hostages they took the chief princes of the land, their women, and many sons\\nand daughters.\\nT'eodoros, lord of the Rshtunik', and his relatives went along with them and took them to Asorestan.\\nT'eodoros, lord of Rshtunik', died there. His body was brought to his own district, and he was buried in the\\ntomb of his fathers.\\nHamazasp, lord of the Mamikoneans, son of Dawit', held authority in the land of Armenia. He was a man\\nregarded as [178] virtuous by everyone. But he was delicate, a reader and a scholar , not—like his patrimonial\\nfamily—skilled and adept at military exercises. He did not enter battle and did not see the enemy's face. But\\nhe began to strive for the bravery native to his ancestral House, fervently striving to accomplish an act of\\nbravery as was the wont of his ancestors. He entreated Heaven to give leadership and triumph to him and to\\nmake him brave.\\nAs I said earlier , Nerses, the kat'oghikos  of Armenia, departed with the emperor and went with him to\\nConstantinople. He was received there with honor . They gave him goods and released him to his place. He\\nwent and remained in T ayk' until the lord of Rshtunik' died and the Arab raids stopped. After six years of\\npersecution, he returned to his place and was established on the throne of the kat'oghikos ate [g150]. He\\nhastened to complete the construction of the church which he had built on the avenue of the city of\\nVagharshapat.\\nI have futilely strung together words into a history , following the uninspired counsel of my own mind, and not\\nthe worthy blessing of knowledge. But I did examine the order of scholars and confirmed [my account] with\\nthe words of the prophets uttered at the command of the Lord. For although [179] the former is quickly\\nfulfilled, the latter is fulfilled for eternity as the Lord said: \\\"Heaven and earth may pass, but My words will\\nnot pass\\\" [Matthew 24. 35]. \\\"For from My anger fire will be roused, will burn, and descend to the depths of\\nhell\\\" [Jeremiah 15. 14]. What [the Lord] said about these people is clear: \\\"They will be burned with fire, and\\nthe bases of their mountains will be disturbed\\\"; speaking about the tyranny of the grandee princes: \\\"I shall\",\"pour out all types of evil upon them, and exhaust them with my arrows.\\\" For just as arrows fly from the well-\\ncurved bow of a strong man toward the tar get, so do [the Arabs] who come from the Sinai desert to destroy\\nthe entire world with hunger , the sword, and great terror . The fact that the fire blazed out in the desert area\\nwas clearly indicated [by the Lord] when He said: \\\"I shall set incurable snares upon them, the beasts of the\\ndesert who will drag [their prey] here and there across the earth.\\\" As the prophet Daniel thundered: \\\"The\\nfourth beast is frightful and awesome and very strong. Its teeth are iron, its claws are copper; it eats then spits\\nout and stomps on the food\\\" [Daniel 7. 7] and so forth. The final words are: \\\"The day of [180] their\\ndestruction is at hand, and the Lord has come upon them in His preparation\\\" [Jeremiah 46. 21]. This too will\\nbe fulfilled in its own time.\\nThat same year the Armenians stopped serving the Ishmaelites and submitted to the Byzantines. Emperor\\nConstans made Hamazasp, lord of the Mamikoneans, Curopalate, giving [g151] him a silver throne and\\nauthority over the land of Armenia. He gave honors to the other princes and treasures to the troops.\\nWhen the king of the Ishmaelites saw that the Armenians had withdrawn from him, he had all of the hostages\\nwho had been taken from the country—some 1775 souls—put to the sword. Some twenty two [hostages] who\\nwere not in the place were the sole survivors.\\nNow Mushegh, lord of the Mamikoneans, was unable to quit Ishmaelite service because four of his sons were\\nhostages kept by them. The three sons of Hamazasp and one brother were hostages. However , they sought\\nhim and other princes together with their women, to bring them to Syria. For this reason [the princes]\\npreferred death to life, withdrew from [181] [Arab] service and, using speedy travel, submitted to the\\nByzantine emperor . United with them were the princes and troops of Aghbania/Aghuania and the princes of\\nSiwnik' together with their land. Previously they had been attached to the geographical unit of Atrpatakan\\n[yashxaragirn  Atrpatakani  \\\"to the census of Atrpatakan\\\"] until the Iranian kingdom was ended. When the\\nIshmaelites ruled, they were conquered and united with Armenia. [The Arabs] arrested Mushegh and the\\nother princes who were with him.\\nThe [Arab] king ordered that the other princes who had been arrested should be set free; however , he\\ndemanded that Mushegh remain with him.\\nThen God sent discord into the army of the sons of Ishmael. Their unity dissolved, they clashed with each\\nother and divided into four parts. One part was in the Indian area. Another was that army which held\\nAsorestan and the northern areas. Another was the one in Egypt and in the T'etal region. Another was in the\\nTachik area and at the place called Askarawn. They began fighting with each other and destroyed each other\\nwith endless killings. Now the troops who were in Egypt united with those in the [182] T achik area and they\\nkilled their king and took the multitude of treasures as loot [g152]. They enthroned another king and returned\\nto their places.\\nNow when their prince Mu'awiya, who was in Asorestan and was second to their king, saw what had\\nhappened, he united his troops and he too went to the desert. He killed the king whom they enthroned,\\nbattling with and severely destroying the troops in the T achik area. He then returned to Asorestan in triumph.\\nNow the army which was in Egypt united with the Byzantine emperor , made peace and was incorporated. The\\nmultitude of the troops, some 15,000 people, believed in Christ and were baptized. But the bloodshed of\\ncountless multitudes increased and intensified among the Ishmaelite armies. They engaged in frantic battles\\nand killed each other . Nor were they able to stop even somewhat from wielding swords, taking captives and\\nintense battles on land and sea, until Mu'awiya grew strong and conquered all of them. He subdued them,\\nruled as king over the property of the sons of Ishmael and made peace with everyone [g153]. \\nAmen\"],\"start\":63,\"end\":66,\"length\":3}]}",
    "book_index": "[{\"header\":\"Menu/Table of Contents\",\"page\":\"1\"},{\"header\":\"Translator's Preface\",\"page\":\"6\"},{\"header\":\"A Note on Pagination\",\"page\":\"7\"},{\"header\":\"Additional Resources\",\"page\":\"8\"},{\"header\":\"Sebeos' Prologue.\",\"page\":\"10\"},{\"header\":\"CHAPTERS:\",\"page\":\"11\"},{\"header\":\"1\",\"page\":\"11\"},{\"header\":\"2\",\"page\":\"13\"},{\"header\":\"3\",\"page\":\"17\"},{\"header\":\"4\",\"page\":\"22\"},{\"header\":\"5\",\"page\":\"22\"},{\"header\":\"6\",\"page\":\"23\"},{\"header\":\"7\",\"page\":\"24\"},{\"header\":\"8\",\"page\":\"25\"},{\"header\":\"9\",\"page\":\"26\"},{\"header\":\"10\",\"page\":\"26\"},{\"header\":\"11\",\"page\":\"27\"},{\"header\":\"12\",\"page\":\"28\"},{\"header\":\"13\",\"page\":\"29\"},{\"header\":\"14\",\"page\":\"29\"},{\"header\":\"15\",\"page\":\"30\"},{\"header\":\"16\",\"page\":\"30\"},{\"header\":\"17\",\"page\":\"31\"},{\"header\":\"18\",\"page\":\"32\"},{\"header\":\"19\",\"page\":\"33\"},{\"header\":\"20\",\"page\":\"34\"},{\"header\":\"21\",\"page\":\"35\"},{\"header\":\"22\",\"page\":\"36\"},{\"header\":\"23\",\"page\":\"37\"},{\"header\":\"24\",\"page\":\"38\"},{\"header\":\"25\",\"page\":\"41\"},{\"header\":\"26\",\"page\":\"41\"},{\"header\":\"27\",\"page\":\"44\"},{\"header\":\"28\",\"page\":\"45\"},{\"header\":\"29\",\"page\":\"46\"},{\"header\":\"30\",\"page\":\"48\"},{\"header\":\"31\",\"page\":\"51\"},{\"header\":\"32\",\"page\":\"52\"},{\"header\":\"33\",\"page\":\"54\"},{\"header\":\"34\",\"page\":\"58\"},{\"header\":\"35\",\"page\":\"59\"},{\"header\":\"36\",\"page\":\"62\"},{\"header\":\"37\",\"page\":\"64\"},{\"header\":\"38\",\"page\":\"64\"}]"
}